linux_types = {
{
  'gnet_dump': [ size : 0x58, {
    'lock': [0x0, ['pointer', ['spinlock']]],
    'skb': [0x8, ['pointer', ['sk_buff']]],
    'tail': [0x10, ['pointer', ['nlattr']]],
    'compat_tc_stats': [0x18, ['int']],
    'compat_xstats': [0x1c, ['int']],
    'xstats': [0x20, ['pointer', ['void']]],
    'xstats_len': [0x28, ['int']],
    'tc_stats': [0x30, ['tc_stats']],
}],
  '__unnamed_0x18b8b': [ size : 0x8, {
    'udp_table': [0x0, ['pointer', ['udp_table']]],
    'hashinfo': [0x0, ['pointer', ['inet_hashinfo']]],
    'raw_hash': [0x0, ['pointer', ['raw_hashinfo']]],
}],
  'fiemap_extent': [ size : 0x38, {
    'fe_logical': [0x0, ['unsigned long long']],
    'fe_physical': [0x8, ['unsigned long long']],
    'fe_length': [0x10, ['unsigned long long']],
    'fe_reserved64': [0x18, ['array', 2, ['unsigned long long']]],
    'fe_flags': [0x28, ['unsigned int']],
    'fe_reserved': [0x2c, ['array', 3, ['unsigned int']]],
}],
  'qspinlock': [ size : 0x4, {
    'val': [0x0, ['__unnamed_0x1a5']],
}],
  'ipstats_mib': [ size : 0x120, {
    'mibs': [0x0, ['array', 36, ['unsigned long long']]],
    'syncp': [0x120, ['u64_stats_sync']],
}],
  'new_utsname': [ size : 0x186, {
    'sysname': [0x0, ['array', 65, ['char']]],
    'nodename': [0x41, ['array', 65, ['char']]],
    'release': [0x82, ['array', 65, ['char']]],
    'version': [0xc3, ['array', 65, ['char']]],
    'machine': [0x104, ['array', 65, ['char']]],
    'domainname': [0x145, ['array', 65, ['char']]],
}],
  'ieee_qcn': [ size : 0x168, {
    'rpg_enable': [0x0, ['array', 8, ['unsigned char']]],
    'rppp_max_rps': [0x8, ['array', 8, ['unsigned int']]],
    'rpg_time_reset': [0x28, ['array', 8, ['unsigned int']]],
    'rpg_byte_reset': [0x48, ['array', 8, ['unsigned int']]],
    'rpg_threshold': [0x68, ['array', 8, ['unsigned int']]],
    'rpg_max_rate': [0x88, ['array', 8, ['unsigned int']]],
    'rpg_ai_rate': [0xa8, ['array', 8, ['unsigned int']]],
    'rpg_hai_rate': [0xc8, ['array', 8, ['unsigned int']]],
    'rpg_gd': [0xe8, ['array', 8, ['unsigned int']]],
    'rpg_min_dec_fac': [0x108, ['array', 8, ['unsigned int']]],
    'rpg_min_rate': [0x128, ['array', 8, ['unsigned int']]],
    'cndd_state_machine': [0x148, ['array', 8, ['unsigned int']]],
}],
  'flowi_uli': [ size : 0x4, {
    'icmpt': [0x0, ['__unnamed_0xefe4']],
    'spi': [0x0, ['unsigned int']],
    'dnports': [0x0, ['__unnamed_0xf005']],
    'mht': [0x0, ['__unnamed_0xf026']],
    'gre_key': [0x0, ['unsigned int']],
    'ports': [0x0, ['__unnamed_0xefc3']],
}],
  'fn_zone': [ size : 0x70, {
    'fz_next': [0x0, ['pointer', ['fn_zone']]],
    'fz_hash': [0x8, ['pointer', ['hlist_head']]],
    'fz_lock': [0x10, ['__unnamed_0x2c51']],
    'fz_hashmask': [0x18, ['unsigned int']],
    'fz_order': [0x1c, ['unsigned char']],
    'fz_revorder': [0x1d, ['unsigned char']],
    'fz_mask': [0x20, ['unsigned int']],
    'fz_embedded_hash': [0x28, ['array', 8, ['hlist_head']]],
    'fz_nent': [0x68, ['int']],
    'fz_divisor': [0x6c, ['int']],
}],
  '__unnamed_0x51a': [ size : 0x20, {
    'clockid': [0x0, ['int']],
    'rmtp': [0x8, ['pointer', ['timespec']]],
    'compat_rmtp': [0x10, ['pointer', ['compat_timespec']]],
    'expires': [0x18, ['unsigned long long']],
}],
  '__unnamed_0xed30': [ size : 0x10, {
    'u6_addr32': [0x0, ['array', 4, ['unsigned int']]],
    'u6_addr16': [0x0, ['array', 8, ['unsigned short']]],
    'u6_addr8': [0x0, ['array', 16, ['unsigned char']]],
}],
  'mem_cgroup_thresholds': [ size : 0x10, {
    'primary': [0x0, ['pointer', ['mem_cgroup_threshold_ary']]],
    'spare': [0x8, ['pointer', ['mem_cgroup_threshold_ary']]],
}],
  'zone': [ size : 0x7c0, {
    'watermark': [0x0, ['array', 3, ['unsigned long']]],
    'nr_reserved_highatomic': [0x18, ['unsigned long']],
    'lowmem_reserve': [0x20, ['array', 5, ['long']]],
    'node': [0x48, ['int']],
    'inactive_ratio': [0x4c, ['unsigned int']],
    'zone_pgdat': [0x50, ['pointer', ['pglist_data']]],
    'pageset': [0x58, ['pointer', ['per_cpu_pageset']]],
    'dirty_balance_reserve': [0x60, ['unsigned long']],
    'min_unmapped_pages': [0x68, ['unsigned long']],
    'min_slab_pages': [0x70, ['unsigned long']],
    'zone_start_pfn': [0x78, ['unsigned long']],
    'managed_pages': [0x80, ['unsigned long']],
    'spanned_pages': [0x88, ['unsigned long']],
    'present_pages': [0x90, ['unsigned long']],
    'name': [0x98, ['pointer', ['char']]],
    'nr_isolate_pageblock': [0xa0, ['unsigned long']],
    'span_seqlock': [0xa8, ['__unnamed_0x1d38']],
    'wait_table': [0xb0, ['pointer', ['__wait_queue_head']]],
    'wait_table_hash_nr_entries': [0xb8, ['unsigned long']],
    'wait_table_bits': [0xc0, ['unsigned long']],
    '_pad1_': [0x100, ['zone_padding']],
    'free_area': [0x100, ['array', 11, ['free_area']]],
    'flags': [0x578, ['unsigned long']],
    'lock': [0x580, ['spinlock']],
    'lru_lock': [0x5c0, ['spinlock']],
    '_pad2_': [0x5c0, ['zone_padding']],
    'lruvec': [0x5c8, ['lruvec']],
    'inactive_age': [0x640, ['__unnamed_0x1c5']],
    'percpu_drift_mark': [0x648, ['unsigned long']],
    'compact_cached_free_pfn': [0x650, ['unsigned long']],
    'compact_cached_migrate_pfn': [0x658, ['array', 2, ['unsigned long']]],
    'compact_considered': [0x668, ['unsigned int']],
    'compact_defer_shift': [0x66c, ['unsigned int']],
    'compact_order_failed': [0x670, ['int']],
    'compact_blockskip_flush': [0x674, ['unsigned char']],
    '_pad3_': [0x680, ['zone_padding']],
    'vm_stat': [0x680, ['array', 40, ['__unnamed_0x1c5']]],
}],
  'mem_section': [ size : 0x10, {
    'section_mem_map': [0x0, ['unsigned long']],
    'pageblock_flags': [0x8, ['pointer', ['unsigned long']]],
}],
  'flow_dissector': [ size : 0x1c, {
    'used_keys': [0x0, ['unsigned int']],
    'offset': [0x4, ['array', 11, ['unsigned short']]],
}],
  'neigh_statistics': [ size : 0x60, {
    'allocs': [0x0, ['unsigned long']],
    'destroys': [0x8, ['unsigned long']],
    'hash_grows': [0x10, ['unsigned long']],
    'res_failed': [0x18, ['unsigned long']],
    'lookups': [0x20, ['unsigned long']],
    'hits': [0x28, ['unsigned long']],
    'rcv_probes_mcast': [0x30, ['unsigned long']],
    'rcv_probes_ucast': [0x38, ['unsigned long']],
    'periodic_gc_runs': [0x40, ['unsigned long']],
    'forced_gc_runs': [0x48, ['unsigned long']],
    'unres_discards': [0x50, ['unsigned long']],
    'table_fulls': [0x58, ['unsigned long']],
}],
  'device_attribute': [ size : 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x3db': [ size : 0x8, {
    'limit0': [0x0, ['unsigned short']],
    'base0': [0x2, ['unsigned short']],
    'avl': [0x4, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'g': [0x4, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'p': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'base2': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'l': [0x4, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'base1': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    's': [0x4, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'limit': [0x4, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
    'dpl': [0x4, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'type': [0x4, ['BitField', {'end_bit': 12, 'start_bit': 8}]],
    'd': [0x4, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
}],
  'cee_pfc': [ size : 0x4, {
    'willing': [0x0, ['unsigned char']],
    'error': [0x1, ['unsigned char']],
    'pfc_en': [0x2, ['unsigned char']],
    'tcs_supported': [0x3, ['unsigned char']],
}],
  '__unnamed_0x19822': [ size : 0x2, {
    'ohopopts': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'dstopts': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'hopopts': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'rxohlim': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'srcrt': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'rxhlim': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'rxinfo': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'rxorigdstaddr': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'rxflow': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'odstopts': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'rxtclass': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'rxpmtu': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'osrcrt': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'rxoinfo': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
}],
  'dma_attrs': [ size : 0x8, {
    'flags': [0x0, ['array', 1, ['unsigned long']]],
}],
  '__unnamed_0x813b': [ size : 0x10, {
    'parent': [0x0, ['pointer', ['radix_tree_node']]],
    'private_data': [0x8, ['pointer', ['void']]],
}],
  'netns_sysctl_lowpan': [ size : 0x8, {
    'frags_hdr': [0x0, ['pointer', ['ctl_table_header']]],
}],
  '__unnamed_0x39f7': [ size : 0x18, {
    '__unnamed_0x39ff': [0x0, ['__unnamed_0x39be']],
    'rcu': [0x0, ['callback_head']],
}],
  'tcf_proto': [ size : 0x50, {
    'next': [0x0, ['pointer', ['tcf_proto']]],
    'root': [0x8, ['pointer', ['void']]],
    'classify': [0x10, ['pointer', ['void']]],
    'protocol': [0x18, ['unsigned short']],
    'prio': [0x1c, ['unsigned int']],
    'classid': [0x20, ['unsigned int']],
    'q': [0x28, ['pointer', ['Qdisc']]],
    'data': [0x30, ['pointer', ['void']]],
    'ops': [0x38, ['pointer', ['tcf_proto_ops']]],
    'rcu': [0x40, ['callback_head']],
}],
  'fib_rules_ops': [ size : 0xb0, {
    'family': [0x0, ['int']],
    'list': [0x8, ['list_head']],
    'rule_size': [0x18, ['int']],
    'addr_size': [0x1c, ['int']],
    'unresolved_rules': [0x20, ['int']],
    'nr_goto_rules': [0x24, ['int']],
    'action': [0x28, ['pointer', ['void']]],
    'suppress': [0x30, ['pointer', ['void']]],
    'match': [0x38, ['pointer', ['void']]],
    'configure': [0x40, ['pointer', ['void']]],
    'delete': [0x48, ['pointer', ['void']]],
    'compare': [0x50, ['pointer', ['void']]],
    'fill': [0x58, ['pointer', ['void']]],
    'nlmsg_payload': [0x60, ['pointer', ['void']]],
    'flush_cache': [0x68, ['pointer', ['void']]],
    'nlgroup': [0x70, ['int']],
    'policy': [0x78, ['pointer', ['nla_policy']]],
    'rules_list': [0x80, ['list_head']],
    'owner': [0x90, ['pointer', ['module']]],
    'fro_net': [0x98, ['pointer', ['net']]],
    'rcu': [0xa0, ['callback_head']],
}],
  '__unnamed_0x1c5': [ size : 0x8, {
    'counter': [0x0, ['long']],
}],
  'inet6_cork': [ size : 0x10, {
    'opt': [0x0, ['pointer', ['ipv6_txoptions']]],
    'hop_limit': [0x8, ['unsigned char']],
    'tclass': [0x9, ['unsigned char']],
}],
  'ktime': [ size : 0x8, {
    'tv64': [0x0, ['long long']],
}],
  'icmp_mib': [ size : 0xe0, {
    'mibs': [0x0, ['array', 28, ['unsigned long']]],
}],
  '__unnamed_0x2c51': [ size : 0x8, {
    'seqcount': [0x0, ['seqcount']],
    'lock': [0x4, ['spinlock']],
}],
  'netns_xfrm': [ size : 0x440, {
    'state_all': [0x0, ['list_head']],
    'state_bydst': [0x10, ['pointer', ['hlist_head']]],
    'state_bysrc': [0x18, ['pointer', ['hlist_head']]],
    'state_byspi': [0x20, ['pointer', ['hlist_head']]],
    'state_hmask': [0x28, ['unsigned int']],
    'state_num': [0x2c, ['unsigned int']],
    'state_hash_work': [0x30, ['work_struct']],
    'state_gc_list': [0x50, ['hlist_head']],
    'state_gc_work': [0x58, ['work_struct']],
    'policy_all': [0x78, ['list_head']],
    'policy_byidx': [0x88, ['pointer', ['hlist_head']]],
    'policy_idx_hmask': [0x90, ['unsigned int']],
    'policy_inexact': [0x98, ['array', 3, ['hlist_head']]],
    'policy_bydst': [0xb0, ['array', 3, ['xfrm_policy_hash']]],
    'policy_count': [0xe0, ['array', 6, ['unsigned int']]],
    'policy_hash_work': [0xf8, ['work_struct']],
    'policy_hthresh': [0x118, ['xfrm_policy_hthresh']],
    'nlsk': [0x148, ['pointer', ['sock']]],
    'nlsk_stash': [0x150, ['pointer', ['sock']]],
    'sysctl_aevent_etime': [0x158, ['unsigned int']],
    'sysctl_aevent_rseqth': [0x15c, ['unsigned int']],
    'sysctl_larval_drop': [0x160, ['int']],
    'sysctl_acq_expires': [0x164, ['unsigned int']],
    'sysctl_hdr': [0x168, ['pointer', ['ctl_table_header']]],
    'xfrm4_dst_ops': [0x180, ['dst_ops']],
    'xfrm6_dst_ops': [0x240, ['dst_ops']],
    'xfrm_state_lock': [0x300, ['spinlock']],
    'xfrm_policy_lock': [0x304, ['__unnamed_0x2b74']],
    'xfrm_cfg_mutex': [0x310, ['mutex']],
    'flow_cache_global': [0x338, ['flow_cache']],
    'flow_cache_genid': [0x3b8, ['__unnamed_0x351']],
    'flow_cache_gc_list': [0x3c0, ['list_head']],
    'flow_cache_gc_lock': [0x3d0, ['spinlock']],
    'flow_cache_gc_work': [0x3d8, ['work_struct']],
    'flow_cache_flush_work': [0x3f8, ['work_struct']],
    'flow_flush_sem': [0x418, ['mutex']],
}],
  '__unnamed_0x1610': [ size : 0x30, {
    'padding1': [0x0, ['array', 12, ['unsigned int']]],
    'sw_reserved': [0x0, ['array', 12, ['unsigned int']]],
}],
  '__unnamed_0x1861b': [ size : 0x10, {
    'skc_bind_node': [0x0, ['hlist_node']],
    'skc_portaddr_node': [0x0, ['hlist_nulls_node']],
}],
  '__unnamed_0x2e17': [ size : 0x8, {
    'bits': [0x0, ['array', 1, ['unsigned long']]],
}],
  'ct_pcpu': [ size : 0x18, {
    'lock': [0x0, ['spinlock']],
    'unconfirmed': [0x8, ['hlist_nulls_head']],
    'dying': [0x10, ['hlist_nulls_head']],
}],
  'phy_c45_device_ids': [ size : 0x24, {
    'devices_in_package': [0x0, ['unsigned int']],
    'device_ids': [0x4, ['array', 8, ['unsigned int']]],
}],
  'bio_integrity_payload': [ size : 0x58, {
    'bip_bio': [0x0, ['pointer', ['bio']]],
    'bip_iter': [0x8, ['bvec_iter']],
    'bip_end_io': [0x20, ['pointer', ['void']]],
    'bip_slab': [0x28, ['unsigned short']],
    'bip_vcnt': [0x2a, ['unsigned short']],
    'bip_max_vcnt': [0x2c, ['unsigned short']],
    'bip_flags': [0x2e, ['unsigned short']],
    'bip_work': [0x30, ['work_struct']],
    'bip_vec': [0x50, ['pointer', ['bio_vec']]],
    'bip_inline_vecs': [0x58, ['array', 0, ['bio_vec']]],
}],
  'cgroup': [ size : 0x290, {
    'self': [0x0, ['cgroup_subsys_state']],
    'flags': [0xb8, ['unsigned long']],
    'id': [0xc0, ['int']],
    'populated_cnt': [0xc4, ['int']],
    'kn': [0xc8, ['pointer', ['kernfs_node']]],
    'procs_file': [0xd0, ['cgroup_file']],
    'events_file': [0xd8, ['cgroup_file']],
    'subtree_control': [0xe0, ['unsigned int']],
    'child_subsys_mask': [0xe4, ['unsigned int']],
    'subsys': [0xe8, ['array', 12, ['pointer', ['cgroup_subsys_state']]]],
    'root': [0x148, ['pointer', ['cgroup_root']]],
    'cset_links': [0x150, ['list_head']],
    'e_csets': [0x160, ['array', 12, ['list_head']]],
    'pidlists': [0x220, ['list_head']],
    'pidlist_mutex': [0x230, ['mutex']],
    'offline_waitq': [0x258, ['__wait_queue_head']],
    'release_agent_work': [0x270, ['work_struct']],
}],
  'inet_peer': [ size : 0xa0, {
    'avl_left': [0x0, ['pointer', ['inet_peer']]],
    'avl_right': [0x8, ['pointer', ['inet_peer']]],
    'daddr': [0x10, ['inetpeer_addr']],
    'avl_height': [0x24, ['unsigned int']],
    'metrics': [0x28, ['array', 16, ['unsigned int']]],
    'rate_tokens': [0x68, ['unsigned int']],
    'rate_last': [0x70, ['unsigned long']],
    '__unnamed_0x19e80': [0x78, ['__unnamed_0x19dc8']],
    '__unnamed_0x19e86': [0x88, ['__unnamed_0x19dfc']],
    'dtime': [0x98, ['unsigned int']],
    'refcnt': [0x9c, ['__unnamed_0x351']],
}],
  'desc_ptr': [ size : 0xa, {
    'size': [0x0, ['unsigned short']],
    'address': [0x2, ['unsigned long']],
}],
  'sysfs_ops': [ size : 0x10, {
    'show': [0x0, ['pointer', ['void']]],
    'store': [0x8, ['pointer', ['void']]],
}],
  'ethtool_wolinfo': [ size : 0x14, {
    'cmd': [0x0, ['unsigned int']],
    'supported': [0x4, ['unsigned int']],
    'wolopts': [0x8, ['unsigned int']],
    'sopass': [0xc, ['array', 6, ['unsigned char']]],
}],
  '__wait_queue': [ size : 0x28, {
    'flags': [0x0, ['unsigned int']],
    'private': [0x8, ['pointer', ['void']]],
    'func': [0x10, ['pointer', ['void']]],
    'task_list': [0x18, ['list_head']],
}],
  'per_cpu_pageset': [ size : 0x70, {
    'pcp': [0x0, ['per_cpu_pages']],
    'expire': [0x40, ['signed char']],
    'stat_threshold': [0x41, ['signed char']],
    'vm_stat_diff': [0x42, ['array', 40, ['signed char']]],
}],
  'task_cputime': [ size : 0x18, {
    'utime': [0x0, ['unsigned long']],
    'stime': [0x8, ['unsigned long']],
    'sum_exec_runtime': [0x10, ['unsigned long long']],
}],
  'ktermios': [ size : 0x2c, {
    'c_iflag': [0x0, ['unsigned int']],
    'c_oflag': [0x4, ['unsigned int']],
    'c_cflag': [0x8, ['unsigned int']],
    'c_lflag': [0xc, ['unsigned int']],
    'c_line': [0x10, ['unsigned char']],
    'c_cc': [0x11, ['array', 19, ['unsigned char']]],
    'c_ispeed': [0x24, ['unsigned int']],
    'c_ospeed': [0x28, ['unsigned int']],
}],
  '__unnamed_0x18b17': [ size : 0x8, {
    'sk_wq': [0x0, ['pointer', ['socket_wq']]],
    'sk_wq_raw': [0x0, ['pointer', ['socket_wq']]],
}],
  'timespec': [ size : 0x10, {
    'tv_sec': [0x0, ['long']],
    'tv_nsec': [0x8, ['long']],
}],
  'ieee_ets': [ size : 0x3b, {
    'willing': [0x0, ['unsigned char']],
    'ets_cap': [0x1, ['unsigned char']],
    'cbs': [0x2, ['unsigned char']],
    'tc_tx_bw': [0x3, ['array', 8, ['unsigned char']]],
    'tc_rx_bw': [0xb, ['array', 8, ['unsigned char']]],
    'tc_tsa': [0x13, ['array', 8, ['unsigned char']]],
    'prio_tc': [0x1b, ['array', 8, ['unsigned char']]],
    'tc_reco_bw': [0x23, ['array', 8, ['unsigned char']]],
    'tc_reco_tsa': [0x2b, ['array', 8, ['unsigned char']]],
    'reco_prio_tc': [0x33, ['array', 8, ['unsigned char']]],
}],
  'kobj_type': [ size : 0x28, {
    'release': [0x0, ['pointer', ['void']]],
    'sysfs_ops': [0x8, ['pointer', ['sysfs_ops']]],
    'default_attrs': [0x10, ['pointer', ['pointer', ['attribute']]]],
    'child_ns_type': [0x18, ['pointer', ['void']]],
    'namespace': [0x20, ['pointer', ['void']]],
}],
  'x86_hw_tss': [ size : 0x80, {
    'reserved1': [0x0, ['unsigned int']],
    'sp0': [0x4, ['unsigned long long']],
    'sp1': [0xc, ['unsigned long long']],
    'sp2': [0x14, ['unsigned long long']],
    'reserved2': [0x1c, ['unsigned long long']],
    'ist': [0x24, ['array', 7, ['unsigned long long']]],
    'reserved3': [0x5c, ['unsigned int']],
    'reserved4': [0x60, ['unsigned int']],
    'reserved5': [0x64, ['unsigned short']],
    'io_bitmap_base': [0x66, ['unsigned short']],
}],
  'hlist_head': [ size : 0x8, {
    'first': [0x0, ['pointer', ['hlist_node']]],
}],
  'cgroup_root': [ size : 0x1328, {
    'kf_root': [0x0, ['pointer', ['kernfs_root']]],
    'subsys_mask': [0x8, ['unsigned int']],
    'hierarchy_id': [0xc, ['int']],
    'cgrp': [0x10, ['cgroup']],
    'nr_cgrps': [0x2a0, ['__unnamed_0x351']],
    'root_list': [0x2a8, ['list_head']],
    'flags': [0x2b8, ['unsigned int']],
    'cgroup_idr': [0x2c0, ['idr']],
    'release_agent_path': [0x2e8, ['array', 4096, ['char']]],
    'name': [0x12e8, ['array', 64, ['char']]],
}],
  'xps_dev_maps': [ size : 0x10, {
    'rcu': [0x0, ['callback_head']],
    'cpu_map': [0x10, ['array', 0, ['pointer', ['xps_map']]]],
}],
  'wb_domain': [ size : 0xa0, {
    'lock': [0x0, ['spinlock']],
    'completions': [0x8, ['fprop_global']],
    'period_timer': [0x38, ['timer_list']],
    'period_time': [0x88, ['unsigned long']],
    'dirty_limit_tstamp': [0x90, ['unsigned long']],
    'dirty_limit': [0x98, ['unsigned long']],
}],
  '__unnamed_0xfe0f': [ size : 0x18, {
    '__unnamed_0xfe18': [0x0, ['__unnamed_0xfde5']],
    'rbnode': [0x0, ['rb_node']],
}],
  'netns_nftables': [ size : 0x58, {
    'af_info': [0x0, ['list_head']],
    'commit_list': [0x10, ['list_head']],
    'ipv4': [0x20, ['pointer', ['nft_af_info']]],
    'ipv6': [0x28, ['pointer', ['nft_af_info']]],
    'inet': [0x30, ['pointer', ['nft_af_info']]],
    'arp': [0x38, ['pointer', ['nft_af_info']]],
    'bridge': [0x40, ['pointer', ['nft_af_info']]],
    'netdev': [0x48, ['pointer', ['nft_af_info']]],
    'base_seq': [0x50, ['unsigned int']],
    'gencursor': [0x54, ['unsigned char']],
}],
  'timewait_sock_ops': [ size : 0x28, {
    'twsk_slab': [0x0, ['pointer', ['kmem_cache']]],
    'twsk_slab_name': [0x8, ['pointer', ['char']]],
    'twsk_obj_size': [0x10, ['unsigned int']],
    'twsk_unique': [0x18, ['pointer', ['void']]],
    'twsk_destructor': [0x20, ['pointer', ['void']]],
}],
  'zoneref': [ size : 0x10, {
    'zone': [0x0, ['pointer', ['zone']]],
    'zone_idx': [0x8, ['int']],
}],
  'poll_table_struct': [ size : 0x10, {
    '_qproc': [0x0, ['pointer', ['void']]],
    '_key': [0x8, ['unsigned long']],
}],
  'ida_bitmap': [ size : 0x80, {
    'nr_busy': [0x0, ['long']],
    'bitmap': [0x8, ['array', 15, ['unsigned long']]],
}],
  'arch_uprobe_task': [ size : 0x10, {
    'saved_scratch_register': [0x0, ['unsigned long']],
    'saved_trap_nr': [0x8, ['unsigned int']],
    'saved_tf': [0xc, ['unsigned int']],
}],
  'kernel_symbol': [ size : 0x10, {
    'value': [0x0, ['unsigned long']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'attribute_group': [ size : 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'is_visible': [0x8, ['pointer', ['void']]],
    'is_bin_visible': [0x10, ['pointer', ['void']]],
    'attrs': [0x18, ['pointer', ['pointer', ['attribute']]]],
    'bin_attrs': [0x20, ['pointer', ['pointer', ['bin_attribute']]]],
}],
  'ethtool_usrip4_spec': [ size : 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'l4_4_bytes': [0x8, ['unsigned int']],
    'tos': [0xc, ['unsigned char']],
    'ip_ver': [0xd, ['unsigned char']],
    'proto': [0xe, ['unsigned char']],
}],
  'request_sock': [ size : 0x108, {
    '__req_common': [0x0, ['sock_common']],
    'dl_next': [0x88, ['pointer', ['request_sock']]],
    'mss': [0x90, ['unsigned short']],
    'num_retrans': [0x92, ['unsigned char']],
    'num_timeout': [0x93, ['BitField', {'end_bit': 8, 'start_bit': 1}]],
    'cookie_ts': [0x93, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ts_recent': [0x94, ['unsigned int']],
    'rsk_timer': [0x98, ['timer_list']],
    'rsk_ops': [0xe8, ['pointer', ['request_sock_ops']]],
    'sk': [0xf0, ['pointer', ['sock']]],
    'saved_syn': [0xf8, ['pointer', ['unsigned int']]],
    'secid': [0x100, ['unsigned int']],
    'peer_secid': [0x104, ['unsigned int']],
}],
  'rtnl_link_ops': [ size : 0xc0, {
    'list': [0x0, ['list_head']],
    'kind': [0x10, ['pointer', ['char']]],
    'priv_size': [0x18, ['unsigned long']],
    'setup': [0x20, ['pointer', ['void']]],
    'maxtype': [0x28, ['int']],
    'policy': [0x30, ['pointer', ['nla_policy']]],
    'validate': [0x38, ['pointer', ['void']]],
    'newlink': [0x40, ['pointer', ['void']]],
    'changelink': [0x48, ['pointer', ['void']]],
    'dellink': [0x50, ['pointer', ['void']]],
    'get_size': [0x58, ['pointer', ['void']]],
    'fill_info': [0x60, ['pointer', ['void']]],
    'get_xstats_size': [0x68, ['pointer', ['void']]],
    'fill_xstats': [0x70, ['pointer', ['void']]],
    'get_num_tx_queues': [0x78, ['pointer', ['void']]],
    'get_num_rx_queues': [0x80, ['pointer', ['void']]],
    'slave_maxtype': [0x88, ['int']],
    'slave_policy': [0x90, ['pointer', ['nla_policy']]],
    'slave_validate': [0x98, ['pointer', ['void']]],
    'slave_changelink': [0xa0, ['pointer', ['void']]],
    'get_slave_size': [0xa8, ['pointer', ['void']]],
    'fill_slave_info': [0xb0, ['pointer', ['void']]],
    'get_link_net': [0xb8, ['pointer', ['void']]],
}],
  'gate_struct64': [ size : 0x10, {
    'offset_low': [0x0, ['unsigned short']],
    'segment': [0x2, ['unsigned short']],
    'ist': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'p': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'zero0': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 3}]],
    'dpl': [0x4, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'type': [0x4, ['BitField', {'end_bit': 13, 'start_bit': 8}]],
    'offset_middle': [0x6, ['unsigned short']],
    'offset_high': [0x8, ['unsigned int']],
    'zero1': [0xc, ['unsigned int']],
}],
  '__unnamed_0x5847': [ size : 0x10, {
    'compound_head': [0x0, ['unsigned long']],
    'compound_dtor': [0x8, ['unsigned int']],
    'compound_order': [0xc, ['unsigned int']],
}],
  'group_info': [ size : 0x90, {
    'usage': [0x0, ['__unnamed_0x351']],
    'ngroups': [0x4, ['int']],
    'nblocks': [0x8, ['int']],
    'small_block': [0xc, ['array', 32, ['__unnamed_0x2ca1']]],
    'blocks': [0x90, ['array', 0, ['pointer', ['__unnamed_0x2ca1']]]],
}],
  'sigpending': [ size : 0x18, {
    'list': [0x0, ['list_head']],
    'signal': [0x10, ['__unnamed_0xb250']],
}],
  'vm_area_struct': [ size : 0xc8, {
    'vm_start': [0x0, ['unsigned long']],
    'vm_end': [0x8, ['unsigned long']],
    'vm_next': [0x10, ['pointer', ['vm_area_struct']]],
    'vm_prev': [0x18, ['pointer', ['vm_area_struct']]],
    'vm_rb': [0x20, ['rb_node']],
    'rb_subtree_gap': [0x38, ['unsigned long']],
    'vm_mm': [0x40, ['pointer', ['mm_struct']]],
    'vm_page_prot': [0x48, ['pgprot']],
    'vm_flags': [0x50, ['unsigned long']],
    'shared': [0x58, ['__unnamed_0x334e']],
    'anon_vma_chain': [0x78, ['list_head']],
    'anon_vma': [0x88, ['pointer', ['anon_vma']]],
    'vm_ops': [0x90, ['pointer', ['vm_operations_struct']]],
    'vm_pgoff': [0x98, ['unsigned long']],
    'vm_file': [0xa0, ['pointer', ['file']]],
    'vm_prfile': [0xa8, ['pointer', ['file']]],
    'vm_private_data': [0xb0, ['pointer', ['void']]],
    'vm_policy': [0xb8, ['pointer', ['mempolicy']]],
    'vm_userfaultfd_ctx': [0xc0, ['vm_userfaultfd_ctx']],
}],
  'fprop_local_percpu': [ size : 0x30, {
    'events': [0x0, ['percpu_counter']],
    'period': [0x28, ['unsigned int']],
    'lock': [0x2c, ['raw_spinlock']],
}],
  'paravirt_callee_save': [ size : 0x8, {
    'func': [0x0, ['pointer', ['void']]],
}],
  'netns_unix': [ size : 0x10, {
    'sysctl_max_dgram_qlen': [0x0, ['int']],
    'ctl': [0x8, ['pointer', ['ctl_table_header']]],
}],
  '__unnamed_0xb9d7': [ size : 0x10, {
    'type': [0x0, ['pointer', ['key_type']]],
    'description': [0x8, ['pointer', ['char']]],
}],
  'sk_buff': [ size : 0xe8, {
    '__unnamed_0xf998': [0x0, ['__unnamed_0xfe0f']],
    'sk': [0x18, ['pointer', ['sock']]],
    'dev': [0x20, ['pointer', ['net_device']]],
    'cb': [0x28, ['array', 48, ['char']]],
    '_skb_refdst': [0x58, ['unsigned long']],
    'destructor': [0x60, ['pointer', ['void']]],
    'sp': [0x68, ['pointer', ['sec_path']]],
    'nfct': [0x70, ['pointer', ['nf_conntrack']]],
    'nf_bridge': [0x78, ['pointer', ['nf_bridge_info']]],
    'len': [0x80, ['unsigned int']],
    'data_len': [0x84, ['unsigned int']],
    'mac_len': [0x88, ['unsigned short']],
    'hdr_len': [0x8a, ['unsigned short']],
    'queue_mapping': [0x8c, ['unsigned short']],
    'fclone': [0x8e, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'xmit_more': [0x8e, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'cloned': [0x8e, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'peeked': [0x8e, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'nohdr': [0x8e, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'head_frag': [0x8e, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ignore_df': [0x90, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'pkt_type': [0x90, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    '__pkt_type_offset': [0x90, ['array', 0, ['unsigned char']]],
    'headers_start': [0x90, ['array', 0, ['unsigned int']]],
    'pfmemalloc': [0x90, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'nfctinfo': [0x90, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'nf_trace': [0x91, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'l4_hash': [0x91, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'sw_hash': [0x91, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ooo_okay': [0x91, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'wifi_acked_valid': [0x91, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'wifi_acked': [0x91, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ip_summed': [0x91, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'csum_bad': [0x92, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'encapsulation': [0x92, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'csum_level': [0x92, ['BitField', {'end_bit': 7, 'start_bit': 5}]],
    'csum_valid': [0x92, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'csum_complete_sw': [0x92, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'encap_hdr_csum': [0x92, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'no_fcs': [0x92, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'inner_protocol_type': [0x93, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'dst_pending_confirm': [0x93, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ndisc_nodetype': [0x93, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'ipvs_property': [0x93, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'remcsum_offload': [0x93, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'tc_index': [0x94, ['unsigned short']],
    'tc_verd': [0x96, ['unsigned short']],
    '__unnamed_0xfc48': [0x98, ['__unnamed_0xfe4e']],
    'priority': [0x9c, ['unsigned int']],
    'skb_iif': [0xa0, ['int']],
    'hash': [0xa4, ['unsigned int']],
    'vlan_proto': [0xa8, ['unsigned short']],
    'vlan_tci': [0xaa, ['unsigned short']],
    '__unnamed_0xfc8f': [0xac, ['__unnamed_0xfe69']],
    '__unnamed_0xfc95': [0xb0, ['__unnamed_0xfe8b']],
    '__unnamed_0xfc9b': [0xb4, ['__unnamed_0xfea1']],
    '__unnamed_0xfca1': [0xb8, ['__unnamed_0xfec3']],
    'inner_transport_header': [0xba, ['unsigned short']],
    'inner_network_header': [0xbc, ['unsigned short']],
    'inner_mac_header': [0xbe, ['unsigned short']],
    'protocol': [0xc0, ['unsigned short']],
    'transport_header': [0xc2, ['unsigned short']],
    'network_header': [0xc4, ['unsigned short']],
    'mac_header': [0xc6, ['unsigned short']],
    'tail': [0xc8, ['unsigned int']],
    'headers_end': [0xc8, ['array', 0, ['unsigned int']]],
    'end': [0xcc, ['unsigned int']],
    'head': [0xd0, ['pointer', ['unsigned char']]],
    'data': [0xd8, ['pointer', ['unsigned char']]],
    'truesize': [0xe0, ['unsigned int']],
    'users': [0xe4, ['__unnamed_0x351']],
}],
  'list_lru': [ size : 0x18, {
    'node': [0x0, ['pointer', ['list_lru_node']]],
    'list': [0x8, ['list_head']],
}],
  'path': [ size : 0x10, {
    'mnt': [0x0, ['pointer', ['vfsmount']]],
    'dentry': [0x8, ['pointer', ['dentry']]],
}],
  'if_settings': [ size : 0x10, {
    'type': [0x0, ['unsigned int']],
    'size': [0x4, ['unsigned int']],
    'ifs_ifsu': [0x8, ['__unnamed_0x103ad']],
}],
  '__unnamed_0x81b3': [ size : 0x10, {
    '__unnamed_0x81bb': [0x0, ['__unnamed_0x813b']],
    'callback_head': [0x0, ['callback_head']],
}],
  'ethtool_test': [ size : 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'reserved': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['unsigned long long']]],
}],
  'pv_lazy_ops': [ size : 0x18, {
    'enter': [0x0, ['pointer', ['void']]],
    'leave': [0x8, ['pointer', ['void']]],
    'flush': [0x10, ['pointer', ['void']]],
}],
  '__unnamed_0x15a3': [ size : 0x10, {
    'rip': [0x0, ['unsigned long long']],
    'rdp': [0x8, ['unsigned long long']],
}],
  'kernel_param_ops': [ size : 0x20, {
    'flags': [0x0, ['unsigned int']],
    'set': [0x8, ['pointer', ['void']]],
    'get': [0x10, ['pointer', ['void']]],
    'free': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0xb459': [ size : 0x70, {
    '_sigsys': [0x0, ['__unnamed_0xb42c']],
    '_timer': [0x0, ['__unnamed_0xb2f7']],
    '_sigpoll': [0x0, ['__unnamed_0xb40b']],
    '_kill': [0x0, ['__unnamed_0xb2d6']],
    '_pad': [0x0, ['array', 28, ['int']]],
    '_sigchld': [0x0, ['__unnamed_0xb378']],
    '_rt': [0x0, ['__unnamed_0xb34b']],
    '_sigfault': [0x0, ['__unnamed_0xb3de']],
}],
  '__unnamed_0x576c': [ size : 0x4, {
    'frozen': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'objects': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 16}]],
    'inuse': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
}],
  'fown_struct': [ size : 0x20, {
    'lock': [0x0, ['__unnamed_0x2b74']],
    'pid': [0x8, ['pointer', ['pid']]],
    'pid_type': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'PIDTYPE_PID', 1: 'PIDTYPE_PGID', 2: 'PIDTYPE_SID', 3: 'PIDTYPE_MAX', 4: '__PIDTYPE_TGID'}}]],
    'uid': [0x14, ['__unnamed_0x2c81']],
    'euid': [0x18, ['__unnamed_0x2c81']],
    'signum': [0x1c, ['int']],
}],
  'quota_info': [ size : 0x160, {
    'flags': [0x0, ['unsigned int']],
    'dqio_mutex': [0x8, ['mutex']],
    'dqonoff_mutex': [0x30, ['mutex']],
    'files': [0x58, ['array', 3, ['pointer', ['inode']]]],
    'info': [0x70, ['array', 3, ['mem_dqinfo']]],
    'ops': [0x148, ['array', 3, ['pointer', ['quota_format_ops']]]],
}],
  'cdev': [ size : 0x68, {
    'kobj': [0x0, ['kobject']],
    'owner': [0x40, ['pointer', ['module']]],
    'ops': [0x48, ['pointer', ['file_operations']]],
    'list': [0x50, ['list_head']],
    'dev': [0x60, ['unsigned int']],
    'count': [0x64, ['unsigned int']],
}],
  'ctl_table_set': [ size : 0x58, {
    'is_seen': [0x0, ['pointer', ['void']]],
    'dir': [0x8, ['ctl_dir']],
}],
  'bin_attribute': [ size : 0x38, {
    'attr': [0x0, ['attribute']],
    'size': [0x10, ['unsigned long']],
    'private': [0x18, ['pointer', ['void']]],
    'read': [0x20, ['pointer', ['void']]],
    'write': [0x28, ['pointer', ['void']]],
    'mmap': [0x30, ['pointer', ['void']]],
}],
  'mem_cgroup_stat_cpu': [ size : 0x98, {
    'count': [0x0, ['array', 7, ['long']]],
    'events': [0x38, ['array', 8, ['unsigned long']]],
    'nr_page_events': [0x78, ['unsigned long']],
    'targets': [0x80, ['array', 3, ['unsigned long']]],
}],
  'user_struct': [ size : 0x70, {
    '__count': [0x0, ['__unnamed_0x351']],
    'processes': [0x4, ['__unnamed_0x351']],
    'sigpending': [0x8, ['__unnamed_0x351']],
    'inotify_watches': [0xc, ['__unnamed_0x351']],
    'inotify_devs': [0x10, ['__unnamed_0x351']],
    'fanotify_listeners': [0x14, ['__unnamed_0x351']],
    'epoll_watches': [0x18, ['__unnamed_0x371']],
    'mq_bytes': [0x20, ['unsigned long']],
    'locked_shm': [0x28, ['unsigned long']],
    'unix_inflight': [0x30, ['unsigned long']],
    'pipe_bufs': [0x38, ['__unnamed_0x371']],
    'uid_keyring': [0x40, ['pointer', ['key']]],
    'session_keyring': [0x48, ['pointer', ['key']]],
    'uidhash_node': [0x50, ['hlist_node']],
    'uid': [0x60, ['__unnamed_0x2c81']],
    'locked_vm': [0x68, ['__unnamed_0x371']],
}],
  'list_lru_one': [ size : 0x18, {
    'list': [0x0, ['list_head']],
    'nr_items': [0x10, ['long']],
}],
  'sighand_struct': [ size : 0x828, {
    'count': [0x0, ['__unnamed_0x351']],
    'action': [0x8, ['array', 64, ['k_sigaction']]],
    'siglock': [0x808, ['spinlock']],
    'signalfd_wqh': [0x810, ['__wait_queue_head']],
}],
  'hh_cache': [ size : 0x90, {
    'hh_len': [0x0, ['unsigned short']],
    '__pad': [0x2, ['unsigned short']],
    'hh_lock': [0x4, ['__unnamed_0x2c51']],
    'hh_data': [0x10, ['array', 16, ['unsigned long']]],
}],
  'inet_sock': [ size : 0x370, {
    'sk': [0x0, ['sock']],
    'pinet6': [0x2c0, ['pointer', ['ipv6_pinfo']]],
    'inet_saddr': [0x2c8, ['unsigned int']],
    'uc_ttl': [0x2cc, ['short']],
    'cmsg_flags': [0x2ce, ['unsigned short']],
    'inet_sport': [0x2d0, ['unsigned short']],
    'inet_id': [0x2d2, ['unsigned short']],
    'inet_opt': [0x2d8, ['pointer', ['ip_options_rcu']]],
    'rx_dst_ifindex': [0x2e0, ['int']],
    'tos': [0x2e4, ['unsigned char']],
    'min_ttl': [0x2e5, ['unsigned char']],
    'mc_ttl': [0x2e6, ['unsigned char']],
    'pmtudisc': [0x2e7, ['unsigned char']],
    'freebind': [0x2e8, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'mc_loop': [0x2e8, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'is_icsk': [0x2e8, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'hdrincl': [0x2e8, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'transparent': [0x2e8, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'nodefrag': [0x2e8, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'mc_all': [0x2e8, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'recverr': [0x2e8, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'bind_address_no_port': [0x2e9, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'rcv_tos': [0x2ea, ['unsigned char']],
    'convert_csum': [0x2eb, ['unsigned char']],
    'uc_index': [0x2ec, ['int']],
    'mc_index': [0x2f0, ['int']],
    'mc_addr': [0x2f4, ['unsigned int']],
    'mc_list': [0x2f8, ['pointer', ['ip_mc_socklist']]],
    'cork': [0x300, ['inet_cork_full']],
}],
  'netns_ieee802154_lowpan': [ size : 0x80, {
    'sysctl': [0x0, ['netns_sysctl_lowpan']],
    'frags': [0x40, ['netns_frags']],
}],
  'request_sock_ops': [ size : 0x40, {
    'family': [0x0, ['int']],
    'obj_size': [0x4, ['int']],
    'slab': [0x8, ['pointer', ['kmem_cache']]],
    'slab_name': [0x10, ['pointer', ['char']]],
    'rtx_syn_ack': [0x18, ['pointer', ['void']]],
    'send_ack': [0x20, ['pointer', ['void']]],
    'send_reset': [0x28, ['pointer', ['void']]],
    'destructor': [0x30, ['pointer', ['void']]],
    'syn_ack_timeout': [0x38, ['pointer', ['void']]],
}],
  'inet_cork': [ size : 0x28, {
    'flags': [0x0, ['unsigned int']],
    'addr': [0x4, ['unsigned int']],
    'opt': [0x8, ['pointer', ['ip_options']]],
    'fragsize': [0x10, ['unsigned int']],
    'length': [0x14, ['int']],
    'dst': [0x18, ['pointer', ['dst_entry']]],
    'tx_flags': [0x20, ['unsigned char']],
    'ttl': [0x21, ['unsigned char']],
    'tos': [0x22, ['short']],
    'priority': [0x24, ['char']],
}],
  'ieee_qcn_stats': [ size : 0x60, {
    'rppp_rp_centiseconds': [0x0, ['array', 8, ['unsigned long long']]],
    'rppp_created_rps': [0x40, ['array', 8, ['unsigned int']]],
}],
  'kstat': [ size : 0x68, {
    'ino': [0x0, ['unsigned long long']],
    'dev': [0x8, ['unsigned int']],
    'mode': [0xc, ['unsigned short']],
    'nlink': [0x10, ['unsigned int']],
    'uid': [0x14, ['__unnamed_0x2c81']],
    'gid': [0x18, ['__unnamed_0x2ca1']],
    'rdev': [0x1c, ['unsigned int']],
    'size': [0x20, ['long long']],
    'atime': [0x28, ['timespec']],
    'mtime': [0x38, ['timespec']],
    'ctime': [0x48, ['timespec']],
    'blksize': [0x58, ['unsigned long']],
    'blocks': [0x60, ['unsigned long long']],
}],
  'kset_uevent_ops': [ size : 0x18, {
    'filter': [0x0, ['pointer', ['void']]],
    'name': [0x8, ['pointer', ['void']]],
    'uevent': [0x10, ['pointer', ['void']]],
}],
  'kernfs_node': [ size : 0x78, {
    'count': [0x0, ['__unnamed_0x1a5']],
    'active': [0x4, ['__unnamed_0x1a5']],
    'parent': [0x8, ['pointer', ['kernfs_node']]],
    'name': [0x10, ['pointer', ['char']]],
    'rb': [0x18, ['rb_node']],
    'ns': [0x30, ['pointer', ['void']]],
    'hash': [0x38, ['unsigned int']],
    '__unnamed_0x388b': [0x40, ['__unnamed_0x39a0']],
    'priv': [0x60, ['pointer', ['void']]],
    'flags': [0x68, ['unsigned short']],
    'mode': [0x6a, ['unsigned short']],
    'ino': [0x6c, ['unsigned int']],
    'iattr': [0x70, ['pointer', ['kernfs_iattrs']]],
}],
  'fwnode_handle': [ size : 0x10, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'FWNODE_INVALID', 1: 'FWNODE_OF', 2: 'FWNODE_ACPI', 3: 'FWNODE_ACPI_DATA', 4: 'FWNODE_PDATA', 5: 'FWNODE_IRQCHIP'}}]],
    'secondary': [0x8, ['pointer', ['fwnode_handle']]],
}],
  'zone_padding': [ size : 0x0, {
    'x': [0x0, ['array', 0, ['char']]],
}],
  'sched_statistics': [ size : 0xd8, {
    'wait_start': [0x0, ['unsigned long long']],
    'wait_max': [0x8, ['unsigned long long']],
    'wait_count': [0x10, ['unsigned long long']],
    'wait_sum': [0x18, ['unsigned long long']],
    'iowait_count': [0x20, ['unsigned long long']],
    'iowait_sum': [0x28, ['unsigned long long']],
    'sleep_start': [0x30, ['unsigned long long']],
    'sleep_max': [0x38, ['unsigned long long']],
    'sum_sleep_runtime': [0x40, ['long long']],
    'block_start': [0x48, ['unsigned long long']],
    'block_max': [0x50, ['unsigned long long']],
    'exec_max': [0x58, ['unsigned long long']],
    'slice_max': [0x60, ['unsigned long long']],
    'nr_migrations_cold': [0x68, ['unsigned long long']],
    'nr_failed_migrations_affine': [0x70, ['unsigned long long']],
    'nr_failed_migrations_running': [0x78, ['unsigned long long']],
    'nr_failed_migrations_hot': [0x80, ['unsigned long long']],
    'nr_forced_migrations': [0x88, ['unsigned long long']],
    'nr_wakeups': [0x90, ['unsigned long long']],
    'nr_wakeups_sync': [0x98, ['unsigned long long']],
    'nr_wakeups_migrate': [0xa0, ['unsigned long long']],
    'nr_wakeups_local': [0xa8, ['unsigned long long']],
    'nr_wakeups_remote': [0xb0, ['unsigned long long']],
    'nr_wakeups_affine': [0xb8, ['unsigned long long']],
    'nr_wakeups_affine_attempts': [0xc0, ['unsigned long long']],
    'nr_wakeups_passive': [0xc8, ['unsigned long long']],
    'nr_wakeups_idle': [0xd0, ['unsigned long long']],
}],
  '__unnamed_0xfe69': [ size : 0x4, {
    'napi_id': [0x0, ['unsigned int']],
    'sender_cpu': [0x0, ['unsigned int']],
}],
  'kobj_uevent_env': [ size : 0x920, {
    'argv': [0x0, ['array', 3, ['pointer', ['char']]]],
    'envp': [0x18, ['array', 32, ['pointer', ['char']]]],
    'envp_idx': [0x118, ['int']],
    'buf': [0x11c, ['array', 2048, ['char']]],
    'buflen': [0x91c, ['int']],
}],
  '__unnamed_0x4c3': [ size : 0x28, {
    'uaddr': [0x0, ['pointer', ['unsigned int']]],
    'val': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
    'bitset': [0x10, ['unsigned int']],
    'time': [0x18, ['unsigned long long']],
    'uaddr2': [0x20, ['pointer', ['unsigned int']]],
}],
  'ethtool_coalesce': [ size : 0x5c, {
    'cmd': [0x0, ['unsigned int']],
    'rx_coalesce_usecs': [0x4, ['unsigned int']],
    'rx_max_coalesced_frames': [0x8, ['unsigned int']],
    'rx_coalesce_usecs_irq': [0xc, ['unsigned int']],
    'rx_max_coalesced_frames_irq': [0x10, ['unsigned int']],
    'tx_coalesce_usecs': [0x14, ['unsigned int']],
    'tx_max_coalesced_frames': [0x18, ['unsigned int']],
    'tx_coalesce_usecs_irq': [0x1c, ['unsigned int']],
    'tx_max_coalesced_frames_irq': [0x20, ['unsigned int']],
    'stats_block_coalesce_usecs': [0x24, ['unsigned int']],
    'use_adaptive_rx_coalesce': [0x28, ['unsigned int']],
    'use_adaptive_tx_coalesce': [0x2c, ['unsigned int']],
    'pkt_rate_low': [0x30, ['unsigned int']],
    'rx_coalesce_usecs_low': [0x34, ['unsigned int']],
    'rx_max_coalesced_frames_low': [0x38, ['unsigned int']],
    'tx_coalesce_usecs_low': [0x3c, ['unsigned int']],
    'tx_max_coalesced_frames_low': [0x40, ['unsigned int']],
    'pkt_rate_high': [0x44, ['unsigned int']],
    'rx_coalesce_usecs_high': [0x48, ['unsigned int']],
    'rx_max_coalesced_frames_high': [0x4c, ['unsigned int']],
    'tx_coalesce_usecs_high': [0x50, ['unsigned int']],
    'tx_max_coalesced_frames_high': [0x54, ['unsigned int']],
    'rate_sample_interval': [0x58, ['unsigned int']],
}],
  'sb_writers': [ size : 0x1d0, {
    'frozen': [0x0, ['int']],
    'wait_unfrozen': [0x8, ['__wait_queue_head']],
    'rw_sem': [0x20, ['array', 3, ['percpu_rw_semaphore']]],
}],
  'x86_init_irqs': [ size : 0x18, {
    'pre_vector_init': [0x0, ['pointer', ['void']]],
    'intr_init': [0x8, ['pointer', ['void']]],
    'trap_init': [0x10, ['pointer', ['void']]],
}],
  'napi_struct': [ size : 0xc8, {
    'poll_list': [0x0, ['list_head']],
    'state': [0x10, ['unsigned long']],
    'weight': [0x18, ['int']],
    'gro_count': [0x1c, ['unsigned int']],
    'poll': [0x20, ['pointer', ['void']]],
    'poll_lock': [0x28, ['spinlock']],
    'poll_owner': [0x2c, ['int']],
    'dev': [0x30, ['pointer', ['net_device']]],
    'gro_list': [0x38, ['pointer', ['sk_buff']]],
    'skb': [0x40, ['pointer', ['sk_buff']]],
    'timer': [0x48, ['hrtimer']],
    'dev_list': [0xa0, ['list_head']],
    'napi_hash_node': [0xb0, ['hlist_node']],
    'napi_id': [0xc0, ['unsigned int']],
}],
  'socket_wq': [ size : 0x40, {
    'wait': [0x0, ['__wait_queue_head']],
    'fasync_list': [0x18, ['pointer', ['fasync_struct']]],
    'flags': [0x20, ['unsigned long']],
    'rcu': [0x28, ['callback_head']],
}],
  'netns_frags': [ size : 0x40, {
    'mem': [0x0, ['__unnamed_0x351']],
    'timeout': [0x4, ['int']],
    'high_thresh': [0x8, ['int']],
    'low_thresh': [0xc, ['int']],
}],
  'static_key': [ size : 0x18, {
    'enabled': [0x0, ['__unnamed_0x351']],
    'entries': [0x8, ['pointer', ['jump_entry']]],
    'next': [0x10, ['pointer', ['static_key_mod']]],
}],
  'hlist_node': [ size : 0x10, {
    'next': [0x0, ['pointer', ['hlist_node']]],
    'pprev': [0x8, ['pointer', ['pointer', ['hlist_node']]]],
}],
  'lruvec': [ size : 0x78, {
    'lists': [0x0, ['array', 5, ['list_head']]],
    'reclaim_stat': [0x50, ['zone_reclaim_stat']],
    'zone': [0x70, ['pointer', ['zone']]],
}],
  'wake_q_node': [ size : 0x8, {
    'next': [0x0, ['pointer', ['wake_q_node']]],
}],
  'pglist_data': [ size : 0x4f80, {
    'node_zones': [0x0, ['array', 5, ['zone']]],
    'node_zonelists': [0x26c0, ['array', 2, ['zonelist']]],
    'nr_zones': [0x4ee0, ['int']],
    'node_size_lock': [0x4ee4, ['spinlock']],
    'node_start_pfn': [0x4ee8, ['unsigned long']],
    'node_present_pages': [0x4ef0, ['unsigned long']],
    'node_spanned_pages': [0x4ef8, ['unsigned long']],
    'node_id': [0x4f00, ['int']],
    'kswapd_wait': [0x4f08, ['__wait_queue_head']],
    'pfmemalloc_wait': [0x4f20, ['__wait_queue_head']],
    'kswapd': [0x4f38, ['pointer', ['task_struct']]],
    'kswapd_max_order': [0x4f40, ['int']],
    'classzone_idx': [0x4f44, ['Enumeration', {'target': 'int', 'choices': {0: 'ZONE_DMA', 1: 'ZONE_DMA32', 2: 'ZONE_NORMAL', 3: 'ZONE_MOVABLE', 4: 'ZONE_DEVICE', 5: '__MAX_NR_ZONES'}}]],
    'numabalancing_migrate_lock': [0x4f48, ['spinlock']],
    'numabalancing_migrate_next_window': [0x4f50, ['unsigned long']],
    'numabalancing_migrate_nr_pages': [0x4f58, ['unsigned long']],
}],
  'pacct_struct': [ size : 0x38, {
    'ac_flag': [0x0, ['int']],
    'ac_exitcode': [0x8, ['long']],
    'ac_mem': [0x10, ['unsigned long']],
    'ac_utime': [0x18, ['unsigned long']],
    'ac_stime': [0x20, ['unsigned long']],
    'ac_minflt': [0x28, ['unsigned long']],
    'ac_majflt': [0x30, ['unsigned long']],
}],
  'u64_stats_sync': [ size : 0x0, {
}],
  'flow_cache_percpu': [ size : 0x40, {
    'hash_table': [0x0, ['pointer', ['hlist_head']]],
    'hash_count': [0x8, ['int']],
    'hash_rnd': [0xc, ['unsigned int']],
    'hash_rnd_recalc': [0x10, ['int']],
    'flush_tasklet': [0x18, ['tasklet_struct']],
}],
  'ld_semaphore': [ size : 0x30, {
    'count': [0x0, ['long']],
    'wait_lock': [0x8, ['raw_spinlock']],
    'wait_readers': [0xc, ['unsigned int']],
    'read_wait': [0x10, ['list_head']],
    'write_wait': [0x20, ['list_head']],
}],
  '__unnamed_0x1b633': [ size : 0x8, {
    'free': [0x0, ['llist_node']],
    'next': [0x0, ['pointer', ['tty_buffer']]],
}],
  'socket': [ size : 0x30, {
    'state': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'SS_FREE', 1: 'SS_UNCONNECTED', 2: 'SS_CONNECTING', 3: 'SS_CONNECTED', 4: 'SS_DISCONNECTING'}}]],
    'type': [0x4, ['short']],
    'flags': [0x8, ['unsigned long']],
    'wq': [0x10, ['pointer', ['socket_wq']]],
    'file': [0x18, ['pointer', ['file']]],
    'sk': [0x20, ['pointer', ['sock']]],
    'ops': [0x28, ['pointer', ['proto_ops']]],
}],
  'pgprot': [ size : 0x8, {
    'pgprot': [0x0, ['unsigned long']],
}],
  'tc_sizespec': [ size : 0x18, {
    'cell_log': [0x0, ['unsigned char']],
    'size_log': [0x1, ['unsigned char']],
    'cell_align': [0x2, ['short']],
    'overhead': [0x4, ['int']],
    'linklayer': [0x8, ['unsigned int']],
    'mpu': [0xc, ['unsigned int']],
    'mtu': [0x10, ['unsigned int']],
    'tsize': [0x14, ['unsigned int']],
}],
  'page_frag': [ size : 0x10, {
    'page': [0x0, ['pointer', ['page']]],
    'offset': [0x8, ['unsigned int']],
    'size': [0xc, ['unsigned int']],
}],
  'winsize': [ size : 0x8, {
    'ws_row': [0x0, ['unsigned short']],
    'ws_col': [0x2, ['unsigned short']],
    'ws_xpixel': [0x4, ['unsigned short']],
    'ws_ypixel': [0x6, ['unsigned short']],
}],
  'pv_lock_ops': [ size : 0x20, {
    'queued_spin_lock_slowpath': [0x0, ['pointer', ['void']]],
    'queued_spin_unlock': [0x8, ['paravirt_callee_save']],
    'wait': [0x10, ['pointer', ['void']]],
    'kick': [0x18, ['pointer', ['void']]],
}],
  'dentry_operations': [ size : 0x80, {
    'd_revalidate': [0x0, ['pointer', ['void']]],
    'd_weak_revalidate': [0x8, ['pointer', ['void']]],
    'd_hash': [0x10, ['pointer', ['void']]],
    'd_compare': [0x18, ['pointer', ['void']]],
    'd_delete': [0x20, ['pointer', ['void']]],
    'd_release': [0x28, ['pointer', ['void']]],
    'd_prune': [0x30, ['pointer', ['void']]],
    'd_iput': [0x38, ['pointer', ['void']]],
    'd_dname': [0x40, ['pointer', ['void']]],
    'd_automount': [0x48, ['pointer', ['void']]],
    'd_manage': [0x50, ['pointer', ['void']]],
    'd_select_inode': [0x58, ['pointer', ['void']]],
    'd_real': [0x60, ['pointer', ['void']]],
}],
  'hlist_bl_node': [ size : 0x10, {
    'next': [0x0, ['pointer', ['hlist_bl_node']]],
    'pprev': [0x8, ['pointer', ['pointer', ['hlist_bl_node']]]],
}],
  'keyring_index_key': [ size : 0x18, {
    'type': [0x0, ['pointer', ['key_type']]],
    'description': [0x8, ['pointer', ['char']]],
    'desc_len': [0x10, ['unsigned long']],
}],
  'mem_cgroup_id': [ size : 0x8, {
    'id': [0x0, ['int']],
    'ref': [0x4, ['__unnamed_0x351']],
}],
  '__unnamed_0x39a0': [ size : 0x20, {
    'symlink': [0x0, ['kernfs_elem_symlink']],
    'dir': [0x0, ['kernfs_elem_dir']],
    'attr': [0x0, ['kernfs_elem_attr']],
}],
  'attribute': [ size : 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'mode': [0x8, ['unsigned short']],
}],
  '__unnamed_0xfd70': [ size : 0x8, {
    'stamp_us': [0x0, ['unsigned int']],
    'stamp_jiffies': [0x4, ['unsigned int']],
}],
  'dcbnl_rtnl_ops': [ size : 0x178, {
    'ieee_getets': [0x0, ['pointer', ['void']]],
    'ieee_setets': [0x8, ['pointer', ['void']]],
    'ieee_getmaxrate': [0x10, ['pointer', ['void']]],
    'ieee_setmaxrate': [0x18, ['pointer', ['void']]],
    'ieee_getqcn': [0x20, ['pointer', ['void']]],
    'ieee_setqcn': [0x28, ['pointer', ['void']]],
    'ieee_getqcnstats': [0x30, ['pointer', ['void']]],
    'ieee_getpfc': [0x38, ['pointer', ['void']]],
    'ieee_setpfc': [0x40, ['pointer', ['void']]],
    'ieee_getapp': [0x48, ['pointer', ['void']]],
    'ieee_setapp': [0x50, ['pointer', ['void']]],
    'ieee_delapp': [0x58, ['pointer', ['void']]],
    'ieee_peer_getets': [0x60, ['pointer', ['void']]],
    'ieee_peer_getpfc': [0x68, ['pointer', ['void']]],
    'getstate': [0x70, ['pointer', ['void']]],
    'setstate': [0x78, ['pointer', ['void']]],
    'getpermhwaddr': [0x80, ['pointer', ['void']]],
    'setpgtccfgtx': [0x88, ['pointer', ['void']]],
    'setpgbwgcfgtx': [0x90, ['pointer', ['void']]],
    'setpgtccfgrx': [0x98, ['pointer', ['void']]],
    'setpgbwgcfgrx': [0xa0, ['pointer', ['void']]],
    'getpgtccfgtx': [0xa8, ['pointer', ['void']]],
    'getpgbwgcfgtx': [0xb0, ['pointer', ['void']]],
    'getpgtccfgrx': [0xb8, ['pointer', ['void']]],
    'getpgbwgcfgrx': [0xc0, ['pointer', ['void']]],
    'setpfccfg': [0xc8, ['pointer', ['void']]],
    'getpfccfg': [0xd0, ['pointer', ['void']]],
    'setall': [0xd8, ['pointer', ['void']]],
    'getcap': [0xe0, ['pointer', ['void']]],
    'getnumtcs': [0xe8, ['pointer', ['void']]],
    'setnumtcs': [0xf0, ['pointer', ['void']]],
    'getpfcstate': [0xf8, ['pointer', ['void']]],
    'setpfcstate': [0x100, ['pointer', ['void']]],
    'getbcncfg': [0x108, ['pointer', ['void']]],
    'setbcncfg': [0x110, ['pointer', ['void']]],
    'getbcnrp': [0x118, ['pointer', ['void']]],
    'setbcnrp': [0x120, ['pointer', ['void']]],
    'setapp': [0x128, ['pointer', ['void']]],
    'getapp': [0x130, ['pointer', ['void']]],
    'getfeatcfg': [0x138, ['pointer', ['void']]],
    'setfeatcfg': [0x140, ['pointer', ['void']]],
    'getdcbx': [0x148, ['pointer', ['void']]],
    'setdcbx': [0x150, ['pointer', ['void']]],
    'peer_getappinfo': [0x158, ['pointer', ['void']]],
    'peer_getapptable': [0x160, ['pointer', ['void']]],
    'cee_peer_getpg': [0x168, ['pointer', ['void']]],
    'cee_peer_getpfc': [0x170, ['pointer', ['void']]],
}],
  'page_counter': [ size : 0x28, {
    'count': [0x0, ['__unnamed_0x371']],
    'limit': [0x8, ['unsigned long']],
    'parent': [0x10, ['pointer', ['page_counter']]],
    'watermark': [0x18, ['unsigned long']],
    'failcnt': [0x20, ['unsigned long']],
}],
  'inet_timewait_death_row': [ size : 0x80, {
    'tw_count': [0x0, ['__unnamed_0x351']],
    'hashinfo': [0x40, ['pointer', ['inet_hashinfo']]],
    'sysctl_tw_recycle': [0x48, ['int']],
    'sysctl_max_tw_buckets': [0x4c, ['int']],
}],
  'xregs_state': [ size : 0x240, {
    'i387': [0x0, ['fxregs_state']],
    'header': [0x200, ['xstate_header']],
    'extended_state_area': [0x240, ['array', 0, ['unsigned char']]],
}],
  '__unnamed_0x19de7': [ size : 0x4, {
    'rid': [0x0, ['__unnamed_0x351']],
}],
  'fib_nh': [ size : 0x68, {
    'nh_dev': [0x0, ['pointer', ['net_device']]],
    'nh_hash': [0x8, ['hlist_node']],
    'nh_parent': [0x18, ['pointer', ['fib_info']]],
    'nh_flags': [0x20, ['unsigned int']],
    'nh_scope': [0x24, ['unsigned char']],
    'nh_weight': [0x28, ['int']],
    'nh_upper_bound': [0x2c, ['__unnamed_0x351']],
    'nh_tclassid': [0x30, ['unsigned int']],
    'nh_oif': [0x34, ['int']],
    'nh_gw': [0x38, ['unsigned int']],
    'nh_saddr': [0x3c, ['unsigned int']],
    'nh_saddr_genid': [0x40, ['int']],
    'nh_pcpu_rth_output': [0x48, ['pointer', ['pointer', ['rtable']]]],
    'nh_rth_input': [0x50, ['pointer', ['rtable']]],
    'nh_exceptions': [0x58, ['pointer', ['fnhe_hash_bucket']]],
    'nh_lwtstate': [0x60, ['pointer', ['lwtunnel_state']]],
}],
  'fib_table': [ size : 0x30, {
    'tb_hlist': [0x0, ['hlist_node']],
    'tb_id': [0x10, ['unsigned int']],
    'tb_num_default': [0x14, ['int']],
    'rcu': [0x18, ['callback_head']],
    'tb_data': [0x28, ['pointer', ['unsigned long']]],
    '__data': [0x30, ['array', 0, ['unsigned long']]],
}],
  'class_attribute': [ size : 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  'latch_tree_node': [ size : 0x30, {
    'node': [0x0, ['array', 2, ['rb_node']]],
}],
  'tty_buffer': [ size : 0x20, {
    '__unnamed_0x1b65e': [0x0, ['__unnamed_0x1b633']],
    'used': [0x8, ['int']],
    'size': [0xc, ['int']],
    'commit': [0x10, ['int']],
    'read': [0x14, ['int']],
    'flags': [0x18, ['int']],
    'data': [0x20, ['array', 0, ['unsigned long']]],
}],
  '__unnamed_0x183c6': [ size : 0x8, {
    'rt6_next': [0x0, ['pointer', ['rt6_info']]],
    'rt_next': [0x0, ['pointer', ['rtable']]],
    'dn_next': [0x0, ['pointer', ['dn_route']]],
    'next': [0x0, ['pointer', ['dst_entry']]],
}],
  'irq_stack_union': [ size : 0x4000, {
    '__unnamed_0x1c34': [0x0, ['__unnamed_0x1be6']],
    'irq_stack': [0x0, ['array', 16384, ['char']]],
}],
  'x86_init_paging': [ size : 0x8, {
    'pagetable_init': [0x0, ['pointer', ['void']]],
}],
  'ipv6_devconf': [ size : 0xb0, {
    'forwarding': [0x0, ['int']],
    'hop_limit': [0x4, ['int']],
    'mtu6': [0x8, ['int']],
    'accept_ra': [0xc, ['int']],
    'accept_redirects': [0x10, ['int']],
    'autoconf': [0x14, ['int']],
    'dad_transmits': [0x18, ['int']],
    'rtr_solicits': [0x1c, ['int']],
    'rtr_solicit_interval': [0x20, ['int']],
    'rtr_solicit_delay': [0x24, ['int']],
    'force_mld_version': [0x28, ['int']],
    'mldv1_unsolicited_report_interval': [0x2c, ['int']],
    'mldv2_unsolicited_report_interval': [0x30, ['int']],
    'use_tempaddr': [0x34, ['int']],
    'temp_valid_lft': [0x38, ['int']],
    'temp_prefered_lft': [0x3c, ['int']],
    'regen_max_retry': [0x40, ['int']],
    'max_desync_factor': [0x44, ['int']],
    'max_addresses': [0x48, ['int']],
    'accept_ra_defrtr': [0x4c, ['int']],
    'accept_ra_min_hop_limit': [0x50, ['int']],
    'accept_ra_pinfo': [0x54, ['int']],
    'ignore_routes_with_linkdown': [0x58, ['int']],
    'accept_ra_rtr_pref': [0x5c, ['int']],
    'rtr_probe_interval': [0x60, ['int']],
    'accept_ra_rt_info_max_plen': [0x64, ['int']],
    'proxy_ndp': [0x68, ['int']],
    'accept_source_route': [0x6c, ['int']],
    'accept_ra_from_local': [0x70, ['int']],
    'mc_forwarding': [0x74, ['int']],
    'disable_ipv6': [0x78, ['int']],
    'accept_dad': [0x7c, ['int']],
    'force_tllao': [0x80, ['int']],
    'ndisc_notify': [0x84, ['int']],
    'suppress_frag_ndisc': [0x88, ['int']],
    'accept_ra_mtu': [0x8c, ['int']],
    'stable_secret': [0x90, ['ipv6_stable_secret']],
    'use_oif_addrs_only': [0xa4, ['int']],
    'sysctl': [0xa8, ['pointer', ['void']]],
}],
  'fpu': [ size : 0x1040, {
    'last_cpu': [0x0, ['unsigned int']],
    'fpstate_active': [0x4, ['unsigned char']],
    'fpregs_active': [0x5, ['unsigned char']],
    'counter': [0x6, ['unsigned char']],
    'state': [0x40, ['fpregs_state']],
}],
  'cpumask': [ size : 0x40, {
    'bits': [0x0, ['array', 8, ['unsigned long']]],
}],
  'bpf_prog': [ size : 0x28, {
    'pages': [0x0, ['unsigned short']],
    'dst_needed': [0x2, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'jited': [0x2, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'cb_access': [0x2, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'gpl_compatible': [0x2, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'len': [0x4, ['unsigned int']],
    'type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'BPF_PROG_TYPE_UNSPEC', 1: 'BPF_PROG_TYPE_SOCKET_FILTER', 2: 'BPF_PROG_TYPE_KPROBE', 3: 'BPF_PROG_TYPE_SCHED_CLS', 4: 'BPF_PROG_TYPE_SCHED_ACT'}}]],
    'aux': [0x10, ['pointer', ['bpf_prog_aux']]],
    'orig_prog': [0x18, ['pointer', ['sock_fprog_kern']]],
    'bpf_func': [0x20, ['pointer', ['void']]],
    '__unnamed_0x17ee4': [0x28, ['__unnamed_0x17e09']],
}],
  '__unnamed_0x9b6': [ size : 0x8, {
    'pte': [0x0, ['unsigned long']],
}],
  'ethtool_flow_ext': [ size : 0x14, {
    'padding': [0x0, ['array', 2, ['unsigned char']]],
    'h_dest': [0x2, ['array', 6, ['unsigned char']]],
    'vlan_etype': [0x8, ['unsigned short']],
    'vlan_tci': [0xa, ['unsigned short']],
    'data': [0xc, ['array', 2, ['unsigned int']]],
}],
  'tty_ldisc_ops': [ size : 0xa8, {
    'magic': [0x0, ['int']],
    'name': [0x8, ['pointer', ['char']]],
    'num': [0x10, ['int']],
    'flags': [0x14, ['int']],
    'open': [0x18, ['pointer', ['void']]],
    'close': [0x20, ['pointer', ['void']]],
    'flush_buffer': [0x28, ['pointer', ['void']]],
    'chars_in_buffer': [0x30, ['pointer', ['void']]],
    'read': [0x38, ['pointer', ['void']]],
    'write': [0x40, ['pointer', ['void']]],
    'ioctl': [0x48, ['pointer', ['void']]],
    'compat_ioctl': [0x50, ['pointer', ['void']]],
    'set_termios': [0x58, ['pointer', ['void']]],
    'poll': [0x60, ['pointer', ['void']]],
    'hangup': [0x68, ['pointer', ['void']]],
    'receive_buf': [0x70, ['pointer', ['void']]],
    'write_wakeup': [0x78, ['pointer', ['void']]],
    'dcd_change': [0x80, ['pointer', ['void']]],
    'fasync': [0x88, ['pointer', ['void']]],
    'receive_buf2': [0x90, ['pointer', ['void']]],
    'owner': [0x98, ['pointer', ['module']]],
    'refcount': [0xa0, ['int']],
}],
  'nsproxy': [ size : 0x38, {
    'count': [0x0, ['__unnamed_0x351']],
    'uts_ns': [0x8, ['pointer', ['uts_namespace']]],
    'ipc_ns': [0x10, ['pointer', ['ipc_namespace']]],
    'mnt_ns': [0x18, ['pointer', ['mnt_namespace']]],
    'pid_ns_for_children': [0x20, ['pointer', ['pid_namespace']]],
    'net_ns': [0x28, ['pointer', ['net']]],
    'cgroup_ns': [0x30, ['pointer', ['cgroup_namespace']]],
}],
  '__unnamed_0xb999': [ size : 0x18, {
    'serial_node': [0x0, ['rb_node']],
    'graveyard_link': [0x0, ['list_head']],
}],
  'ifla_vf_info': [ size : 0x44, {
    'vf': [0x0, ['unsigned int']],
    'mac': [0x4, ['array', 32, ['unsigned char']]],
    'vlan': [0x24, ['unsigned int']],
    'qos': [0x28, ['unsigned int']],
    'spoofchk': [0x2c, ['unsigned int']],
    'linkstate': [0x30, ['unsigned int']],
    'min_tx_rate': [0x34, ['unsigned int']],
    'max_tx_rate': [0x38, ['unsigned int']],
    'rss_query_en': [0x3c, ['unsigned int']],
    'trusted': [0x40, ['unsigned int']],
}],
  'mem_cgroup_per_zone': [ size : 0x1a0, {
    'lruvec': [0x0, ['lruvec']],
    'lru_size': [0x78, ['array', 5, ['unsigned long']]],
    'iter': [0xa0, ['array', 13, ['mem_cgroup_reclaim_iter']]],
    'tree_node': [0x170, ['rb_node']],
    'usage_in_excess': [0x188, ['unsigned long']],
    'on_tree': [0x190, ['unsigned char']],
    'memcg': [0x198, ['pointer', ['mem_cgroup']]],
}],
  'tty_port_operations': [ size : 0x28, {
    'carrier_raised': [0x0, ['pointer', ['void']]],
    'dtr_rts': [0x8, ['pointer', ['void']]],
    'shutdown': [0x10, ['pointer', ['void']]],
    'activate': [0x18, ['pointer', ['void']]],
    'destruct': [0x20, ['pointer', ['void']]],
}],
  'icmpv6_mib_device': [ size : 0x30, {
    'mibs': [0x0, ['array', 6, ['__unnamed_0x371']]],
}],
  'iov_iter': [ size : 0x28, {
    'type': [0x0, ['int']],
    'iov_offset': [0x8, ['unsigned long']],
    'count': [0x10, ['unsigned long']],
    '__unnamed_0x9869': [0x18, ['__unnamed_0xd883']],
    'nr_segs': [0x20, ['unsigned long']],
}],
  'nf_bridge_info': [ size : 0x28, {
    'use': [0x0, ['__unnamed_0x351']],
    'orig_proto': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'pkt_otherhost': [0x5, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'in_prerouting': [0x5, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'bridged_dnat': [0x5, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'frag_max_size': [0x6, ['unsigned short']],
    'physindev': [0x8, ['pointer', ['net_device']]],
    'physoutdev': [0x10, ['pointer', ['net_device']]],
    '__unnamed_0xf272': [0x18, ['__unnamed_0xf1d0']],
}],
  'per_cpu_pages': [ size : 0x40, {
    'count': [0x0, ['int']],
    'high': [0x4, ['int']],
    'batch': [0x8, ['int']],
    'lists': [0x10, ['array', 3, ['list_head']]],
}],
  'dma_map_ops': [ size : 0x80, {
    'alloc': [0x0, ['pointer', ['void']]],
    'free': [0x8, ['pointer', ['void']]],
    'mmap': [0x10, ['pointer', ['void']]],
    'get_sgtable': [0x18, ['pointer', ['void']]],
    'map_page': [0x20, ['pointer', ['void']]],
    'unmap_page': [0x28, ['pointer', ['void']]],
    'map_sg': [0x30, ['pointer', ['void']]],
    'unmap_sg': [0x38, ['pointer', ['void']]],
    'sync_single_for_cpu': [0x40, ['pointer', ['void']]],
    'sync_single_for_device': [0x48, ['pointer', ['void']]],
    'sync_sg_for_cpu': [0x50, ['pointer', ['void']]],
    'sync_sg_for_device': [0x58, ['pointer', ['void']]],
    'mapping_error': [0x60, ['pointer', ['void']]],
    'dma_supported': [0x68, ['pointer', ['void']]],
    'set_dma_mask': [0x70, ['pointer', ['void']]],
    'is_phys': [0x78, ['int']],
}],
  'kernfs_elem_symlink': [ size : 0x8, {
    'target_kn': [0x0, ['pointer', ['kernfs_node']]],
}],
  '__unnamed_0x5805': [ size : 0x10, {
    '__unnamed_0x580d': [0x0, ['__unnamed_0x574d']],
    '__unnamed_0x5813': [0x8, ['__unnamed_0x57e1']],
}],
  '__unnamed_0xfec3': [ size : 0x2, {
    'inner_protocol': [0x0, ['unsigned short']],
    'inner_ipproto': [0x0, ['unsigned char']],
}],
  'nf_proto_net': [ size : 0x18, {
    'ctl_table_header': [0x0, ['pointer', ['ctl_table_header']]],
    'ctl_table': [0x8, ['pointer', ['ctl_table']]],
    'users': [0x10, ['unsigned int']],
}],
  'dentry': [ size : 0xc0, {
    'd_flags': [0x0, ['unsigned int']],
    'd_seq': [0x4, ['seqcount']],
    'd_hash': [0x8, ['hlist_bl_node']],
    'd_parent': [0x18, ['pointer', ['dentry']]],
    'd_name': [0x20, ['qstr']],
    'd_inode': [0x30, ['pointer', ['inode']]],
    'd_iname': [0x38, ['array', 32, ['unsigned char']]],
    'd_lockref': [0x58, ['lockref']],
    'd_op': [0x60, ['pointer', ['dentry_operations']]],
    'd_sb': [0x68, ['pointer', ['super_block']]],
    'd_time': [0x70, ['unsigned long']],
    'd_fsdata': [0x78, ['pointer', ['void']]],
    'd_lru': [0x80, ['list_head']],
    'd_child': [0x90, ['list_head']],
    'd_subdirs': [0xa0, ['list_head']],
    'd_u': [0xb0, ['__unnamed_0x7818']],
}],
  'sock_common': [ size : 0x88, {
    '__unnamed_0x18726': [0x0, ['__unnamed_0x18599']],
    '__unnamed_0x1872c': [0x8, ['__unnamed_0x185b2']],
    '__unnamed_0x18732': [0xc, ['__unnamed_0x18602']],
    'skc_family': [0x10, ['unsigned short']],
    'skc_state': [0x12, ['unsigned char']],
    'skc_reuse': [0x13, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'skc_reuseport': [0x13, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'skc_net_refcnt': [0x13, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'skc_ipv6only': [0x13, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'skc_bound_dev_if': [0x14, ['int']],
    '__unnamed_0x18798': [0x18, ['__unnamed_0x1861b']],
    'skc_prot': [0x28, ['pointer', ['proto']]],
    'skc_net': [0x30, ['__unnamed_0x13d29']],
    'skc_v6_daddr': [0x38, ['in6_addr']],
    'skc_v6_rcv_saddr': [0x48, ['in6_addr']],
    'skc_cookie': [0x58, ['__unnamed_0x371']],
    '__unnamed_0x187da': [0x60, ['__unnamed_0x1863a']],
    'skc_dontcopy_begin': [0x68, ['array', 0, ['int']]],
    '__unnamed_0x187ec': [0x68, ['__unnamed_0x186a7']],
    'skc_tx_queue_mapping': [0x78, ['int']],
    '__unnamed_0x187fe': [0x7c, ['__unnamed_0x186c6']],
    'skc_refcnt': [0x80, ['__unnamed_0x351']],
    'skc_dontcopy_end': [0x84, ['array', 0, ['int']]],
    '__unnamed_0x1881c': [0x84, ['__unnamed_0x186f0']],
}],
  'icmpv6msg_mib': [ size : 0x1000, {
    'mibs': [0x0, ['array', 512, ['__unnamed_0x371']]],
}],
  'ipv4_devconf': [ size : 0x88, {
    'sysctl': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['array', 29, ['int']]],
    'state': [0x80, ['array', 1, ['unsigned long']]],
}],
  'ndmsg': [ size : 0xc, {
    'ndm_family': [0x0, ['unsigned char']],
    'ndm_pad1': [0x1, ['unsigned char']],
    'ndm_pad2': [0x2, ['unsigned short']],
    'ndm_ifindex': [0x4, ['int']],
    'ndm_state': [0x8, ['unsigned short']],
    'ndm_flags': [0xa, ['unsigned char']],
    'ndm_type': [0xb, ['unsigned char']],
}],
  'qc_state': [ size : 0xb0, {
    's_incoredqs': [0x0, ['unsigned int']],
    's_state': [0x8, ['array', 3, ['qc_type_state']]],
}],
  'ida': [ size : 0x30, {
    'idr': [0x0, ['idr']],
    'free_bitmap': [0x28, ['pointer', ['ida_bitmap']]],
}],
  '__unnamed_0xa510': [ size : 0x20, {
    'nfs_fl': [0x0, ['nfs_lock_info']],
    'nfs4_fl': [0x0, ['nfs4_lock_info']],
    'afs': [0x0, ['__unnamed_0xa4ec']],
}],
  'uid_gid_extent': [ size : 0xc, {
    'first': [0x0, ['unsigned int']],
    'lower_first': [0x4, ['unsigned int']],
    'count': [0x8, ['unsigned int']],
}],
  'ethtool_ts_info': [ size : 0x2c, {
    'cmd': [0x0, ['unsigned int']],
    'so_timestamping': [0x4, ['unsigned int']],
    'phc_index': [0x8, ['int']],
    'tx_types': [0xc, ['unsigned int']],
    'tx_reserved': [0x10, ['array', 3, ['unsigned int']]],
    'rx_filters': [0x1c, ['unsigned int']],
    'rx_reserved': [0x20, ['array', 3, ['unsigned int']]],
}],
  '__unnamed_0x111be': [ size : 0x18, {
    'supported': [0x0, ['array', 1, ['unsigned long']]],
    'advertising': [0x8, ['array', 1, ['unsigned long']]],
    'lp_advertising': [0x10, ['array', 1, ['unsigned long']]],
}],
  'mpc_cpu': [ size : 0x14, {
    'type': [0x0, ['unsigned char']],
    'apicid': [0x1, ['unsigned char']],
    'apicver': [0x2, ['unsigned char']],
    'cpuflag': [0x3, ['unsigned char']],
    'cpufeature': [0x4, ['unsigned int']],
    'featureflag': [0x8, ['unsigned int']],
    'reserved': [0xc, ['array', 2, ['unsigned int']]],
}],
  'raw_spinlock': [ size : 0x4, {
    'raw_lock': [0x0, ['qspinlock']],
}],
  'fiemap_extent_info': [ size : 0x18, {
    'fi_flags': [0x0, ['unsigned int']],
    'fi_extents_mapped': [0x4, ['unsigned int']],
    'fi_extents_max': [0x8, ['unsigned int']],
    'fi_extents_start': [0x10, ['pointer', ['fiemap_extent']]],
}],
  'inet_protosw': [ size : 0x30, {
    'list': [0x0, ['list_head']],
    'type': [0x10, ['unsigned short']],
    'protocol': [0x12, ['unsigned short']],
    'prot': [0x18, ['pointer', ['proto']]],
    'ops': [0x20, ['pointer', ['proto_ops']]],
    'flags': [0x28, ['unsigned char']],
}],
  'bio_vec': [ size : 0x10, {
    'bv_page': [0x0, ['pointer', ['page']]],
    'bv_len': [0x8, ['unsigned int']],
    'bv_offset': [0xc, ['unsigned int']],
}],
  'latch_tree_root': [ size : 0x18, {
    'seq': [0x0, ['seqcount']],
    'tree': [0x8, ['array', 2, ['rb_root']]],
}],
  'seccomp': [ size : 0x10, {
    'mode': [0x0, ['int']],
    'filter': [0x8, ['pointer', ['seccomp_filter']]],
}],
  'timerqueue_node': [ size : 0x20, {
    'node': [0x0, ['rb_node']],
    'expires': [0x18, ['ktime']],
}],
  'pid_namespace': [ size : 0x8b0, {
    'kref': [0x0, ['kref']],
    'pidmap': [0x8, ['array', 128, ['pidmap']]],
    'rcu': [0x808, ['callback_head']],
    'last_pid': [0x818, ['int']],
    'nr_hashed': [0x81c, ['unsigned int']],
    'child_reaper': [0x820, ['pointer', ['task_struct']]],
    'pid_cachep': [0x828, ['pointer', ['kmem_cache']]],
    'level': [0x830, ['unsigned int']],
    'parent': [0x838, ['pointer', ['pid_namespace']]],
    'proc_mnt': [0x840, ['pointer', ['vfsmount']]],
    'proc_self': [0x848, ['pointer', ['dentry']]],
    'proc_thread_self': [0x850, ['pointer', ['dentry']]],
    'bacct': [0x858, ['pointer', ['fs_pin']]],
    'user_ns': [0x860, ['pointer', ['user_namespace']]],
    'proc_work': [0x868, ['work_struct']],
    'pid_gid': [0x888, ['__unnamed_0x2ca1']],
    'hide_pid': [0x88c, ['int']],
    'reboot': [0x890, ['int']],
    'ns': [0x898, ['ns_common']],
}],
  'rb_node': [ size : 0x18, {
    '__rb_parent_color': [0x0, ['unsigned long']],
    'rb_right': [0x8, ['pointer', ['rb_node']]],
    'rb_left': [0x10, ['pointer', ['rb_node']]],
}],
  'tty_operations': [ size : 0x110, {
    'lookup': [0x0, ['pointer', ['void']]],
    'install': [0x8, ['pointer', ['void']]],
    'remove': [0x10, ['pointer', ['void']]],
    'open': [0x18, ['pointer', ['void']]],
    'close': [0x20, ['pointer', ['void']]],
    'shutdown': [0x28, ['pointer', ['void']]],
    'cleanup': [0x30, ['pointer', ['void']]],
    'write': [0x38, ['pointer', ['void']]],
    'put_char': [0x40, ['pointer', ['void']]],
    'flush_chars': [0x48, ['pointer', ['void']]],
    'write_room': [0x50, ['pointer', ['void']]],
    'chars_in_buffer': [0x58, ['pointer', ['void']]],
    'ioctl': [0x60, ['pointer', ['void']]],
    'compat_ioctl': [0x68, ['pointer', ['void']]],
    'set_termios': [0x70, ['pointer', ['void']]],
    'throttle': [0x78, ['pointer', ['void']]],
    'unthrottle': [0x80, ['pointer', ['void']]],
    'stop': [0x88, ['pointer', ['void']]],
    'start': [0x90, ['pointer', ['void']]],
    'hangup': [0x98, ['pointer', ['void']]],
    'break_ctl': [0xa0, ['pointer', ['void']]],
    'flush_buffer': [0xa8, ['pointer', ['void']]],
    'set_ldisc': [0xb0, ['pointer', ['void']]],
    'wait_until_sent': [0xb8, ['pointer', ['void']]],
    'send_xchar': [0xc0, ['pointer', ['void']]],
    'tiocmget': [0xc8, ['pointer', ['void']]],
    'tiocmset': [0xd0, ['pointer', ['void']]],
    'resize': [0xd8, ['pointer', ['void']]],
    'set_termiox': [0xe0, ['pointer', ['void']]],
    'get_icount': [0xe8, ['pointer', ['void']]],
    'poll_init': [0xf0, ['pointer', ['void']]],
    'poll_get_char': [0xf8, ['pointer', ['void']]],
    'poll_put_char': [0x100, ['pointer', ['void']]],
    'proc_fops': [0x108, ['pointer', ['file_operations']]],
}],
  'sigval': [ size : 0x8, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['pointer', ['void']]],
}],
  '__unnamed_0xfd94': [ size : 0x8, {
    '__unnamed_0xfda9': [0x0, ['__unnamed_0xfd70']],
    'v64': [0x0, ['unsigned long long']],
}],
  '__unnamed_0xba32': [ size : 0x20, {
    '__unnamed_0xba45': [0x0, ['__unnamed_0xba11']],
    'payload': [0x0, ['key_payload']],
}],
  'netns_mpls': [ size : 0x18, {
    'platform_labels': [0x0, ['unsigned long']],
    'platform_label': [0x8, ['pointer', ['pointer', ['mpls_route']]]],
    'ctl': [0x10, ['pointer', ['ctl_table_header']]],
}],
  'arch_clocksource_data': [ size : 0x4, {
    'vclock_mode': [0x0, ['int']],
}],
  'nf_hook_ops': [ size : 0x38, {
    'list': [0x0, ['list_head']],
    'hook': [0x10, ['pointer', ['void']]],
    'dev': [0x18, ['pointer', ['net_device']]],
    'priv': [0x20, ['pointer', ['void']]],
    'pf': [0x28, ['unsigned char']],
    'hooknum': [0x2c, ['unsigned int']],
    'priority': [0x30, ['int']],
}],
  '__unnamed_0xfde5': [ size : 0x18, {
    'next': [0x0, ['pointer', ['sk_buff']]],
    'prev': [0x8, ['pointer', ['sk_buff']]],
    '__unnamed_0xfe08': [0x10, ['__unnamed_0xfdc3']],
}],
  'netdev_rx_queue': [ size : 0x80, {
    'rps_map': [0x0, ['pointer', ['rps_map']]],
    'rps_flow_table': [0x8, ['pointer', ['rps_dev_flow_table']]],
    'kobj': [0x10, ['kobject']],
    'dev': [0x50, ['pointer', ['net_device']]],
}],
  '__unnamed_0x1045d': [ size : 0x10, {
    'ifrn_name': [0x0, ['array', 16, ['char']]],
}],
  'cred': [ size : 0xa8, {
    'usage': [0x0, ['__unnamed_0x351']],
    'uid': [0x4, ['__unnamed_0x2c81']],
    'gid': [0x8, ['__unnamed_0x2ca1']],
    'suid': [0xc, ['__unnamed_0x2c81']],
    'sgid': [0x10, ['__unnamed_0x2ca1']],
    'euid': [0x14, ['__unnamed_0x2c81']],
    'egid': [0x18, ['__unnamed_0x2ca1']],
    'fsuid': [0x1c, ['__unnamed_0x2c81']],
    'fsgid': [0x20, ['__unnamed_0x2ca1']],
    'securebits': [0x24, ['unsigned int']],
    'cap_inheritable': [0x28, ['kernel_cap_struct']],
    'cap_permitted': [0x30, ['kernel_cap_struct']],
    'cap_effective': [0x38, ['kernel_cap_struct']],
    'cap_bset': [0x40, ['kernel_cap_struct']],
    'cap_ambient': [0x48, ['kernel_cap_struct']],
    'jit_keyring': [0x50, ['unsigned char']],
    'session_keyring': [0x58, ['pointer', ['key']]],
    'process_keyring': [0x60, ['pointer', ['key']]],
    'thread_keyring': [0x68, ['pointer', ['key']]],
    'request_key_auth': [0x70, ['pointer', ['key']]],
    'security': [0x78, ['pointer', ['void']]],
    'user': [0x80, ['pointer', ['user_struct']]],
    'user_ns': [0x88, ['pointer', ['user_namespace']]],
    'group_info': [0x90, ['pointer', ['group_info']]],
    'rcu': [0x98, ['callback_head']],
}],
  'cgroup_subsys_state': [ size : 0xb8, {
    'cgroup': [0x0, ['pointer', ['cgroup']]],
    'ss': [0x8, ['pointer', ['cgroup_subsys']]],
    'refcnt': [0x10, ['percpu_ref']],
    'parent': [0x48, ['pointer', ['cgroup_subsys_state']]],
    'sibling': [0x50, ['list_head']],
    'children': [0x60, ['list_head']],
    'id': [0x70, ['int']],
    'flags': [0x74, ['unsigned int']],
    'serial_nr': [0x78, ['unsigned long long']],
    'online_cnt': [0x80, ['__unnamed_0x351']],
    'callback_head': [0x88, ['callback_head']],
    'destroy_work': [0x98, ['work_struct']],
}],
  'ipv4_addr_key': [ size : 0x8, {
    'addr': [0x0, ['unsigned int']],
    'vif': [0x4, ['int']],
}],
  'module_sect_attrs': [ size : 0x30, {
    'grp': [0x0, ['attribute_group']],
    'nsections': [0x28, ['unsigned int']],
    'attrs': [0x30, ['array', 0, ['module_sect_attr']]],
}],
  'kqid': [ size : 0x8, {
    '__unnamed_0x8d69': [0x0, ['__unnamed_0x8d33']],
    'type': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'USRQUOTA', 1: 'GRPQUOTA', 2: 'PRJQUOTA'}}]],
}],
  'thread_group_cputimer': [ size : 0x20, {
    'cputime_atomic': [0x0, ['task_cputime_atomic']],
    'running': [0x18, ['unsigned char']],
    'checking_timer': [0x19, ['unsigned char']],
}],
  'jump_entry': [ size : 0x18, {
    'code': [0x0, ['unsigned long long']],
    'target': [0x8, ['unsigned long long']],
    'key': [0x10, ['unsigned long long']],
}],
  'tlbflush_unmap_batch': [ size : 0x48, {
    'cpumask': [0x0, ['cpumask']],
    'flush_required': [0x40, ['unsigned char']],
    'writable': [0x41, ['unsigned char']],
}],
  '__unnamed_0xf005': [ size : 0x4, {
    'dport': [0x0, ['unsigned short']],
    'sport': [0x2, ['unsigned short']],
}],
  'upid': [ size : 0x20, {
    'nr': [0x0, ['int']],
    'ns': [0x8, ['pointer', ['pid_namespace']]],
    'pid_chain': [0x10, ['hlist_node']],
}],
  'uts_namespace': [ size : 0x1b0, {
    'kref': [0x0, ['kref']],
    'name': [0x4, ['new_utsname']],
    'user_ns': [0x190, ['pointer', ['user_namespace']]],
    'ns': [0x198, ['ns_common']],
}],
  'hlist_nulls_head': [ size : 0x8, {
    'first': [0x0, ['pointer', ['hlist_nulls_node']]],
}],
  'netns_packet': [ size : 0x30, {
    'sklist_lock': [0x0, ['mutex']],
    'sklist': [0x28, ['hlist_head']],
}],
  'fib_rule': [ size : 0x88, {
    'list': [0x0, ['list_head']],
    'iifindex': [0x10, ['int']],
    'oifindex': [0x14, ['int']],
    'mark': [0x18, ['unsigned int']],
    'mark_mask': [0x1c, ['unsigned int']],
    'flags': [0x20, ['unsigned int']],
    'table': [0x24, ['unsigned int']],
    'action': [0x28, ['unsigned char']],
    'target': [0x2c, ['unsigned int']],
    'tun_id': [0x30, ['unsigned long long']],
    'ctarget': [0x38, ['pointer', ['fib_rule']]],
    'fr_net': [0x40, ['pointer', ['net']]],
    'refcnt': [0x48, ['__unnamed_0x351']],
    'pref': [0x4c, ['unsigned int']],
    'suppress_ifgroup': [0x50, ['int']],
    'suppress_prefixlen': [0x54, ['int']],
    'iifname': [0x58, ['array', 16, ['char']]],
    'oifname': [0x68, ['array', 16, ['char']]],
    'rcu': [0x78, ['callback_head']],
}],
  '__unnamed_0x198fd': [ size : 0x2, {
    'all': [0x0, ['unsigned short']],
    'bits': [0x0, ['__unnamed_0x19822']],
}],
  '__unnamed_0x9ace': [ size : 0x8, {
    'i_cdev': [0x0, ['pointer', ['cdev']]],
    'i_link': [0x0, ['pointer', ['char']]],
    'i_bdev': [0x0, ['pointer', ['block_device']]],
    'i_pipe': [0x0, ['pointer', ['pipe_inode_info']]],
}],
  'bvec_iter': [ size : 0x18, {
    'bi_sector': [0x0, ['unsigned long']],
    'bi_size': [0x8, ['unsigned int']],
    'bi_idx': [0xc, ['unsigned int']],
    'bi_bvec_done': [0x10, ['unsigned int']],
}],
  'netns_ct': [ size : 0x218, {
    'count': [0x0, ['__unnamed_0x351']],
    'expect_count': [0x4, ['unsigned int']],
    'ecache_dwork': [0x8, ['delayed_work']],
    'ecache_dwork_pending': [0x88, ['unsigned char']],
    'sysctl_header': [0x90, ['pointer', ['ctl_table_header']]],
    'acct_sysctl_header': [0x98, ['pointer', ['ctl_table_header']]],
    'tstamp_sysctl_header': [0xa0, ['pointer', ['ctl_table_header']]],
    'event_sysctl_header': [0xa8, ['pointer', ['ctl_table_header']]],
    'helper_sysctl_header': [0xb0, ['pointer', ['ctl_table_header']]],
    'slabname': [0xb8, ['pointer', ['char']]],
    'sysctl_log_invalid': [0xc0, ['unsigned int']],
    'sysctl_events': [0xc4, ['int']],
    'sysctl_acct': [0xc8, ['int']],
    'sysctl_auto_assign_helper': [0xcc, ['int']],
    'auto_assign_helper_warned': [0xd0, ['unsigned char']],
    'sysctl_tstamp': [0xd4, ['int']],
    'sysctl_checksum': [0xd8, ['int']],
    'htable_size': [0xdc, ['unsigned int']],
    'generation': [0xe0, ['seqcount']],
    'nf_conntrack_cachep': [0xe8, ['pointer', ['kmem_cache']]],
    'hash': [0xf0, ['pointer', ['hlist_nulls_head']]],
    'expect_hash': [0xf8, ['pointer', ['hlist_head']]],
    'pcpu_lists': [0x100, ['pointer', ['ct_pcpu']]],
    'stat': [0x108, ['pointer', ['ip_conntrack_stat']]],
    'nf_conntrack_event_cb': [0x110, ['pointer', ['nf_ct_event_notifier']]],
    'nf_expect_event_cb': [0x118, ['pointer', ['nf_exp_event_notifier']]],
    'nf_ct_proto': [0x120, ['nf_ip_net']],
    'labels_used': [0x200, ['unsigned int']],
    'label_words': [0x204, ['unsigned char']],
    'nat_bysource': [0x208, ['pointer', ['hlist_head']]],
    'nat_htable_size': [0x210, ['unsigned int']],
}],
  'ctl_table_root': [ size : 0x68, {
    'default_set': [0x0, ['ctl_table_set']],
    'lookup': [0x58, ['pointer', ['void']]],
    'permissions': [0x60, ['pointer', ['void']]],
}],
  'spinlock': [ size : 0x4, {
    '__unnamed_0x1ccb': [0x0, ['__unnamed_0x1cab']],
}],
  'x86_init_pci': [ size : 0x20, {
    'arch_init': [0x0, ['pointer', ['void']]],
    'init': [0x8, ['pointer', ['void']]],
    'init_irq': [0x10, ['pointer', ['void']]],
    'fixup_irqs': [0x18, ['pointer', ['void']]],
}],
  'plist_node': [ size : 0x28, {
    'prio': [0x0, ['int']],
    'prio_list': [0x8, ['list_head']],
    'node_list': [0x18, ['list_head']],
}],
  '__unnamed_0x7818': [ size : 0x10, {
    'd_rcu': [0x0, ['callback_head']],
    'd_alias': [0x0, ['hlist_node']],
}],
  'mem_cgroup_reclaim_iter': [ size : 0x10, {
    'position': [0x0, ['pointer', ['mem_cgroup']]],
    'generation': [0x8, ['unsigned int']],
}],
  'rps_map': [ size : 0x18, {
    'len': [0x0, ['unsigned int']],
    'rcu': [0x8, ['callback_head']],
    'cpus': [0x18, ['array', 0, ['unsigned short']]],
}],
  'fasync_struct': [ size : 0x30, {
    'fa_lock': [0x0, ['spinlock']],
    'magic': [0x4, ['int']],
    'fa_fd': [0x8, ['int']],
    'fa_next': [0x10, ['pointer', ['fasync_struct']]],
    'fa_file': [0x18, ['pointer', ['file']]],
    'fa_rcu': [0x20, ['callback_head']],
}],
  'radix_tree_node': [ size : 0x240, {
    'path': [0x0, ['unsigned int']],
    'count': [0x4, ['unsigned int']],
    '__unnamed_0x8181': [0x8, ['__unnamed_0x81b3']],
    'private_list': [0x18, ['list_head']],
    'slots': [0x28, ['array', 64, ['pointer', ['void']]]],
    'tags': [0x228, ['array', 1, ['array', 3, ['unsigned long']]]],
}],
  'udp_hslot': [ size : 0x10, {
    'head': [0x0, ['hlist_nulls_head']],
    'count': [0x8, ['int']],
    'lock': [0xc, ['spinlock']],
}],
  'thread_struct': [ size : 0x1100, {
    'tls_array': [0x0, ['array', 3, ['desc_struct']]],
    'sp0': [0x18, ['unsigned long']],
    'sp': [0x20, ['unsigned long']],
    'es': [0x28, ['unsigned short']],
    'ds': [0x2a, ['unsigned short']],
    'fsindex': [0x2c, ['unsigned short']],
    'gsindex': [0x2e, ['unsigned short']],
    'fs': [0x30, ['unsigned long']],
    'gs': [0x38, ['unsigned long']],
    'ptrace_bps': [0x40, ['array', 4, ['pointer', ['perf_event']]]],
    'debugreg6': [0x60, ['unsigned long']],
    'ptrace_dr7': [0x68, ['unsigned long']],
    'cr2': [0x70, ['unsigned long']],
    'trap_nr': [0x78, ['unsigned long']],
    'error_code': [0x80, ['unsigned long']],
    'io_bitmap_ptr': [0x88, ['pointer', ['unsigned long']]],
    'iopl': [0x90, ['unsigned long']],
    'io_bitmap_max': [0x98, ['unsigned int']],
    'fpu': [0xc0, ['fpu']],
}],
  '__unnamed_0x5578': [ size : 0x18, {
    '__unnamed_0x5585': [0x0, ['__unnamed_0x5557']],
    '__unnamed_0x5580': [0x0, ['__unnamed_0x5536']],
}],
  'Qdisc_class_ops': [ size : 0x70, {
    'select_queue': [0x0, ['pointer', ['void']]],
    'graft': [0x8, ['pointer', ['void']]],
    'leaf': [0x10, ['pointer', ['void']]],
    'qlen_notify': [0x18, ['pointer', ['void']]],
    'get': [0x20, ['pointer', ['void']]],
    'put': [0x28, ['pointer', ['void']]],
    'change': [0x30, ['pointer', ['void']]],
    'delete': [0x38, ['pointer', ['void']]],
    'walk': [0x40, ['pointer', ['void']]],
    'tcf_chain': [0x48, ['pointer', ['void']]],
    'bind_tcf': [0x50, ['pointer', ['void']]],
    'unbind_tcf': [0x58, ['pointer', ['void']]],
    'dump': [0x60, ['pointer', ['void']]],
    'dump_stats': [0x68, ['pointer', ['void']]],
}],
  'gnet_stats_queue': [ size : 0x14, {
    'qlen': [0x0, ['unsigned int']],
    'backlog': [0x4, ['unsigned int']],
    'drops': [0x8, ['unsigned int']],
    'requeues': [0xc, ['unsigned int']],
    'overlimits': [0x10, ['unsigned int']],
}],
  'seqcount': [ size : 0x4, {
    'sequence': [0x0, ['unsigned int']],
}],
  'l3mdev_ops': [ size : 0x20, {
    'l3mdev_fib_table': [0x0, ['pointer', ['void']]],
    'l3mdev_get_rtable': [0x8, ['pointer', ['void']]],
    'l3mdev_get_saddr': [0x10, ['pointer', ['void']]],
    'l3mdev_get_rt6_dst': [0x18, ['pointer', ['void']]],
}],
  'tss_struct': [ size : 0x22c0, {
    'x86_tss': [0x0, ['x86_hw_tss']],
    'io_bitmap': [0x80, ['array', 1025, ['unsigned long']]],
    'SYSENTER_stack': [0x2088, ['array', 64, ['unsigned long']]],
}],
  'dcb_app': [ size : 0x4, {
    'selector': [0x0, ['unsigned char']],
    'priority': [0x1, ['unsigned char']],
    'protocol': [0x2, ['unsigned short']],
}],
  '__unnamed_0x1cab': [ size : 0x4, {
    'rlock': [0x0, ['raw_spinlock']],
}],
  'nf_ip_net': [ size : 0xe0, {
    'generic': [0x0, ['nf_generic_net']],
    'tcp': [0x20, ['nf_tcp_net']],
    'udp': [0x80, ['nf_udp_net']],
    'icmp': [0xa0, ['nf_icmp_net']],
    'icmpv6': [0xc0, ['nf_icmp_net']],
}],
  'pm_subsys_data': [ size : 0x18, {
    'lock': [0x0, ['spinlock']],
    'refcount': [0x4, ['unsigned int']],
    'clock_list': [0x8, ['list_head']],
}],
  '__unnamed_0xfe8b': [ size : 0x4, {
    'secmark': [0x0, ['unsigned int']],
}],
  'pv_cpu_ops': [ size : 0x128, {
    'get_debugreg': [0x0, ['pointer', ['void']]],
    'set_debugreg': [0x8, ['pointer', ['void']]],
    'clts': [0x10, ['pointer', ['void']]],
    'read_cr0': [0x18, ['pointer', ['void']]],
    'write_cr0': [0x20, ['pointer', ['void']]],
    'read_cr4_safe': [0x28, ['pointer', ['void']]],
    'read_cr4': [0x30, ['pointer', ['void']]],
    'write_cr4': [0x38, ['pointer', ['void']]],
    'read_cr8': [0x40, ['pointer', ['void']]],
    'write_cr8': [0x48, ['pointer', ['void']]],
    'load_tr_desc': [0x50, ['pointer', ['void']]],
    'load_gdt': [0x58, ['pointer', ['void']]],
    'load_idt': [0x60, ['pointer', ['void']]],
    'store_idt': [0x68, ['pointer', ['void']]],
    'set_ldt': [0x70, ['pointer', ['void']]],
    'store_tr': [0x78, ['pointer', ['void']]],
    'load_tls': [0x80, ['pointer', ['void']]],
    'load_gs_index': [0x88, ['pointer', ['void']]],
    'write_ldt_entry': [0x90, ['pointer', ['void']]],
    'write_gdt_entry': [0x98, ['pointer', ['void']]],
    'write_idt_entry': [0xa0, ['pointer', ['void']]],
    'alloc_ldt': [0xa8, ['pointer', ['void']]],
    'free_ldt': [0xb0, ['pointer', ['void']]],
    'load_sp0': [0xb8, ['pointer', ['void']]],
    'set_iopl_mask': [0xc0, ['pointer', ['void']]],
    'wbinvd': [0xc8, ['pointer', ['void']]],
    'io_delay': [0xd0, ['pointer', ['void']]],
    'cpuid': [0xd8, ['pointer', ['void']]],
    'read_msr': [0xe0, ['pointer', ['void']]],
    'write_msr': [0xe8, ['pointer', ['void']]],
    'read_pmc': [0xf0, ['pointer', ['void']]],
    'usergs_sysret64': [0xf8, ['pointer', ['void']]],
    'usergs_sysret32': [0x100, ['pointer', ['void']]],
    'iret': [0x108, ['pointer', ['void']]],
    'swapgs': [0x110, ['pointer', ['void']]],
    'start_context_switch': [0x118, ['pointer', ['void']]],
    'end_context_switch': [0x120, ['pointer', ['void']]],
}],
  'netdev_fcoe_hbainfo': [ size : 0x380, {
    'manufacturer': [0x0, ['array', 64, ['char']]],
    'serial_number': [0x40, ['array', 64, ['char']]],
    'hardware_version': [0x80, ['array', 64, ['char']]],
    'driver_version': [0xc0, ['array', 64, ['char']]],
    'optionrom_version': [0x100, ['array', 64, ['char']]],
    'firmware_version': [0x140, ['array', 64, ['char']]],
    'model': [0x180, ['array', 256, ['char']]],
    'model_description': [0x280, ['array', 256, ['char']]],
}],
  'sysv_shm': [ size : 0x10, {
    'shm_clist': [0x0, ['list_head']],
}],
  'hrtimer': [ size : 0x58, {
    'node': [0x0, ['timerqueue_node']],
    '_softexpires': [0x20, ['ktime']],
    'function': [0x28, ['pointer', ['void']]],
    'base': [0x30, ['pointer', ['hrtimer_clock_base']]],
    'state': [0x38, ['unsigned char']],
    'is_rel': [0x39, ['unsigned char']],
    'start_pid': [0x3c, ['int']],
    'start_site': [0x40, ['pointer', ['void']]],
    'start_comm': [0x48, ['array', 16, ['char']]],
}],
  'unix_address': [ size : 0xc, {
    'refcnt': [0x0, ['__unnamed_0x351']],
    'len': [0x4, ['int']],
    'hash': [0x8, ['unsigned int']],
    'name': [0xc, ['array', 0, ['sockaddr_un']]],
}],
  '__unnamed_0xb3de': [ size : 0x20, {
    '_addr': [0x0, ['pointer', ['void']]],
    '_addr_lsb': [0x8, ['short']],
    '_addr_bnd': [0x10, ['__unnamed_0xb3bd']],
}],
  'nf_conntrack': [ size : 0x4, {
    'use': [0x0, ['__unnamed_0x351']],
}],
  'proc_dir_entry': [ size : 0x88, {
    'low_ino': [0x0, ['unsigned int']],
    'mode': [0x4, ['unsigned short']],
    'nlink': [0x8, ['unsigned int']],
    'uid': [0xc, ['__unnamed_0x2c81']],
    'gid': [0x10, ['__unnamed_0x2ca1']],
    'size': [0x18, ['long long']],
    'proc_iops': [0x20, ['pointer', ['inode_operations']]],
    'proc_fops': [0x28, ['pointer', ['file_operations']]],
    'parent': [0x30, ['pointer', ['proc_dir_entry']]],
    'subdir': [0x38, ['rb_root']],
    'subdir_node': [0x40, ['rb_node']],
    'data': [0x58, ['pointer', ['void']]],
    'count': [0x60, ['__unnamed_0x351']],
    'in_use': [0x64, ['__unnamed_0x351']],
    'pde_unload_completion': [0x68, ['pointer', ['completion']]],
    'pde_openers': [0x70, ['list_head']],
    'pde_unload_lock': [0x80, ['spinlock']],
    'namelen': [0x84, ['unsigned char']],
    'name': [0x85, ['array', 0, ['char']]],
}],
  'apic': [ size : 0x118, {
    'name': [0x0, ['pointer', ['char']]],
    'probe': [0x8, ['pointer', ['void']]],
    'acpi_madt_oem_check': [0x10, ['pointer', ['void']]],
    'apic_id_valid': [0x18, ['pointer', ['void']]],
    'apic_id_registered': [0x20, ['pointer', ['void']]],
    'irq_delivery_mode': [0x28, ['unsigned int']],
    'irq_dest_mode': [0x2c, ['unsigned int']],
    'target_cpus': [0x30, ['pointer', ['void']]],
    'disable_esr': [0x38, ['int']],
    'dest_logical': [0x3c, ['int']],
    'check_apicid_used': [0x40, ['pointer', ['void']]],
    'vector_allocation_domain': [0x48, ['pointer', ['void']]],
    'init_apic_ldr': [0x50, ['pointer', ['void']]],
    'ioapic_phys_id_map': [0x58, ['pointer', ['void']]],
    'setup_apic_routing': [0x60, ['pointer', ['void']]],
    'cpu_present_to_apicid': [0x68, ['pointer', ['void']]],
    'apicid_to_cpu_present': [0x70, ['pointer', ['void']]],
    'check_phys_apicid_present': [0x78, ['pointer', ['void']]],
    'phys_pkg_id': [0x80, ['pointer', ['void']]],
    'get_apic_id': [0x88, ['pointer', ['void']]],
    'set_apic_id': [0x90, ['pointer', ['void']]],
    'apic_id_mask': [0x98, ['unsigned long']],
    'cpu_mask_to_apicid_and': [0xa0, ['pointer', ['void']]],
    'send_IPI_mask': [0xa8, ['pointer', ['void']]],
    'send_IPI_mask_allbutself': [0xb0, ['pointer', ['void']]],
    'send_IPI_allbutself': [0xb8, ['pointer', ['void']]],
    'send_IPI_all': [0xc0, ['pointer', ['void']]],
    'send_IPI_self': [0xc8, ['pointer', ['void']]],
    'wakeup_secondary_cpu': [0xd0, ['pointer', ['void']]],
    'inquire_remote_apic': [0xd8, ['pointer', ['void']]],
    'read': [0xe0, ['pointer', ['void']]],
    'write': [0xe8, ['pointer', ['void']]],
    'eoi_write': [0xf0, ['pointer', ['void']]],
    'icr_read': [0xf8, ['pointer', ['void']]],
    'icr_write': [0x100, ['pointer', ['void']]],
    'wait_icr_idle': [0x108, ['pointer', ['void']]],
    'safe_wait_icr_idle': [0x110, ['pointer', ['void']]],
}],
  'mod_arch_specific': [ size : 0x0, {
}],
  'elf64_sym': [ size : 0x18, {
    'st_name': [0x0, ['unsigned int']],
    'st_info': [0x4, ['unsigned char']],
    'st_other': [0x5, ['unsigned char']],
    'st_shndx': [0x6, ['unsigned short']],
    'st_value': [0x8, ['unsigned long long']],
    'st_size': [0x10, ['unsigned long long']],
}],
  'file_lock': [ size : 0xd0, {
    'fl_next': [0x0, ['pointer', ['file_lock']]],
    'fl_list': [0x8, ['list_head']],
    'fl_link': [0x18, ['hlist_node']],
    'fl_block': [0x28, ['list_head']],
    'fl_owner': [0x38, ['pointer', ['void']]],
    'fl_flags': [0x40, ['unsigned int']],
    'fl_type': [0x44, ['unsigned char']],
    'fl_pid': [0x48, ['unsigned int']],
    'fl_link_cpu': [0x4c, ['int']],
    'fl_nspid': [0x50, ['pointer', ['pid']]],
    'fl_wait': [0x58, ['__wait_queue_head']],
    'fl_file': [0x70, ['pointer', ['file']]],
    'fl_start': [0x78, ['long long']],
    'fl_end': [0x80, ['long long']],
    'fl_fasync': [0x88, ['pointer', ['fasync_struct']]],
    'fl_break_time': [0x90, ['unsigned long']],
    'fl_downgrade_time': [0x98, ['unsigned long']],
    'fl_ops': [0xa0, ['pointer', ['file_lock_operations']]],
    'fl_lmops': [0xa8, ['pointer', ['lock_manager_operations']]],
    'fl_u': [0xb0, ['__unnamed_0xa510']],
}],
  'file_system_type': [ size : 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'fs_flags': [0x8, ['int']],
    'mount': [0x10, ['pointer', ['void']]],
    'kill_sb': [0x18, ['pointer', ['void']]],
    'owner': [0x20, ['pointer', ['module']]],
    'next': [0x28, ['pointer', ['file_system_type']]],
    'fs_supers': [0x30, ['hlist_head']],
    'i_lock_key': [0x38, ['lock_class_key']],
    's_umount_key': [0x38, ['lock_class_key']],
    's_vfs_rename_key': [0x38, ['lock_class_key']],
    's_lock_key': [0x38, ['lock_class_key']],
    'i_mutex_key': [0x38, ['lock_class_key']],
    'i_mutex_dir_key': [0x38, ['lock_class_key']],
    's_writers_key': [0x38, ['array', 3, ['lock_class_key']]],
}],
  'rps_dev_flow_table': [ size : 0x18, {
    'mask': [0x0, ['unsigned int']],
    'rcu': [0x8, ['callback_head']],
    'flows': [0x18, ['array', 0, ['rps_dev_flow']]],
}],
  'percpu_rw_semaphore': [ size : 0x90, {
    'rss': [0x0, ['rcu_sync']],
    'fast_read_ctr': [0x40, ['pointer', ['unsigned int']]],
    'rw_sem': [0x48, ['rw_semaphore']],
    'slow_read_ctr': [0x70, ['__unnamed_0x351']],
    'write_waitq': [0x78, ['__wait_queue_head']],
}],
  '__unnamed_0xb42c': [ size : 0x10, {
    '_call_addr': [0x0, ['pointer', ['void']]],
    '_syscall': [0x8, ['int']],
    '_arch': [0xc, ['unsigned int']],
}],
  'ip6_sf_list': [ size : 0x30, {
    'sf_next': [0x0, ['pointer', ['ip6_sf_list']]],
    'sf_addr': [0x8, ['in6_addr']],
    'sf_count': [0x18, ['array', 2, ['unsigned long']]],
    'sf_gsresp': [0x28, ['unsigned char']],
    'sf_oldin': [0x29, ['unsigned char']],
    'sf_crcount': [0x2a, ['unsigned char']],
}],
  'pipe_buf_operations': [ size : 0x28, {
    'can_merge': [0x0, ['int']],
    'confirm': [0x8, ['pointer', ['void']]],
    'release': [0x10, ['pointer', ['void']]],
    'steal': [0x18, ['pointer', ['void']]],
    'get': [0x20, ['pointer', ['void']]],
}],
  '__unnamed_0xf1d0': [ size : 0x10, {
    'ipv6_daddr': [0x0, ['in6_addr']],
    'ipv4_daddr': [0x0, ['unsigned int']],
    'neigh_header': [0x0, ['array', 8, ['char']]],
}],
  'tasklet_struct': [ size : 0x28, {
    'next': [0x0, ['pointer', ['tasklet_struct']]],
    'state': [0x8, ['unsigned long']],
    'count': [0x10, ['__unnamed_0x351']],
    'func': [0x18, ['pointer', ['void']]],
    'data': [0x20, ['unsigned long']],
}],
  'percpu_counter': [ size : 0x28, {
    'lock': [0x0, ['raw_spinlock']],
    'count': [0x8, ['long long']],
    'list': [0x10, ['list_head']],
    'counters': [0x20, ['pointer', ['int']]],
}],
  '__unnamed_0xefc3': [ size : 0x4, {
    'dport': [0x0, ['unsigned short']],
    'sport': [0x2, ['unsigned short']],
}],
  'kthread_create_info': [ size : 0x50, {
    'threadfn': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['pointer', ['void']]],
    'node': [0x10, ['int']],
    'result': [0x18, ['pointer', ['task_struct']]],
    'done': [0x20, ['completion']],
    'list': [0x40, ['list_head']],
}],
  'sk_buff_head': [ size : 0x18, {
    'next': [0x0, ['pointer', ['sk_buff']]],
    'prev': [0x8, ['pointer', ['sk_buff']]],
    'qlen': [0x10, ['unsigned int']],
    'lock': [0x14, ['spinlock']],
}],
  'task_struct': [ size : 0x1ac0, {
    'state': [0x0, ['long']],
    'stack': [0x8, ['pointer', ['void']]],
    'usage': [0x10, ['__unnamed_0x351']],
    'flags': [0x14, ['unsigned int']],
    'ptrace': [0x18, ['unsigned int']],
    'wake_entry': [0x20, ['llist_node']],
    'on_cpu': [0x28, ['int']],
    'wakee_flips': [0x2c, ['unsigned int']],
    'wakee_flip_decay_ts': [0x30, ['unsigned long']],
    'last_wakee': [0x38, ['pointer', ['task_struct']]],
    'wake_cpu': [0x40, ['int']],
    'on_rq': [0x44, ['int']],
    'prio': [0x48, ['int']],
    'static_prio': [0x4c, ['int']],
    'normal_prio': [0x50, ['int']],
    'rt_priority': [0x54, ['unsigned int']],
    'sched_class': [0x58, ['pointer', ['sched_class']]],
    'se': [0x60, ['sched_entity']],
    'rt': [0x1e8, ['sched_rt_entity']],
    'sched_task_group': [0x218, ['pointer', ['task_group']]],
    'dl': [0x220, ['sched_dl_entity']],
    'preempt_notifiers': [0x2e0, ['hlist_head']],
    'btrace_seq': [0x2e8, ['unsigned int']],
    'policy': [0x2ec, ['unsigned int']],
    'nr_cpus_allowed': [0x2f0, ['int']],
    'cpus_allowed': [0x2f8, ['cpumask']],
    'sched_info': [0x338, ['sched_info']],
    'tasks': [0x358, ['list_head']],
    'pushable_tasks': [0x368, ['plist_node']],
    'pushable_dl_tasks': [0x390, ['rb_node']],
    'mm': [0x3a8, ['pointer', ['mm_struct']]],
    'active_mm': [0x3b0, ['pointer', ['mm_struct']]],
    'vmacache_seqnum': [0x3b8, ['unsigned int']],
    'vmacache': [0x3c0, ['array', 4, ['pointer', ['vm_area_struct']]]],
    'rss_stat': [0x3e0, ['task_rss_stat']],
    'exit_state': [0x3f0, ['int']],
    'exit_code': [0x3f4, ['int']],
    'exit_signal': [0x3f8, ['int']],
    'pdeath_signal': [0x3fc, ['int']],
    'jobctl': [0x400, ['unsigned long']],
    'personality': [0x408, ['unsigned int']],
    'sched_contributes_to_load': [0x40c, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'sched_migrated': [0x40c, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'sched_reset_on_fork': [0x40c, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'memcg_may_oom': [0x410, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'in_iowait': [0x410, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'in_execve': [0x410, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'no_cgroup_migration': [0x410, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'memcg_kmem_skip_account': [0x410, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'atomic_flags': [0x418, ['unsigned long']],
    'restart_block': [0x420, ['restart_block']],
    'pid': [0x450, ['int']],
    'tgid': [0x454, ['int']],
    'stack_canary': [0x458, ['unsigned long']],
    'real_parent': [0x460, ['pointer', ['task_struct']]],
    'parent': [0x468, ['pointer', ['task_struct']]],
    'children': [0x470, ['list_head']],
    'sibling': [0x480, ['list_head']],
    'group_leader': [0x490, ['pointer', ['task_struct']]],
    'ptraced': [0x498, ['list_head']],
    'ptrace_entry': [0x4a8, ['list_head']],
    'pids': [0x4b8, ['array', 3, ['pid_link']]],
    'thread_group': [0x500, ['list_head']],
    'thread_node': [0x510, ['list_head']],
    'vfork_done': [0x520, ['pointer', ['completion']]],
    'set_child_tid': [0x528, ['pointer', ['int']]],
    'clear_child_tid': [0x530, ['pointer', ['int']]],
    'utime': [0x538, ['unsigned long']],
    'stime': [0x540, ['unsigned long']],
    'utimescaled': [0x548, ['unsigned long']],
    'stimescaled': [0x550, ['unsigned long']],
    'gtime': [0x558, ['unsigned long']],
    'prev_cputime': [0x560, ['prev_cputime']],
    'nvcsw': [0x578, ['unsigned long']],
    'nivcsw': [0x580, ['unsigned long']],
    'start_time': [0x588, ['unsigned long long']],
    'real_start_time': [0x590, ['unsigned long long']],
    'min_flt': [0x598, ['unsigned long']],
    'maj_flt': [0x5a0, ['unsigned long']],
    'cputime_expires': [0x5a8, ['task_cputime']],
    'cpu_timers': [0x5c0, ['array', 3, ['list_head']]],
    'ptracer_cred': [0x5f0, ['pointer', ['cred']]],
    'real_cred': [0x5f8, ['pointer', ['cred']]],
    'cred': [0x600, ['pointer', ['cred']]],
    'comm': [0x608, ['array', 16, ['char']]],
    'nameidata': [0x618, ['pointer', ['nameidata']]],
    'sysvsem': [0x620, ['sysv_sem']],
    'sysvshm': [0x628, ['sysv_shm']],
    'last_switch_count': [0x638, ['unsigned long']],
    'fs': [0x640, ['pointer', ['fs_struct']]],
    'files': [0x648, ['pointer', ['files_struct']]],
    'nsproxy': [0x650, ['pointer', ['nsproxy']]],
    'signal': [0x658, ['pointer', ['signal_struct']]],
    'sighand': [0x660, ['pointer', ['sighand_struct']]],
    'blocked': [0x668, ['__unnamed_0xb250']],
    'real_blocked': [0x670, ['__unnamed_0xb250']],
    'saved_sigmask': [0x678, ['__unnamed_0xb250']],
    'pending': [0x680, ['sigpending']],
    'sas_ss_sp': [0x698, ['unsigned long']],
    'sas_ss_size': [0x6a0, ['unsigned long']],
    'task_works': [0x6a8, ['pointer', ['callback_head']]],
    'audit_context': [0x6b0, ['pointer', ['audit_context']]],
    'loginuid': [0x6b8, ['__unnamed_0x2c81']],
    'sessionid': [0x6bc, ['unsigned int']],
    'seccomp': [0x6c0, ['seccomp']],
    'parent_exec_id': [0x6d0, ['unsigned int']],
    'self_exec_id': [0x6d4, ['unsigned int']],
    'alloc_lock': [0x6d8, ['spinlock']],
    'pi_lock': [0x6dc, ['raw_spinlock']],
    'wake_q': [0x6e0, ['wake_q_node']],
    'pi_waiters': [0x6e8, ['rb_root']],
    'pi_waiters_leftmost': [0x6f0, ['pointer', ['rb_node']]],
    'pi_blocked_on': [0x6f8, ['pointer', ['rt_mutex_waiter']]],
    'journal_info': [0x700, ['pointer', ['void']]],
    'bio_list': [0x708, ['pointer', ['bio_list']]],
    'plug': [0x710, ['pointer', ['blk_plug']]],
    'reclaim_state': [0x718, ['pointer', ['reclaim_state']]],
    'backing_dev_info': [0x720, ['pointer', ['backing_dev_info']]],
    'io_context': [0x728, ['pointer', ['io_context']]],
    'ptrace_message': [0x730, ['unsigned long']],
    'last_siginfo': [0x738, ['pointer', ['siginfo']]],
    'ioac': [0x740, ['task_io_accounting']],
    'acct_rss_mem1': [0x778, ['unsigned long long']],
    'acct_vm_mem1': [0x780, ['unsigned long long']],
    'acct_timexpd': [0x788, ['unsigned long']],
    'mems_allowed': [0x790, ['__unnamed_0x2e17']],
    'mems_allowed_seq': [0x798, ['seqcount']],
    'cpuset_mem_spread_rotor': [0x79c, ['int']],
    'cpuset_slab_spread_rotor': [0x7a0, ['int']],
    'cgroups': [0x7a8, ['pointer', ['css_set']]],
    'cg_list': [0x7b0, ['list_head']],
    'robust_list': [0x7c0, ['pointer', ['robust_list_head']]],
    'compat_robust_list': [0x7c8, ['pointer', ['compat_robust_list_head']]],
    'pi_state_list': [0x7d0, ['list_head']],
    'pi_state_cache': [0x7e0, ['pointer', ['futex_pi_state']]],
    'perf_event_ctxp': [0x7e8, ['array', 2, ['pointer', ['perf_event_context']]]],
    'perf_event_mutex': [0x7f8, ['mutex']],
    'perf_event_list': [0x820, ['list_head']],
    'mempolicy': [0x830, ['pointer', ['mempolicy']]],
    'il_next': [0x838, ['short']],
    'pref_node_fork': [0x83a, ['short']],
    'numa_scan_seq': [0x83c, ['int']],
    'numa_scan_period': [0x840, ['unsigned int']],
    'numa_scan_period_max': [0x844, ['unsigned int']],
    'numa_preferred_nid': [0x848, ['int']],
    'numa_migrate_retry': [0x850, ['unsigned long']],
    'node_stamp': [0x858, ['unsigned long long']],
    'last_task_numa_placement': [0x860, ['unsigned long long']],
    'last_sum_exec_runtime': [0x868, ['unsigned long long']],
    'numa_work': [0x870, ['callback_head']],
    'numa_entry': [0x880, ['list_head']],
    'numa_group': [0x890, ['pointer', ['numa_group']]],
    'numa_faults': [0x898, ['pointer', ['unsigned long']]],
    'total_numa_faults': [0x8a0, ['unsigned long']],
    'numa_faults_locality': [0x8a8, ['array', 3, ['unsigned long']]],
    'numa_pages_migrated': [0x8c0, ['unsigned long']],
    'tlb_ubc': [0x8c8, ['tlbflush_unmap_batch']],
    'rcu': [0x910, ['callback_head']],
    'splice_pipe': [0x920, ['pointer', ['pipe_inode_info']]],
    'task_frag': [0x928, ['page_frag']],
    'delays': [0x938, ['pointer', ['task_delay_info']]],
    'nr_dirtied': [0x940, ['int']],
    'nr_dirtied_pause': [0x944, ['int']],
    'dirty_paused_when': [0x948, ['unsigned long']],
    'timer_slack_ns': [0x950, ['unsigned long']],
    'default_timer_slack_ns': [0x958, ['unsigned long']],
    'curr_ret_stack': [0x960, ['int']],
    'ret_stack': [0x968, ['pointer', ['ftrace_ret_stack']]],
    'ftrace_timestamp': [0x970, ['unsigned long long']],
    'trace_overrun': [0x978, ['__unnamed_0x351']],
    'tracing_graph_pause': [0x97c, ['__unnamed_0x351']],
    'trace': [0x980, ['unsigned long']],
    'trace_recursion': [0x988, ['unsigned long']],
    'memcg_in_oom': [0x990, ['pointer', ['mem_cgroup']]],
    'memcg_oom_gfp_mask': [0x998, ['unsigned int']],
    'memcg_oom_order': [0x99c, ['int']],
    'memcg_nr_pages_over_high': [0x9a0, ['unsigned int']],
    'utask': [0x9a8, ['pointer', ['uprobe_task']]],
    'sequential_io': [0x9b0, ['unsigned int']],
    'sequential_io_avg': [0x9b4, ['unsigned int']],
    'pagefault_disabled': [0x9b8, ['int']],
    'thread': [0x9c0, ['thread_struct']],
}],
  'ethtool_modinfo': [ size : 0x2c, {
    'cmd': [0x0, ['unsigned int']],
    'type': [0x4, ['unsigned int']],
    'eeprom_len': [0x8, ['unsigned int']],
    'reserved': [0xc, ['array', 8, ['unsigned int']]],
}],
  'ping_group_range': [ size : 0x10, {
    'lock': [0x0, ['__unnamed_0x2c51']],
    'range': [0x8, ['array', 2, ['__unnamed_0x2ca1']]],
}],
  '__unnamed_0x635': [ size : 0x8, {
    'pgd': [0x0, ['unsigned long']],
}],
  'rw_semaphore': [ size : 0x28, {
    'count': [0x0, ['long']],
    'wait_list': [0x8, ['list_head']],
    'wait_lock': [0x18, ['raw_spinlock']],
    'osq': [0x1c, ['optimistic_spin_queue']],
    'owner': [0x20, ['pointer', ['task_struct']]],
}],
  'tty_driver': [ size : 0xb8, {
    'magic': [0x0, ['int']],
    'kref': [0x4, ['kref']],
    'cdevs': [0x8, ['pointer', ['pointer', ['cdev']]]],
    'owner': [0x10, ['pointer', ['module']]],
    'driver_name': [0x18, ['pointer', ['char']]],
    'name': [0x20, ['pointer', ['char']]],
    'name_base': [0x28, ['int']],
    'major': [0x2c, ['int']],
    'minor_start': [0x30, ['int']],
    'num': [0x34, ['unsigned int']],
    'type': [0x38, ['short']],
    'subtype': [0x3a, ['short']],
    'init_termios': [0x3c, ['ktermios']],
    'flags': [0x68, ['unsigned long']],
    'proc_entry': [0x70, ['pointer', ['proc_dir_entry']]],
    'other': [0x78, ['pointer', ['tty_driver']]],
    'ttys': [0x80, ['pointer', ['pointer', ['tty_struct']]]],
    'ports': [0x88, ['pointer', ['pointer', ['tty_port']]]],
    'termios': [0x90, ['pointer', ['pointer', ['ktermios']]]],
    'driver_state': [0x98, ['pointer', ['void']]],
    'ops': [0xa0, ['pointer', ['tty_operations']]],
    'tty_drivers': [0xa8, ['list_head']],
}],
  '__unnamed_0x1852b': [ size : 0x20, {
    'slock': [0x0, ['spinlock']],
    'owned': [0x4, ['int']],
    'wq': [0x8, ['__wait_queue_head']],
}],
  'mod_tree_node': [ size : 0x38, {
    'mod': [0x0, ['pointer', ['module']]],
    'node': [0x8, ['latch_tree_node']],
}],
  'super_block': [ size : 0x640, {
    's_list': [0x0, ['list_head']],
    's_dev': [0x10, ['unsigned int']],
    's_blocksize_bits': [0x14, ['unsigned char']],
    's_blocksize': [0x18, ['unsigned long']],
    's_maxbytes': [0x20, ['long long']],
    's_type': [0x28, ['pointer', ['file_system_type']]],
    's_op': [0x30, ['pointer', ['super_operations']]],
    'dq_op': [0x38, ['pointer', ['dquot_operations']]],
    's_qcop': [0x40, ['pointer', ['quotactl_ops']]],
    's_export_op': [0x48, ['pointer', ['export_operations']]],
    's_flags': [0x50, ['unsigned long']],
    's_iflags': [0x58, ['unsigned long']],
    's_magic': [0x60, ['unsigned long']],
    's_root': [0x68, ['pointer', ['dentry']]],
    's_umount': [0x70, ['rw_semaphore']],
    's_count': [0x98, ['int']],
    's_active': [0x9c, ['__unnamed_0x351']],
    's_security': [0xa0, ['pointer', ['void']]],
    's_xattr': [0xa8, ['pointer', ['pointer', ['xattr_handler']]]],
    's_anon': [0xb0, ['hlist_bl_head']],
    's_mounts': [0xb8, ['list_head']],
    's_bdev': [0xc8, ['pointer', ['block_device']]],
    's_bdi': [0xd0, ['pointer', ['backing_dev_info']]],
    's_mtd': [0xd8, ['pointer', ['mtd_info']]],
    's_instances': [0xe0, ['hlist_node']],
    's_quota_types': [0xf0, ['unsigned int']],
    's_dquot': [0xf8, ['quota_info']],
    's_writers': [0x258, ['sb_writers']],
    's_id': [0x428, ['array', 32, ['char']]],
    's_uuid': [0x448, ['array', 16, ['unsigned char']]],
    's_fs_info': [0x458, ['pointer', ['void']]],
    's_max_links': [0x460, ['unsigned int']],
    's_mode': [0x464, ['unsigned int']],
    's_time_gran': [0x468, ['unsigned int']],
    's_vfs_rename_mutex': [0x470, ['mutex']],
    's_subtype': [0x498, ['pointer', ['char']]],
    's_options': [0x4a0, ['pointer', ['char']]],
    's_d_op': [0x4a8, ['pointer', ['dentry_operations']]],
    'cleancache_poolid': [0x4b0, ['int']],
    's_shrink': [0x4b8, ['shrinker']],
    's_remove_count': [0x4f8, ['__unnamed_0x371']],
    's_readonly_remount': [0x500, ['int']],
    's_dio_done_wq': [0x508, ['pointer', ['workqueue_struct']]],
    's_pins': [0x510, ['hlist_head']],
    's_user_ns': [0x518, ['pointer', ['user_namespace']]],
    's_dentry_lru': [0x540, ['list_lru']],
    's_inode_lru': [0x580, ['list_lru']],
    'rcu': [0x598, ['callback_head']],
    'destroy_work': [0x5a8, ['work_struct']],
    's_sync_lock': [0x5c8, ['mutex']],
    's_stack_depth': [0x5f0, ['int']],
    's_inode_list_lock': [0x600, ['spinlock']],
    's_inodes': [0x608, ['list_head']],
}],
  'inet6_dev': [ size : 0x320, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'addr_list': [0x8, ['list_head']],
    'mc_list': [0x18, ['pointer', ['ifmcaddr6']]],
    'mc_tomb': [0x20, ['pointer', ['ifmcaddr6']]],
    'mc_lock': [0x28, ['spinlock']],
    'mc_qrv': [0x2c, ['unsigned char']],
    'mc_gq_running': [0x2d, ['unsigned char']],
    'mc_ifc_count': [0x2e, ['unsigned char']],
    'mc_dad_count': [0x2f, ['unsigned char']],
    'mc_v1_seen': [0x30, ['unsigned long']],
    'mc_qi': [0x38, ['unsigned long']],
    'mc_qri': [0x40, ['unsigned long']],
    'mc_maxdelay': [0x48, ['unsigned long']],
    'mc_gq_timer': [0x50, ['timer_list']],
    'mc_ifc_timer': [0xa0, ['timer_list']],
    'mc_dad_timer': [0xf0, ['timer_list']],
    'ac_list': [0x140, ['pointer', ['ifacaddr6']]],
    'lock': [0x148, ['__unnamed_0x2b74']],
    'refcnt': [0x150, ['__unnamed_0x351']],
    'if_flags': [0x154, ['unsigned int']],
    'dead': [0x158, ['int']],
    'rndid': [0x15c, ['array', 8, ['unsigned char']]],
    'regen_timer': [0x168, ['timer_list']],
    'tempaddr_list': [0x1b8, ['list_head']],
    'token': [0x1c8, ['in6_addr']],
    'nd_parms': [0x1d8, ['pointer', ['neigh_parms']]],
    'cnf': [0x1e0, ['ipv6_devconf']],
    'stats': [0x290, ['ipv6_devstat']],
    'rs_timer': [0x2b0, ['timer_list']],
    'rs_probes': [0x300, ['unsigned char']],
    'addr_gen_mode': [0x301, ['unsigned char']],
    'tstamp': [0x308, ['unsigned long']],
    'rcu': [0x310, ['callback_head']],
}],
  'rtnl_link_stats64': [ size : 0xb8, {
    'rx_packets': [0x0, ['unsigned long long']],
    'tx_packets': [0x8, ['unsigned long long']],
    'rx_bytes': [0x10, ['unsigned long long']],
    'tx_bytes': [0x18, ['unsigned long long']],
    'rx_errors': [0x20, ['unsigned long long']],
    'tx_errors': [0x28, ['unsigned long long']],
    'rx_dropped': [0x30, ['unsigned long long']],
    'tx_dropped': [0x38, ['unsigned long long']],
    'multicast': [0x40, ['unsigned long long']],
    'collisions': [0x48, ['unsigned long long']],
    'rx_length_errors': [0x50, ['unsigned long long']],
    'rx_over_errors': [0x58, ['unsigned long long']],
    'rx_crc_errors': [0x60, ['unsigned long long']],
    'rx_frame_errors': [0x68, ['unsigned long long']],
    'rx_fifo_errors': [0x70, ['unsigned long long']],
    'rx_missed_errors': [0x78, ['unsigned long long']],
    'tx_aborted_errors': [0x80, ['unsigned long long']],
    'tx_carrier_errors': [0x88, ['unsigned long long']],
    'tx_fifo_errors': [0x90, ['unsigned long long']],
    'tx_heartbeat_errors': [0x98, ['unsigned long long']],
    'tx_window_errors': [0xa0, ['unsigned long long']],
    'rx_compressed': [0xa8, ['unsigned long long']],
    'tx_compressed': [0xb0, ['unsigned long long']],
}],
  '__unnamed_0x1be6': [ size : 0x30, {
    'gs_base': [0x0, ['array', 40, ['char']]],
    'stack_canary': [0x28, ['unsigned long']],
}],
  '__unnamed_0x19dc8': [ size : 0x10, {
    'gc_list': [0x0, ['list_head']],
    'gc_rcu': [0x0, ['callback_head']],
}],
  'device_driver': [ size : 0x78, {
    'name': [0x0, ['pointer', ['char']]],
    'bus': [0x8, ['pointer', ['bus_type']]],
    'owner': [0x10, ['pointer', ['module']]],
    'mod_name': [0x18, ['pointer', ['char']]],
    'suppress_bind_attrs': [0x20, ['unsigned char']],
    'probe_type': [0x24, ['Enumeration', {'target': 'int', 'choices': {0: 'PROBE_DEFAULT_STRATEGY', 1: 'PROBE_PREFER_ASYNCHRONOUS', 2: 'PROBE_FORCE_SYNCHRONOUS'}}]],
    'of_match_table': [0x28, ['pointer', ['of_device_id']]],
    'acpi_match_table': [0x30, ['pointer', ['acpi_device_id']]],
    'probe': [0x38, ['pointer', ['void']]],
    'remove': [0x40, ['pointer', ['void']]],
    'shutdown': [0x48, ['pointer', ['void']]],
    'suspend': [0x50, ['pointer', ['void']]],
    'resume': [0x58, ['pointer', ['void']]],
    'groups': [0x60, ['pointer', ['pointer', ['attribute_group']]]],
    'pm': [0x68, ['pointer', ['dev_pm_ops']]],
    'p': [0x70, ['pointer', ['driver_private']]],
}],
  '__unnamed_0x101d0': [ size : 0xc, {
    'clock_rate': [0x0, ['unsigned int']],
    'clock_type': [0x4, ['unsigned int']],
    'loopback': [0x8, ['unsigned short']],
}],
  'file_ra_state': [ size : 0x20, {
    'start': [0x0, ['unsigned long']],
    'size': [0x8, ['unsigned int']],
    'async_size': [0xc, ['unsigned int']],
    'ra_pages': [0x10, ['unsigned int']],
    'mmap_miss': [0x14, ['unsigned int']],
    'prev_pos': [0x18, ['long long']],
}],
  '__unnamed_0xb2d6': [ size : 0x8, {
    '_pid': [0x0, ['int']],
    '_uid': [0x4, ['unsigned int']],
}],
  '__unnamed_0x186a7': [ size : 0x10, {
    'skc_nulls_node': [0x0, ['hlist_nulls_node']],
    'skc_node': [0x0, ['hlist_node']],
}],
  'sock': [ size : 0x2c0, {
    '__sk_common': [0x0, ['sock_common']],
    'sk_lock': [0x88, ['__unnamed_0x1852b']],
    'sk_receive_queue': [0xa8, ['sk_buff_head']],
    'sk_backlog': [0xc0, ['__unnamed_0x18ad9']],
    'sk_forward_alloc': [0xd8, ['int']],
    'sk_txhash': [0xdc, ['unsigned int']],
    'sk_napi_id': [0xe0, ['unsigned int']],
    'sk_ll_usec': [0xe4, ['unsigned int']],
    'sk_drops': [0xe8, ['__unnamed_0x351']],
    'sk_rcvbuf': [0xec, ['int']],
    'sk_filter': [0xf0, ['pointer', ['sk_filter']]],
    '__unnamed_0x68a8': [0xf8, ['__unnamed_0x18b17']],
    'sk_policy': [0x100, ['array', 2, ['pointer', ['xfrm_policy']]]],
    'sk_rx_dst': [0x110, ['pointer', ['dst_entry']]],
    'sk_dst_cache': [0x118, ['pointer', ['dst_entry']]],
    'sk_wmem_alloc': [0x120, ['__unnamed_0x351']],
    'sk_omem_alloc': [0x124, ['__unnamed_0x351']],
    'sk_sndbuf': [0x128, ['int']],
    'sk_write_queue': [0x130, ['sk_buff_head']],
    'sk_dst_pending_confirm': [0x148, ['unsigned int']],
    'sk_userlocks': [0x14c, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'sk_protocol': [0x14c, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'sk_shutdown': [0x14c, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'sk_type': [0x14c, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'sk_no_check_rx': [0x14c, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'sk_no_check_tx': [0x14c, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'sk_wmem_queued': [0x150, ['int']],
    'sk_allocation': [0x154, ['unsigned int']],
    'sk_pacing_rate': [0x158, ['unsigned int']],
    'sk_max_pacing_rate': [0x15c, ['unsigned int']],
    'sk_route_caps': [0x160, ['unsigned long long']],
    'sk_route_nocaps': [0x168, ['unsigned long long']],
    'sk_gso_type': [0x170, ['int']],
    'sk_gso_max_size': [0x174, ['unsigned int']],
    'sk_gso_max_segs': [0x178, ['unsigned short']],
    'sk_rcvlowat': [0x17c, ['int']],
    'sk_lingertime': [0x180, ['unsigned long']],
    'sk_error_queue': [0x188, ['sk_buff_head']],
    'sk_prot_creator': [0x1a0, ['pointer', ['proto']]],
    'sk_callback_lock': [0x1a8, ['__unnamed_0x2b74']],
    'sk_err': [0x1b0, ['int']],
    'sk_err_soft': [0x1b4, ['int']],
    'sk_ack_backlog': [0x1b8, ['unsigned int']],
    'sk_max_ack_backlog': [0x1bc, ['unsigned int']],
    'sk_priority': [0x1c0, ['unsigned int']],
    'sk_cgrp_prioidx': [0x1c4, ['unsigned int']],
    'sk_peer_pid': [0x1c8, ['pointer', ['pid']]],
    'sk_peer_cred': [0x1d0, ['pointer', ['cred']]],
    'sk_rcvtimeo': [0x1d8, ['long']],
    'sk_sndtimeo': [0x1e0, ['long']],
    'sk_timer': [0x1e8, ['timer_list']],
    'sk_stamp': [0x238, ['ktime']],
    'sk_tsflags': [0x240, ['unsigned short']],
    'sk_tskey': [0x244, ['unsigned int']],
    'sk_socket': [0x248, ['pointer', ['socket']]],
    'sk_user_data': [0x250, ['pointer', ['void']]],
    'sk_frag': [0x258, ['page_frag']],
    'sk_send_head': [0x268, ['pointer', ['sk_buff']]],
    'sk_peek_off': [0x270, ['int']],
    'sk_write_pending': [0x274, ['int']],
    'sk_security': [0x278, ['pointer', ['void']]],
    'sk_mark': [0x280, ['unsigned int']],
    'sk_classid': [0x284, ['unsigned int']],
    'sk_cgrp': [0x288, ['pointer', ['cg_proto']]],
    'sk_state_change': [0x290, ['pointer', ['void']]],
    'sk_data_ready': [0x298, ['pointer', ['void']]],
    'sk_write_space': [0x2a0, ['pointer', ['void']]],
    'sk_error_report': [0x2a8, ['pointer', ['void']]],
    'sk_backlog_rcv': [0x2b0, ['pointer', ['void']]],
    'sk_destruct': [0x2b8, ['pointer', ['void']]],
}],
  'bug_entry': [ size : 0xc, {
    'bug_addr_disp': [0x0, ['int']],
    'file_disp': [0x4, ['int']],
    'line': [0x8, ['unsigned short']],
    'flags': [0xa, ['unsigned short']],
}],
  'cpu_itimer': [ size : 0x18, {
    'expires': [0x0, ['unsigned long']],
    'incr': [0x8, ['unsigned long']],
    'error': [0x10, ['unsigned int']],
    'incr_error': [0x14, ['unsigned int']],
}],
  'qc_type_state': [ size : 0x38, {
    'flags': [0x0, ['unsigned int']],
    'spc_timelimit': [0x4, ['unsigned int']],
    'ino_timelimit': [0x8, ['unsigned int']],
    'rt_spc_timelimit': [0xc, ['unsigned int']],
    'spc_warnlimit': [0x10, ['unsigned int']],
    'ino_warnlimit': [0x14, ['unsigned int']],
    'rt_spc_warnlimit': [0x18, ['unsigned int']],
    'ino': [0x20, ['unsigned long long']],
    'blocks': [0x28, ['unsigned long']],
    'nextents': [0x30, ['unsigned long']],
}],
  'fs_struct': [ size : 0x38, {
    'users': [0x0, ['int']],
    'lock': [0x4, ['spinlock']],
    'seq': [0x8, ['seqcount']],
    'umask': [0xc, ['int']],
    'in_exec': [0x10, ['int']],
    'root': [0x18, ['path']],
    'pwd': [0x28, ['path']],
}],
  'pidmap': [ size : 0x10, {
    'nr_free': [0x0, ['__unnamed_0x351']],
    'page': [0x8, ['pointer', ['void']]],
}],
  'bdi_writeback': [ size : 0x2d0, {
    'bdi': [0x0, ['pointer', ['backing_dev_info']]],
    'state': [0x8, ['unsigned long']],
    'last_old_flush': [0x10, ['unsigned long']],
    'b_dirty': [0x18, ['list_head']],
    'b_io': [0x28, ['list_head']],
    'b_more_io': [0x38, ['list_head']],
    'b_dirty_time': [0x48, ['list_head']],
    'list_lock': [0x58, ['spinlock']],
    'stat': [0x60, ['array', 4, ['percpu_counter']]],
    'congested': [0x100, ['pointer', ['bdi_writeback_congested']]],
    'bw_time_stamp': [0x108, ['unsigned long']],
    'dirtied_stamp': [0x110, ['unsigned long']],
    'written_stamp': [0x118, ['unsigned long']],
    'write_bandwidth': [0x120, ['unsigned long']],
    'avg_write_bandwidth': [0x128, ['unsigned long']],
    'dirty_ratelimit': [0x130, ['unsigned long']],
    'balanced_dirty_ratelimit': [0x138, ['unsigned long']],
    'completions': [0x140, ['fprop_local_percpu']],
    'dirty_exceeded': [0x170, ['int']],
    'work_lock': [0x174, ['spinlock']],
    'work_list': [0x178, ['list_head']],
    'dwork': [0x188, ['delayed_work']],
    'bdi_node': [0x208, ['list_head']],
    'refcnt': [0x218, ['percpu_ref']],
    'memcg_completions': [0x250, ['fprop_local_percpu']],
    'memcg_css': [0x280, ['pointer', ['cgroup_subsys_state']]],
    'blkcg_css': [0x288, ['pointer', ['cgroup_subsys_state']]],
    'memcg_node': [0x290, ['list_head']],
    'blkcg_node': [0x2a0, ['list_head']],
    '__unnamed_0x9f2a': [0x2b0, ['__unnamed_0x16ebc']],
}],
  'ethtool_eeprom': [ size : 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'magic': [0x4, ['unsigned int']],
    'offset': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['unsigned char']]],
}],
  'kernfs_elem_dir': [ size : 0x18, {
    'subdirs': [0x0, ['unsigned long']],
    'children': [0x8, ['rb_root']],
    'root': [0x10, ['pointer', ['kernfs_root']]],
}],
  'uprobe_task': [ size : 0x40, {
    'state': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'UTASK_RUNNING', 1: 'UTASK_SSTEP', 2: 'UTASK_SSTEP_ACK', 3: 'UTASK_SSTEP_TRAPPED'}}]],
    '__unnamed_0x55a3': [0x8, ['__unnamed_0x5578']],
    'active_uprobe': [0x20, ['pointer', ['uprobe']]],
    'xol_vaddr': [0x28, ['unsigned long']],
    'return_instances': [0x30, ['pointer', ['return_instance']]],
    'depth': [0x38, ['unsigned int']],
}],
  'ip6_sf_socklist': [ size : 0x8, {
    'sl_max': [0x0, ['unsigned int']],
    'sl_count': [0x4, ['unsigned int']],
    'sl_addr': [0x8, ['array', 0, ['in6_addr']]],
}],
  'flowidn': [ size : 0x28, {
    '__fl_common': [0x0, ['flowi_common']],
    'daddr': [0x20, ['unsigned short']],
    'saddr': [0x22, ['unsigned short']],
    'uli': [0x24, ['flowi_uli']],
}],
  'ipv6_opt_hdr': [ size : 0x2, {
    'nexthdr': [0x0, ['unsigned char']],
    'hdrlen': [0x1, ['unsigned char']],
}],
  '__unnamed_0x2c81': [ size : 0x4, {
    'val': [0x0, ['unsigned int']],
}],
  'netdev_tc_txq': [ size : 0x4, {
    'count': [0x0, ['unsigned short']],
    'offset': [0x2, ['unsigned short']],
}],
  'rcu_sync': [ size : 0x40, {
    'gp_state': [0x0, ['int']],
    'gp_count': [0x4, ['int']],
    'gp_wait': [0x8, ['__wait_queue_head']],
    'cb_state': [0x20, ['int']],
    'cb_head': [0x28, ['callback_head']],
    'gp_type': [0x38, ['Enumeration', {'target': 'int', 'choices': {0: 'RCU_SYNC', 1: 'RCU_SCHED_SYNC', 2: 'RCU_BH_SYNC'}}]],
}],
  'netns_ipv6': [ size : 0x300, {
    'sysctl': [0x0, ['netns_sysctl_ipv6']],
    'devconf_all': [0x70, ['pointer', ['ipv6_devconf']]],
    'devconf_dflt': [0x78, ['pointer', ['ipv6_devconf']]],
    'peers': [0x80, ['pointer', ['inet_peer_base']]],
    'frags': [0xc0, ['netns_frags']],
    'ip6table_filter': [0x100, ['pointer', ['xt_table']]],
    'ip6table_mangle': [0x108, ['pointer', ['xt_table']]],
    'ip6table_raw': [0x110, ['pointer', ['xt_table']]],
    'ip6table_security': [0x118, ['pointer', ['xt_table']]],
    'ip6table_nat': [0x120, ['pointer', ['xt_table']]],
    'ip6_null_entry': [0x128, ['pointer', ['rt6_info']]],
    'rt6_stats': [0x130, ['pointer', ['rt6_statistics']]],
    'ip6_fib_timer': [0x138, ['timer_list']],
    'fib_table_hash': [0x188, ['pointer', ['hlist_head']]],
    'fib6_main_tbl': [0x190, ['pointer', ['fib6_table']]],
    'ip6_dst_ops': [0x1c0, ['dst_ops']],
    'ip6_rt_gc_expire': [0x280, ['unsigned int']],
    'ip6_rt_last_gc': [0x288, ['unsigned long']],
    'ip6_prohibit_entry': [0x290, ['pointer', ['rt6_info']]],
    'ip6_blk_hole_entry': [0x298, ['pointer', ['rt6_info']]],
    'fib6_local_tbl': [0x2a0, ['pointer', ['fib6_table']]],
    'fib6_rules_ops': [0x2a8, ['pointer', ['fib_rules_ops']]],
    'icmp_sk': [0x2b0, ['pointer', ['pointer', ['sock']]]],
    'ndisc_sk': [0x2b8, ['pointer', ['sock']]],
    'tcp_sk': [0x2c0, ['pointer', ['sock']]],
    'igmp_sk': [0x2c8, ['pointer', ['sock']]],
    'mc_autojoin_sk': [0x2d0, ['pointer', ['sock']]],
    'mr6_tables': [0x2d8, ['list_head']],
    'mr6_rules_ops': [0x2e8, ['pointer', ['fib_rules_ops']]],
    'dev_addr_genid': [0x2f0, ['__unnamed_0x351']],
    'fib6_sernum': [0x2f4, ['__unnamed_0x351']],
}],
  '__unnamed_0x17046': [ size : 0x10, {
    '__rcu_head': [0x0, ['callback_head']],
    'ioc_node': [0x0, ['hlist_node']],
}],
  'netns_ipv4': [ size : 0x1c0, {
    'forw_hdr': [0x0, ['pointer', ['ctl_table_header']]],
    'frags_hdr': [0x8, ['pointer', ['ctl_table_header']]],
    'ipv4_hdr': [0x10, ['pointer', ['ctl_table_header']]],
    'route_hdr': [0x18, ['pointer', ['ctl_table_header']]],
    'xfrm4_hdr': [0x20, ['pointer', ['ctl_table_header']]],
    'devconf_all': [0x28, ['pointer', ['ipv4_devconf']]],
    'devconf_dflt': [0x30, ['pointer', ['ipv4_devconf']]],
    'rules_ops': [0x38, ['pointer', ['fib_rules_ops']]],
    'fib_has_custom_rules': [0x40, ['unsigned char']],
    'fib_local': [0x48, ['pointer', ['fib_table']]],
    'fib_main': [0x50, ['pointer', ['fib_table']]],
    'fib_default': [0x58, ['pointer', ['fib_table']]],
    'fib_num_tclassid_users': [0x60, ['int']],
    'fib_table_hash': [0x68, ['pointer', ['hlist_head']]],
    'fib_offload_disabled': [0x70, ['unsigned char']],
    'fibnl': [0x78, ['pointer', ['sock']]],
    'icmp_sk': [0x80, ['pointer', ['pointer', ['sock']]]],
    'mc_autojoin_sk': [0x88, ['pointer', ['sock']]],
    'peers': [0x90, ['pointer', ['inet_peer_base']]],
    'tcp_sk': [0x98, ['pointer', ['pointer', ['sock']]]],
    'frags': [0xc0, ['netns_frags']],
    'iptable_filter': [0x100, ['pointer', ['xt_table']]],
    'iptable_mangle': [0x108, ['pointer', ['xt_table']]],
    'iptable_raw': [0x110, ['pointer', ['xt_table']]],
    'arptable_filter': [0x118, ['pointer', ['xt_table']]],
    'iptable_security': [0x120, ['pointer', ['xt_table']]],
    'nat_table': [0x128, ['pointer', ['xt_table']]],
    'sysctl_icmp_echo_ignore_all': [0x130, ['int']],
    'sysctl_icmp_echo_ignore_broadcasts': [0x134, ['int']],
    'sysctl_icmp_ignore_bogus_error_responses': [0x138, ['int']],
    'sysctl_icmp_ratelimit': [0x13c, ['int']],
    'sysctl_icmp_ratemask': [0x140, ['int']],
    'sysctl_icmp_errors_use_inbound_ifaddr': [0x144, ['int']],
    'ip_local_ports': [0x148, ['local_ports']],
    'sysctl_tcp_ecn': [0x15c, ['int']],
    'sysctl_tcp_ecn_fallback': [0x160, ['int']],
    'sysctl_ip_no_pmtu_disc': [0x164, ['int']],
    'sysctl_ip_fwd_use_pmtu': [0x168, ['int']],
    'sysctl_ip_nonlocal_bind': [0x16c, ['int']],
    'sysctl_fwmark_reflect': [0x170, ['int']],
    'sysctl_tcp_fwmark_accept': [0x174, ['int']],
    'sysctl_tcp_mtu_probing': [0x178, ['int']],
    'sysctl_tcp_base_mss': [0x17c, ['int']],
    'sysctl_tcp_probe_threshold': [0x180, ['int']],
    'sysctl_tcp_probe_interval': [0x184, ['unsigned int']],
    'ping_group_range': [0x188, ['ping_group_range']],
    'dev_addr_genid': [0x198, ['__unnamed_0x351']],
    'sysctl_local_reserved_ports': [0x1a0, ['pointer', ['unsigned long']]],
    'mrt': [0x1a8, ['pointer', ['mr_table']]],
    'rt_genid': [0x1b0, ['__unnamed_0x351']],
}],
  'gnet_stats_basic_cpu': [ size : 0xc, {
    'bstats': [0x0, ['gnet_stats_basic_packed']],
    'syncp': [0xc, ['u64_stats_sync']],
}],
  'shrink_control': [ size : 0x20, {
    'gfp_mask': [0x0, ['unsigned int']],
    'nr_to_scan': [0x8, ['unsigned long']],
    'nid': [0x10, ['int']],
    'memcg': [0x18, ['pointer', ['mem_cgroup']]],
}],
  'ieee_pfc': [ size : 0x88, {
    'pfc_cap': [0x0, ['unsigned char']],
    'pfc_en': [0x1, ['unsigned char']],
    'mbc': [0x2, ['unsigned char']],
    'delay': [0x4, ['unsigned short']],
    'requests': [0x8, ['array', 8, ['unsigned long long']]],
    'indications': [0x48, ['array', 8, ['unsigned long long']]],
}],
  'sg_table': [ size : 0x10, {
    'sgl': [0x0, ['pointer', ['scatterlist']]],
    'nents': [0x8, ['unsigned int']],
    'orig_nents': [0xc, ['unsigned int']],
}],
  'of_device_id': [ size : 0xc8, {
    'name': [0x0, ['array', 32, ['char']]],
    'type': [0x20, ['array', 32, ['char']]],
    'compatible': [0x40, ['array', 128, ['char']]],
    'data': [0xc0, ['pointer', ['void']]],
}],
  '__unnamed_0x5536': [ size : 0x18, {
    'autask': [0x0, ['arch_uprobe_task']],
    'vaddr': [0x10, ['unsigned long']],
}],
  'cee_pg': [ size : 0x14, {
    'willing': [0x0, ['unsigned char']],
    'error': [0x1, ['unsigned char']],
    'pg_en': [0x2, ['unsigned char']],
    'tcs_supported': [0x3, ['unsigned char']],
    'pg_bw': [0x4, ['array', 8, ['unsigned char']]],
    'prio_pg': [0xc, ['array', 8, ['unsigned char']]],
}],
  'sockaddr_un': [ size : 0x6e, {
    'sun_family': [0x0, ['unsigned short']],
    'sun_path': [0x2, ['array', 108, ['char']]],
}],
  'xstate_header': [ size : 0x40, {
    'xfeatures': [0x0, ['unsigned long long']],
    'xcomp_bv': [0x8, ['unsigned long long']],
    'reserved': [0x10, ['array', 6, ['unsigned long long']]],
}],
  'ethtool_ops': [ size : 0x198, {
    'get_settings': [0x0, ['pointer', ['void']]],
    'set_settings': [0x8, ['pointer', ['void']]],
    'get_drvinfo': [0x10, ['pointer', ['void']]],
    'get_regs_len': [0x18, ['pointer', ['void']]],
    'get_regs': [0x20, ['pointer', ['void']]],
    'get_wol': [0x28, ['pointer', ['void']]],
    'set_wol': [0x30, ['pointer', ['void']]],
    'get_msglevel': [0x38, ['pointer', ['void']]],
    'set_msglevel': [0x40, ['pointer', ['void']]],
    'nway_reset': [0x48, ['pointer', ['void']]],
    'get_link': [0x50, ['pointer', ['void']]],
    'get_eeprom_len': [0x58, ['pointer', ['void']]],
    'get_eeprom': [0x60, ['pointer', ['void']]],
    'set_eeprom': [0x68, ['pointer', ['void']]],
    'get_coalesce': [0x70, ['pointer', ['void']]],
    'set_coalesce': [0x78, ['pointer', ['void']]],
    'get_ringparam': [0x80, ['pointer', ['void']]],
    'set_ringparam': [0x88, ['pointer', ['void']]],
    'get_pauseparam': [0x90, ['pointer', ['void']]],
    'set_pauseparam': [0x98, ['pointer', ['void']]],
    'self_test': [0xa0, ['pointer', ['void']]],
    'get_strings': [0xa8, ['pointer', ['void']]],
    'set_phys_id': [0xb0, ['pointer', ['void']]],
    'get_ethtool_stats': [0xb8, ['pointer', ['void']]],
    'begin': [0xc0, ['pointer', ['void']]],
    'complete': [0xc8, ['pointer', ['void']]],
    'get_priv_flags': [0xd0, ['pointer', ['void']]],
    'set_priv_flags': [0xd8, ['pointer', ['void']]],
    'get_sset_count': [0xe0, ['pointer', ['void']]],
    'get_rxnfc': [0xe8, ['pointer', ['void']]],
    'set_rxnfc': [0xf0, ['pointer', ['void']]],
    'flash_device': [0xf8, ['pointer', ['void']]],
    'reset': [0x100, ['pointer', ['void']]],
    'get_rxfh_key_size': [0x108, ['pointer', ['void']]],
    'get_rxfh_indir_size': [0x110, ['pointer', ['void']]],
    'get_rxfh': [0x118, ['pointer', ['void']]],
    'set_rxfh': [0x120, ['pointer', ['void']]],
    'get_channels': [0x128, ['pointer', ['void']]],
    'set_channels': [0x130, ['pointer', ['void']]],
    'get_dump_flag': [0x138, ['pointer', ['void']]],
    'get_dump_data': [0x140, ['pointer', ['void']]],
    'set_dump': [0x148, ['pointer', ['void']]],
    'get_ts_info': [0x150, ['pointer', ['void']]],
    'get_module_info': [0x158, ['pointer', ['void']]],
    'get_module_eeprom': [0x160, ['pointer', ['void']]],
    'get_eee': [0x168, ['pointer', ['void']]],
    'set_eee': [0x170, ['pointer', ['void']]],
    'get_tunable': [0x178, ['pointer', ['void']]],
    'set_tunable': [0x180, ['pointer', ['void']]],
    'get_link_ksettings': [0x188, ['pointer', ['void']]],
    'set_link_ksettings': [0x190, ['pointer', ['void']]],
}],
  '__unnamed_0x77d5': [ size : 0x8, {
    '__unnamed_0x77dd': [0x0, ['__unnamed_0x77b4']],
    'hash_len': [0x0, ['unsigned long long']],
}],
  'inet_peer_base': [ size : 0x18, {
    'root': [0x0, ['pointer', ['inet_peer']]],
    'lock': [0x8, ['__unnamed_0x2c51']],
    'total': [0x10, ['int']],
}],
  'dquot_operations': [ size : 0x48, {
    'write_dquot': [0x0, ['pointer', ['void']]],
    'alloc_dquot': [0x8, ['pointer', ['void']]],
    'destroy_dquot': [0x10, ['pointer', ['void']]],
    'acquire_dquot': [0x18, ['pointer', ['void']]],
    'release_dquot': [0x20, ['pointer', ['void']]],
    'mark_dirty': [0x28, ['pointer', ['void']]],
    'write_info': [0x30, ['pointer', ['void']]],
    'get_reserved_space': [0x38, ['pointer', ['void']]],
    'get_projid': [0x40, ['pointer', ['void']]],
}],
  'mpc_bus': [ size : 0x8, {
    'type': [0x0, ['unsigned char']],
    'busid': [0x1, ['unsigned char']],
    'bustype': [0x2, ['array', 6, ['unsigned char']]],
}],
  'pv_time_ops': [ size : 0x10, {
    'sched_clock': [0x0, ['pointer', ['void']]],
    'steal_clock': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x18ad9': [ size : 0x18, {
    'rmem_alloc': [0x0, ['__unnamed_0x351']],
    'len': [0x4, ['int']],
    'head': [0x8, ['pointer', ['sk_buff']]],
    'tail': [0x10, ['pointer', ['sk_buff']]],
}],
  'udp_seq_afinfo': [ size : 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'family': [0x8, ['unsigned short']],
    'udp_table': [0x10, ['pointer', ['udp_table']]],
    'seq_fops': [0x18, ['pointer', ['file_operations']]],
    'seq_ops': [0x20, ['seq_operations']],
}],
  'delayed_work': [ size : 0x80, {
    'work': [0x0, ['work_struct']],
    'timer': [0x20, ['timer_list']],
    'wq': [0x70, ['pointer', ['workqueue_struct']]],
    'cpu': [0x78, ['int']],
}],
  'nf_hook_state': [ size : 0x40, {
    'hook': [0x0, ['unsigned int']],
    'thresh': [0x4, ['int']],
    'pf': [0x8, ['unsigned char']],
    'in': [0x10, ['pointer', ['net_device']]],
    'out': [0x18, ['pointer', ['net_device']]],
    'sk': [0x20, ['pointer', ['sock']]],
    'net': [0x28, ['pointer', ['net']]],
    'hook_list': [0x30, ['pointer', ['list_head']]],
    'okfn': [0x38, ['pointer', ['void']]],
}],
  'nf_tcp_net': [ size : 0x60, {
    'pn': [0x0, ['nf_proto_net']],
    'timeouts': [0x18, ['array', 14, ['unsigned int']]],
    'tcp_loose': [0x50, ['unsigned int']],
    'tcp_be_liberal': [0x54, ['unsigned int']],
    'tcp_max_retrans': [0x58, ['unsigned int']],
}],
  'module_sect_attr': [ size : 0x48, {
    'mattr': [0x0, ['module_attribute']],
    'name': [0x38, ['pointer', ['char']]],
    'address': [0x40, ['unsigned long']],
}],
  'ethtool_regs': [ size : 0xc, {
    'cmd': [0x0, ['unsigned int']],
    'version': [0x4, ['unsigned int']],
    'len': [0x8, ['unsigned int']],
    'data': [0xc, ['array', 0, ['unsigned char']]],
}],
  'tcmsg': [ size : 0x14, {
    'tcm_family': [0x0, ['unsigned char']],
    'tcm__pad1': [0x1, ['unsigned char']],
    'tcm__pad2': [0x2, ['unsigned short']],
    'tcm_ifindex': [0x4, ['int']],
    'tcm_handle': [0x8, ['unsigned int']],
    'tcm_parent': [0xc, ['unsigned int']],
    'tcm_info': [0x10, ['unsigned int']],
}],
  'ctl_table_header': [ size : 0x48, {
    '__unnamed_0x3969': [0x0, ['__unnamed_0x39f7']],
    'unregistering': [0x18, ['pointer', ['completion']]],
    'ctl_table_arg': [0x20, ['pointer', ['ctl_table']]],
    'root': [0x28, ['pointer', ['ctl_table_root']]],
    'set': [0x30, ['pointer', ['ctl_table_set']]],
    'parent': [0x38, ['pointer', ['ctl_dir']]],
    'node': [0x40, ['pointer', ['ctl_node']]],
}],
  'inode_operations': [ size : 0x100, {
    'lookup': [0x0, ['pointer', ['void']]],
    'follow_link': [0x8, ['pointer', ['void']]],
    'permission': [0x10, ['pointer', ['void']]],
    'get_acl': [0x18, ['pointer', ['void']]],
    'readlink': [0x20, ['pointer', ['void']]],
    'put_link': [0x28, ['pointer', ['void']]],
    'create': [0x30, ['pointer', ['void']]],
    'link': [0x38, ['pointer', ['void']]],
    'unlink': [0x40, ['pointer', ['void']]],
    'symlink': [0x48, ['pointer', ['void']]],
    'mkdir': [0x50, ['pointer', ['void']]],
    'rmdir': [0x58, ['pointer', ['void']]],
    'mknod': [0x60, ['pointer', ['void']]],
    'rename': [0x68, ['pointer', ['void']]],
    'rename2': [0x70, ['pointer', ['void']]],
    'setattr': [0x78, ['pointer', ['void']]],
    'getattr': [0x80, ['pointer', ['void']]],
    'setxattr': [0x88, ['pointer', ['void']]],
    'getxattr': [0x90, ['pointer', ['void']]],
    'listxattr': [0x98, ['pointer', ['void']]],
    'removexattr': [0xa0, ['pointer', ['void']]],
    'fiemap': [0xa8, ['pointer', ['void']]],
    'update_time': [0xb0, ['pointer', ['void']]],
    'atomic_open': [0xb8, ['pointer', ['void']]],
    'tmpfile': [0xc0, ['pointer', ['void']]],
    'set_acl': [0xc8, ['pointer', ['void']]],
}],
  'qdisc_size_table': [ size : 0x40, {
    'rcu': [0x0, ['callback_head']],
    'list': [0x10, ['list_head']],
    'szopts': [0x20, ['tc_sizespec']],
    'refcnt': [0x38, ['int']],
    'data': [0x3c, ['array', 0, ['unsigned short']]],
}],
  'writeback_control': [ size : 0x60, {
    'nr_to_write': [0x0, ['long']],
    'pages_skipped': [0x8, ['long']],
    'range_start': [0x10, ['long long']],
    'range_end': [0x18, ['long long']],
    'sync_mode': [0x20, ['Enumeration', {'target': 'int', 'choices': {0: 'WB_SYNC_NONE', 1: 'WB_SYNC_ALL'}}]],
    'for_background': [0x24, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'range_cyclic': [0x24, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'tagged_writepages': [0x24, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'for_reclaim': [0x24, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'for_sync': [0x24, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'for_kupdate': [0x24, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'wb': [0x28, ['pointer', ['bdi_writeback']]],
    'inode': [0x30, ['pointer', ['inode']]],
    'wb_id': [0x38, ['int']],
    'wb_lcand_id': [0x3c, ['int']],
    'wb_tcand_id': [0x40, ['int']],
    'wb_bytes': [0x48, ['unsigned long']],
    'wb_lcand_bytes': [0x50, ['unsigned long']],
    'wb_tcand_bytes': [0x58, ['unsigned long']],
}],
  'fprop_global': [ size : 0x30, {
    'events': [0x0, ['percpu_counter']],
    'period': [0x28, ['unsigned int']],
    'sequence': [0x2c, ['seqcount']],
}],
  '__unnamed_0x10300': [ size : 0x14, {
    'dlci': [0x0, ['unsigned int']],
    'master': [0x4, ['array', 16, ['char']]],
}],
  '__unnamed_0x371': [ size : 0x8, {
    'counter': [0x0, ['long']],
}],
  'bio_set': [ size : 0x70, {
    'bio_slab': [0x0, ['pointer', ['kmem_cache']]],
    'front_pad': [0x8, ['unsigned int']],
    'bio_pool': [0x10, ['pointer', ['mempool_s']]],
    'bvec_pool': [0x18, ['pointer', ['mempool_s']]],
    'bio_integrity_pool': [0x20, ['pointer', ['mempool_s']]],
    'bvec_integrity_pool': [0x28, ['pointer', ['mempool_s']]],
    'rescue_lock': [0x30, ['spinlock']],
    'rescue_list': [0x38, ['bio_list']],
    'rescue_work': [0x48, ['work_struct']],
    'rescue_workqueue': [0x68, ['pointer', ['workqueue_struct']]],
}],
  'kref': [ size : 0x4, {
    'refcount': [0x0, ['__unnamed_0x1a5']],
}],
  'prev_cputime': [ size : 0x18, {
    'utime': [0x0, ['unsigned long']],
    'stime': [0x8, ['unsigned long']],
    'lock': [0x10, ['raw_spinlock']],
}],
  'assoc_array': [ size : 0x10, {
    'root': [0x0, ['pointer', ['assoc_array_ptr']]],
    'nr_leaves_on_tree': [0x8, ['unsigned long']],
}],
  'x86_io_apic_ops': [ size : 0x10, {
    'read': [0x0, ['pointer', ['void']]],
    'disable': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x9aac': [ size : 0x10, {
    'i_rcu': [0x0, ['callback_head']],
    'i_dentry': [0x0, ['hlist_head']],
}],
  'pcpu_sw_netstats': [ size : 0x20, {
    'rx_packets': [0x0, ['unsigned long long']],
    'rx_bytes': [0x8, ['unsigned long long']],
    'tx_packets': [0x10, ['unsigned long long']],
    'tx_bytes': [0x18, ['unsigned long long']],
    'syncp': [0x20, ['u64_stats_sync']],
}],
  'net_device': [ size : 0x840, {
    'name': [0x0, ['array', 16, ['char']]],
    'name_hlist': [0x10, ['hlist_node']],
    'ifalias': [0x20, ['pointer', ['char']]],
    'mem_end': [0x28, ['unsigned long']],
    'mem_start': [0x30, ['unsigned long']],
    'base_addr': [0x38, ['unsigned long']],
    'irq': [0x40, ['int']],
    'carrier_changes': [0x44, ['__unnamed_0x351']],
    'state': [0x48, ['unsigned long']],
    'dev_list': [0x50, ['list_head']],
    'napi_list': [0x60, ['list_head']],
    'unreg_list': [0x70, ['list_head']],
    'close_list': [0x80, ['list_head']],
    'ptype_all': [0x90, ['list_head']],
    'ptype_specific': [0xa0, ['list_head']],
    'adj_list': [0xb0, ['__unnamed_0x1662d']],
    'all_adj_list': [0xd0, ['__unnamed_0x16651']],
    'features': [0xf0, ['unsigned long long']],
    'hw_features': [0xf8, ['unsigned long long']],
    'wanted_features': [0x100, ['unsigned long long']],
    'vlan_features': [0x108, ['unsigned long long']],
    'hw_enc_features': [0x110, ['unsigned long long']],
    'mpls_features': [0x118, ['unsigned long long']],
    'ifindex': [0x120, ['int']],
    'group': [0x124, ['int']],
    'stats': [0x128, ['net_device_stats']],
    'rx_dropped': [0x1e0, ['__unnamed_0x371']],
    'tx_dropped': [0x1e8, ['__unnamed_0x371']],
    'wireless_handlers': [0x1f0, ['pointer', ['iw_handler_def']]],
    'wireless_data': [0x1f8, ['pointer', ['iw_public_data']]],
    'netdev_ops': [0x200, ['pointer', ['net_device_ops']]],
    'ethtool_ops': [0x208, ['pointer', ['ethtool_ops']]],
    'l3mdev_ops': [0x210, ['pointer', ['l3mdev_ops']]],
    'header_ops': [0x218, ['pointer', ['header_ops']]],
    'flags': [0x220, ['unsigned int']],
    'priv_flags': [0x224, ['unsigned int']],
    'gflags': [0x228, ['unsigned short']],
    'padded': [0x22a, ['unsigned short']],
    'operstate': [0x22c, ['unsigned char']],
    'link_mode': [0x22d, ['unsigned char']],
    'if_port': [0x22e, ['unsigned char']],
    'dma': [0x22f, ['unsigned char']],
    'mtu': [0x230, ['unsigned int']],
    'type': [0x234, ['unsigned short']],
    'hard_header_len': [0x236, ['unsigned short']],
    'min_header_len': [0x238, ['unsigned short']],
    'needed_headroom': [0x23a, ['unsigned short']],
    'needed_tailroom': [0x23c, ['unsigned short']],
    'perm_addr': [0x23e, ['array', 32, ['unsigned char']]],
    'addr_assign_type': [0x25e, ['unsigned char']],
    'addr_len': [0x25f, ['unsigned char']],
    'neigh_priv_len': [0x260, ['unsigned short']],
    'dev_id': [0x262, ['unsigned short']],
    'dev_port': [0x264, ['unsigned short']],
    'addr_list_lock': [0x268, ['spinlock']],
    'name_assign_type': [0x26c, ['unsigned char']],
    'uc_promisc': [0x26d, ['unsigned char']],
    'uc': [0x270, ['netdev_hw_addr_list']],
    'mc': [0x288, ['netdev_hw_addr_list']],
    'dev_addrs': [0x2a0, ['netdev_hw_addr_list']],
    'queues_kset': [0x2b8, ['pointer', ['kset']]],
    'promiscuity': [0x2c0, ['unsigned int']],
    'allmulti': [0x2c4, ['unsigned int']],
    'vlan_info': [0x2c8, ['pointer', ['vlan_info']]],
    'tipc_ptr': [0x2d0, ['pointer', ['tipc_bearer']]],
    'atalk_ptr': [0x2d8, ['pointer', ['void']]],
    'ip_ptr': [0x2e0, ['pointer', ['in_device']]],
    'dn_ptr': [0x2e8, ['pointer', ['dn_dev']]],
    'ip6_ptr': [0x2f0, ['pointer', ['inet6_dev']]],
    'ax25_ptr': [0x2f8, ['pointer', ['void']]],
    'ieee80211_ptr': [0x300, ['pointer', ['wireless_dev']]],
    'ieee802154_ptr': [0x308, ['pointer', ['wpan_dev']]],
    'mpls_ptr': [0x310, ['pointer', ['mpls_dev']]],
    'last_rx': [0x318, ['unsigned long']],
    'dev_addr': [0x320, ['pointer', ['unsigned char']]],
    '_rx': [0x328, ['pointer', ['netdev_rx_queue']]],
    'num_rx_queues': [0x330, ['unsigned int']],
    'real_num_rx_queues': [0x334, ['unsigned int']],
    'gro_flush_timeout': [0x338, ['unsigned long']],
    'rx_handler': [0x340, ['pointer', ['void']]],
    'rx_handler_data': [0x348, ['pointer', ['void']]],
    'ingress_cl_list': [0x350, ['pointer', ['tcf_proto']]],
    'ingress_queue': [0x358, ['pointer', ['netdev_queue']]],
    'nf_hooks_ingress': [0x360, ['list_head']],
    'broadcast': [0x370, ['array', 32, ['unsigned char']]],
    'rx_cpu_rmap': [0x390, ['pointer', ['cpu_rmap']]],
    'index_hlist': [0x398, ['hlist_node']],
    '_tx': [0x3c0, ['pointer', ['netdev_queue']]],
    'num_tx_queues': [0x3c8, ['unsigned int']],
    'real_num_tx_queues': [0x3cc, ['unsigned int']],
    'qdisc': [0x3d0, ['pointer', ['Qdisc']]],
    'tx_queue_len': [0x3d8, ['unsigned long']],
    'tx_global_lock': [0x3e0, ['spinlock']],
    'watchdog_timeo': [0x3e4, ['int']],
    'xps_maps': [0x3e8, ['pointer', ['xps_dev_maps']]],
    'trans_start': [0x3f0, ['unsigned long']],
    'watchdog_timer': [0x3f8, ['timer_list']],
    'pcpu_refcnt': [0x448, ['pointer', ['int']]],
    'todo_list': [0x450, ['list_head']],
    'link_watch_list': [0x460, ['list_head']],
    'rtnl_link_state': [0x470, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'reg_state': [0x470, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'dismantle': [0x471, ['unsigned char']],
    'destructor': [0x478, ['pointer', ['void']]],
    'npinfo': [0x480, ['pointer', ['netpoll_info']]],
    'nd_net': [0x488, ['__unnamed_0x13d29']],
    '__unnamed_0xf844': [0x490, ['__unnamed_0x166c1']],
    'garp_port': [0x498, ['pointer', ['garp_port']]],
    'mrp_port': [0x4a0, ['pointer', ['mrp_port']]],
    'dev': [0x4a8, ['device']],
    'sysfs_groups': [0x780, ['array', 4, ['pointer', ['attribute_group']]]],
    'sysfs_rx_queue_group': [0x7a0, ['pointer', ['attribute_group']]],
    'rtnl_link_ops': [0x7a8, ['pointer', ['rtnl_link_ops']]],
    'gso_max_size': [0x7b0, ['unsigned int']],
    'gso_max_segs': [0x7b4, ['unsigned short']],
    'gso_min_segs': [0x7b6, ['unsigned short']],
    'dcbnl_ops': [0x7b8, ['pointer', ['dcbnl_rtnl_ops']]],
    'num_tc': [0x7c0, ['unsigned char']],
    'tc_to_txq': [0x7c2, ['array', 16, ['netdev_tc_txq']]],
    'prio_tc_map': [0x802, ['array', 16, ['unsigned char']]],
    'fcoe_ddp_xid': [0x814, ['unsigned int']],
    'priomap': [0x818, ['pointer', ['netprio_map']]],
    'phydev': [0x820, ['pointer', ['phy_device']]],
    'qdisc_tx_busylock': [0x828, ['pointer', ['lock_class_key']]],
    'proto_down': [0x830, ['unsigned char']],
}],
  'fib_lookup_arg': [ size : 0x20, {
    'lookup_ptr': [0x0, ['pointer', ['void']]],
    'result': [0x8, ['pointer', ['void']]],
    'rule': [0x10, ['pointer', ['fib_rule']]],
    'flags': [0x18, ['int']],
}],
  'nlmsghdr': [ size : 0x10, {
    'nlmsg_len': [0x0, ['unsigned int']],
    'nlmsg_type': [0x4, ['unsigned short']],
    'nlmsg_flags': [0x6, ['unsigned short']],
    'nlmsg_seq': [0x8, ['unsigned int']],
    'nlmsg_pid': [0xc, ['unsigned int']],
}],
  'ifacaddr6': [ size : 0x40, {
    'aca_addr': [0x0, ['in6_addr']],
    'aca_idev': [0x10, ['pointer', ['inet6_dev']]],
    'aca_rt': [0x18, ['pointer', ['rt6_info']]],
    'aca_next': [0x20, ['pointer', ['ifacaddr6']]],
    'aca_users': [0x28, ['int']],
    'aca_refcnt': [0x2c, ['__unnamed_0x351']],
    'aca_cstamp': [0x30, ['unsigned long']],
    'aca_tstamp': [0x38, ['unsigned long']],
}],
  'timer_list': [ size : 0x50, {
    'entry': [0x0, ['hlist_node']],
    'expires': [0x10, ['unsigned long']],
    'function': [0x18, ['pointer', ['void']]],
    'data': [0x20, ['unsigned long']],
    'flags': [0x28, ['unsigned int']],
    'slack': [0x2c, ['int']],
    'start_pid': [0x30, ['int']],
    'start_site': [0x38, ['pointer', ['void']]],
    'start_comm': [0x40, ['array', 16, ['char']]],
}],
  'kernel_param': [ size : 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'mod': [0x8, ['pointer', ['module']]],
    'ops': [0x10, ['pointer', ['kernel_param_ops']]],
    'perm': [0x18, ['unsigned short']],
    'level': [0x1a, ['signed char']],
    'flags': [0x1b, ['unsigned char']],
    '__unnamed_0x40e3': [0x20, ['__unnamed_0x410f']],
}],
  '__unnamed_0xb9b8': [ size : 0x8, {
    'revoked_at': [0x0, ['long']],
    'expiry': [0x0, ['long']],
}],
  'dir_context': [ size : 0x10, {
    'actor': [0x0, ['pointer', ['void']]],
    'pos': [0x8, ['long long']],
}],
  'ethtool_ah_espip4_spec': [ size : 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'spi': [0x8, ['unsigned int']],
    'tos': [0xc, ['unsigned char']],
}],
  'seq_operations': [ size : 0x20, {
    'start': [0x0, ['pointer', ['void']]],
    'stop': [0x8, ['pointer', ['void']]],
    'next': [0x10, ['pointer', ['void']]],
    'show': [0x18, ['pointer', ['void']]],
}],
  'ethtool_link_settings': [ size : 0x30, {
    'cmd': [0x0, ['unsigned int']],
    'speed': [0x4, ['unsigned int']],
    'duplex': [0x8, ['unsigned char']],
    'port': [0x9, ['unsigned char']],
    'phy_address': [0xa, ['unsigned char']],
    'autoneg': [0xb, ['unsigned char']],
    'mdio_support': [0xc, ['unsigned char']],
    'eth_tp_mdix': [0xd, ['unsigned char']],
    'eth_tp_mdix_ctrl': [0xe, ['unsigned char']],
    'link_mode_masks_nwords': [0xf, ['signed char']],
    'reserved': [0x10, ['array', 8, ['unsigned int']]],
    'link_mode_masks': [0x30, ['array', 0, ['unsigned int']]],
}],
  'device': [ size : 0x2d8, {
    'parent': [0x0, ['pointer', ['device']]],
    'p': [0x8, ['pointer', ['device_private']]],
    'kobj': [0x10, ['kobject']],
    'init_name': [0x50, ['pointer', ['char']]],
    'type': [0x58, ['pointer', ['device_type']]],
    'mutex': [0x60, ['mutex']],
    'bus': [0x88, ['pointer', ['bus_type']]],
    'driver': [0x90, ['pointer', ['device_driver']]],
    'platform_data': [0x98, ['pointer', ['void']]],
    'driver_data': [0xa0, ['pointer', ['void']]],
    'power': [0xa8, ['dev_pm_info']],
    'pm_domain': [0x1e8, ['pointer', ['dev_pm_domain']]],
    'msi_domain': [0x1f0, ['pointer', ['irq_domain']]],
    'pins': [0x1f8, ['pointer', ['dev_pin_info']]],
    'msi_list': [0x200, ['list_head']],
    'numa_node': [0x210, ['int']],
    'dma_mask': [0x218, ['pointer', ['unsigned long long']]],
    'coherent_dma_mask': [0x220, ['unsigned long long']],
    'dma_pfn_offset': [0x228, ['unsigned long']],
    'dma_parms': [0x230, ['pointer', ['device_dma_parameters']]],
    'dma_pools': [0x238, ['list_head']],
    'dma_mem': [0x248, ['pointer', ['dma_coherent_mem']]],
    'archdata': [0x250, ['dev_archdata']],
    'of_node': [0x260, ['pointer', ['device_node']]],
    'fwnode': [0x268, ['pointer', ['fwnode_handle']]],
    'devt': [0x270, ['unsigned int']],
    'id': [0x274, ['unsigned int']],
    'devres_lock': [0x278, ['spinlock']],
    'devres_head': [0x280, ['list_head']],
    'knode_class': [0x290, ['klist_node']],
    'class': [0x2b0, ['pointer', ['class']]],
    'groups': [0x2b8, ['pointer', ['pointer', ['attribute_group']]]],
    'release': [0x2c0, ['pointer', ['void']]],
    'iommu_group': [0x2c8, ['pointer', ['iommu_group']]],
    'offline': [0x2d0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'offline_disabled': [0x2d0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
}],
  'x86_platform_ops': [ size : 0x58, {
    'calibrate_tsc': [0x0, ['pointer', ['void']]],
    'get_wallclock': [0x8, ['pointer', ['void']]],
    'set_wallclock': [0x10, ['pointer', ['void']]],
    'iommu_shutdown': [0x18, ['pointer', ['void']]],
    'is_untracked_pat_range': [0x20, ['pointer', ['void']]],
    'nmi_init': [0x28, ['pointer', ['void']]],
    'get_nmi_reason': [0x30, ['pointer', ['void']]],
    'i8042_detect': [0x38, ['pointer', ['void']]],
    'save_sched_clock_state': [0x40, ['pointer', ['void']]],
    'restore_sched_clock_state': [0x48, ['pointer', ['void']]],
    'apic_post_init': [0x50, ['pointer', ['void']]],
}],
  '__unnamed_0x2ca1': [ size : 0x4, {
    'val': [0x0, ['unsigned int']],
}],
  'class': [ size : 0x80, {
    'name': [0x0, ['pointer', ['char']]],
    'owner': [0x8, ['pointer', ['module']]],
    'class_attrs': [0x10, ['pointer', ['class_attribute']]],
    'dev_groups': [0x18, ['pointer', ['pointer', ['attribute_group']]]],
    'dev_kobj': [0x20, ['pointer', ['kobject']]],
    'dev_uevent': [0x28, ['pointer', ['void']]],
    'devnode': [0x30, ['pointer', ['void']]],
    'class_release': [0x38, ['pointer', ['void']]],
    'dev_release': [0x40, ['pointer', ['void']]],
    'suspend': [0x48, ['pointer', ['void']]],
    'resume': [0x50, ['pointer', ['void']]],
    'shutdown': [0x58, ['pointer', ['void']]],
    'ns_type': [0x60, ['pointer', ['kobj_ns_type_operations']]],
    'namespace': [0x68, ['pointer', ['void']]],
    'pm': [0x70, ['pointer', ['dev_pm_ops']]],
    'p': [0x78, ['pointer', ['subsys_private']]],
}],
  'cg_proto': [ size : 0x80, {
    'memory_allocated': [0x0, ['page_counter']],
    'sockets_allocated': [0x28, ['percpu_counter']],
    'memory_pressure': [0x50, ['int']],
    'sysctl_mem': [0x58, ['array', 3, ['long']]],
    'flags': [0x70, ['unsigned long']],
    'memcg': [0x78, ['pointer', ['mem_cgroup']]],
}],
  'icmpv6msg_mib_device': [ size : 0x1000, {
    'mibs': [0x0, ['array', 512, ['__unnamed_0x371']]],
}],
  'ip_options': [ size : 0x10, {
    'faddr': [0x0, ['unsigned int']],
    'nexthop': [0x4, ['unsigned int']],
    'optlen': [0x8, ['unsigned char']],
    'srr': [0x9, ['unsigned char']],
    'rr': [0xa, ['unsigned char']],
    'ts': [0xb, ['unsigned char']],
    'rr_needaddr': [0xc, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'is_changed': [0xc, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ts_needtime': [0xc, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ts_needaddr': [0xc, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'is_strictroute': [0xc, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'srr_is_hit': [0xc, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'router_alert': [0xd, ['unsigned char']],
    'cipso': [0xe, ['unsigned char']],
    '__pad2': [0xf, ['unsigned char']],
    '__data': [0x10, ['array', 0, ['unsigned char']]],
}],
  'dst_entry': [ size : 0x98, {
    'callback_head': [0x0, ['callback_head']],
    'child': [0x10, ['pointer', ['dst_entry']]],
    'dev': [0x18, ['pointer', ['net_device']]],
    'ops': [0x20, ['pointer', ['dst_ops']]],
    '_metrics': [0x28, ['unsigned long']],
    'expires': [0x30, ['unsigned long']],
    'path': [0x38, ['pointer', ['dst_entry']]],
    'from': [0x40, ['pointer', ['dst_entry']]],
    'xfrm': [0x48, ['pointer', ['xfrm_state']]],
    'input': [0x50, ['pointer', ['void']]],
    'output': [0x58, ['pointer', ['void']]],
    'flags': [0x60, ['unsigned short']],
    'error': [0x62, ['short']],
    'obsolete': [0x64, ['short']],
    'header_len': [0x66, ['unsigned short']],
    'trailer_len': [0x68, ['unsigned short']],
    '__pad3': [0x6a, ['unsigned short']],
    'tclassid': [0x6c, ['unsigned int']],
    'lwtstate': [0x70, ['pointer', ['lwtunnel_state']]],
    '__pad_to_align_refcnt': [0x78, ['array', 1, ['long']]],
    '__refcnt': [0x80, ['__unnamed_0x351']],
    '__use': [0x84, ['int']],
    'lastuse': [0x88, ['unsigned long']],
    '__unnamed_0x129c2': [0x90, ['__unnamed_0x183c6']],
}],
  'rb_root': [ size : 0x8, {
    'rb_node': [0x0, ['pointer', ['rb_node']]],
}],
  'address_space_operations': [ size : 0x98, {
    'writepage': [0x0, ['pointer', ['void']]],
    'readpage': [0x8, ['pointer', ['void']]],
    'writepages': [0x10, ['pointer', ['void']]],
    'set_page_dirty': [0x18, ['pointer', ['void']]],
    'readpages': [0x20, ['pointer', ['void']]],
    'write_begin': [0x28, ['pointer', ['void']]],
    'write_end': [0x30, ['pointer', ['void']]],
    'bmap': [0x38, ['pointer', ['void']]],
    'invalidatepage': [0x40, ['pointer', ['void']]],
    'releasepage': [0x48, ['pointer', ['void']]],
    'freepage': [0x50, ['pointer', ['void']]],
    'direct_IO': [0x58, ['pointer', ['void']]],
    'migratepage': [0x60, ['pointer', ['void']]],
    'launder_page': [0x68, ['pointer', ['void']]],
    'is_partially_uptodate': [0x70, ['pointer', ['void']]],
    'is_dirty_writeback': [0x78, ['pointer', ['void']]],
    'error_remove_page': [0x80, ['pointer', ['void']]],
    'swap_activate': [0x88, ['pointer', ['void']]],
    'swap_deactivate': [0x90, ['pointer', ['void']]],
}],
  'pipe_inode_info': [ size : 0x90, {
    'mutex': [0x0, ['mutex']],
    'wait': [0x28, ['__wait_queue_head']],
    'nrbufs': [0x40, ['unsigned int']],
    'curbuf': [0x44, ['unsigned int']],
    'buffers': [0x48, ['unsigned int']],
    'readers': [0x4c, ['unsigned int']],
    'writers': [0x50, ['unsigned int']],
    'files': [0x54, ['unsigned int']],
    'waiting_writers': [0x58, ['unsigned int']],
    'r_counter': [0x5c, ['unsigned int']],
    'w_counter': [0x60, ['unsigned int']],
    'tmp_page': [0x68, ['pointer', ['page']]],
    'fasync_readers': [0x70, ['pointer', ['fasync_struct']]],
    'fasync_writers': [0x78, ['pointer', ['fasync_struct']]],
    'bufs': [0x80, ['pointer', ['pipe_buffer']]],
    'user': [0x88, ['pointer', ['user_struct']]],
}],
  'ns_common': [ size : 0x18, {
    'stashed': [0x0, ['__unnamed_0x371']],
    'ops': [0x8, ['pointer', ['proc_ns_operations']]],
    'inum': [0x10, ['unsigned int']],
}],
  'x86_init_timers': [ size : 0x20, {
    'setup_percpu_clockev': [0x0, ['pointer', ['void']]],
    'tsc_pre_init': [0x8, ['pointer', ['void']]],
    'timer_init': [0x10, ['pointer', ['void']]],
    'wallclock_init': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x16651': [ size : 0x20, {
    'upper': [0x0, ['list_head']],
    'lower': [0x10, ['list_head']],
}],
  'inet_ehash_bucket': [ size : 0x8, {
    'chain': [0x0, ['hlist_nulls_head']],
}],
  '__unnamed_0x5557': [ size : 0x18, {
    'dup_xol_work': [0x0, ['callback_head']],
    'dup_xol_addr': [0x10, ['unsigned long']],
}],
  'kobject': [ size : 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'entry': [0x8, ['list_head']],
    'parent': [0x18, ['pointer', ['kobject']]],
    'kset': [0x20, ['pointer', ['kset']]],
    'ktype': [0x28, ['pointer', ['kobj_type']]],
    'sd': [0x30, ['pointer', ['kernfs_node']]],
    'kref': [0x38, ['kref']],
    'state_initialized': [0x3c, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'state_remove_uevent_sent': [0x3c, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'uevent_suppress': [0x3c, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'state_add_uevent_sent': [0x3c, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'state_in_sysfs': [0x3c, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
}],
  'header_ops': [ size : 0x28, {
    'create': [0x0, ['pointer', ['void']]],
    'parse': [0x8, ['pointer', ['void']]],
    'cache': [0x10, ['pointer', ['void']]],
    'cache_update': [0x18, ['pointer', ['void']]],
    'validate': [0x20, ['pointer', ['void']]],
}],
  'bus_type': [ size : 0x98, {
    'name': [0x0, ['pointer', ['char']]],
    'dev_name': [0x8, ['pointer', ['char']]],
    'dev_root': [0x10, ['pointer', ['device']]],
    'dev_attrs': [0x18, ['pointer', ['device_attribute']]],
    'bus_groups': [0x20, ['pointer', ['pointer', ['attribute_group']]]],
    'dev_groups': [0x28, ['pointer', ['pointer', ['attribute_group']]]],
    'drv_groups': [0x30, ['pointer', ['pointer', ['attribute_group']]]],
    'match': [0x38, ['pointer', ['void']]],
    'uevent': [0x40, ['pointer', ['void']]],
    'probe': [0x48, ['pointer', ['void']]],
    'remove': [0x50, ['pointer', ['void']]],
    'shutdown': [0x58, ['pointer', ['void']]],
    'online': [0x60, ['pointer', ['void']]],
    'offline': [0x68, ['pointer', ['void']]],
    'suspend': [0x70, ['pointer', ['void']]],
    'resume': [0x78, ['pointer', ['void']]],
    'pm': [0x80, ['pointer', ['dev_pm_ops']]],
    'iommu_ops': [0x88, ['pointer', ['iommu_ops']]],
    'p': [0x90, ['pointer', ['subsys_private']]],
    'lock_key': [0x98, ['lock_class_key']],
}],
  'file_operations': [ size : 0xd8, {
    'owner': [0x0, ['pointer', ['module']]],
    'llseek': [0x8, ['pointer', ['void']]],
    'read': [0x10, ['pointer', ['void']]],
    'write': [0x18, ['pointer', ['void']]],
    'read_iter': [0x20, ['pointer', ['void']]],
    'write_iter': [0x28, ['pointer', ['void']]],
    'iterate': [0x30, ['pointer', ['void']]],
    'poll': [0x38, ['pointer', ['void']]],
    'unlocked_ioctl': [0x40, ['pointer', ['void']]],
    'compat_ioctl': [0x48, ['pointer', ['void']]],
    'mmap': [0x50, ['pointer', ['void']]],
    'open': [0x58, ['pointer', ['void']]],
    'flush': [0x60, ['pointer', ['void']]],
    'release': [0x68, ['pointer', ['void']]],
    'fsync': [0x70, ['pointer', ['void']]],
    'aio_fsync': [0x78, ['pointer', ['void']]],
    'fasync': [0x80, ['pointer', ['void']]],
    'lock': [0x88, ['pointer', ['void']]],
    'sendpage': [0x90, ['pointer', ['void']]],
    'get_unmapped_area': [0x98, ['pointer', ['void']]],
    'check_flags': [0xa0, ['pointer', ['void']]],
    'flock': [0xa8, ['pointer', ['void']]],
    'splice_write': [0xb0, ['pointer', ['void']]],
    'splice_read': [0xb8, ['pointer', ['void']]],
    'setlease': [0xc0, ['pointer', ['void']]],
    'fallocate': [0xc8, ['pointer', ['void']]],
    'show_fdinfo': [0xd0, ['pointer', ['void']]],
}],
  'nf_afinfo': [ size : 0x38, {
    'family': [0x0, ['unsigned short']],
    'checksum': [0x8, ['pointer', ['void']]],
    'checksum_partial': [0x10, ['pointer', ['void']]],
    'route': [0x18, ['pointer', ['void']]],
    'saveroute': [0x20, ['pointer', ['void']]],
    'reroute': [0x28, ['pointer', ['void']]],
    'route_key_size': [0x30, ['int']],
}],
  'flowi_common': [ size : 0x20, {
    'flowic_oif': [0x0, ['int']],
    'flowic_iif': [0x4, ['int']],
    'flowic_mark': [0x8, ['unsigned int']],
    'flowic_tos': [0xc, ['unsigned char']],
    'flowic_scope': [0xd, ['unsigned char']],
    'flowic_proto': [0xe, ['unsigned char']],
    'flowic_flags': [0xf, ['unsigned char']],
    'flowic_secid': [0x10, ['unsigned int']],
    'flowic_tun_key': [0x18, ['flowi_tunnel']],
}],
  '__unnamed_0x10278': [ size : 0x18, {
    't391': [0x0, ['unsigned int']],
    't392': [0x4, ['unsigned int']],
    'n391': [0x8, ['unsigned int']],
    'n392': [0xc, ['unsigned int']],
    'n393': [0x10, ['unsigned int']],
    'lmi': [0x14, ['unsigned short']],
    'dce': [0x16, ['unsigned short']],
}],
  'nlattr': [ size : 0x4, {
    'nla_len': [0x0, ['unsigned short']],
    'nla_type': [0x2, ['unsigned short']],
}],
  'sk_filter': [ size : 0x20, {
    'refcnt': [0x0, ['__unnamed_0x351']],
    'rcu': [0x8, ['callback_head']],
    'prog': [0x18, ['pointer', ['bpf_prog']]],
}],
  'cftype': [ size : 0xc0, {
    'name': [0x0, ['array', 64, ['char']]],
    'private': [0x40, ['unsigned long']],
    'max_write_len': [0x48, ['unsigned long']],
    'flags': [0x50, ['unsigned int']],
    'file_offset': [0x54, ['unsigned int']],
    'ss': [0x58, ['pointer', ['cgroup_subsys']]],
    'node': [0x60, ['list_head']],
    'kf_ops': [0x70, ['pointer', ['kernfs_ops']]],
    'read_u64': [0x78, ['pointer', ['void']]],
    'read_s64': [0x80, ['pointer', ['void']]],
    'seq_show': [0x88, ['pointer', ['void']]],
    'seq_start': [0x90, ['pointer', ['void']]],
    'seq_next': [0x98, ['pointer', ['void']]],
    'seq_stop': [0xa0, ['pointer', ['void']]],
    'write_u64': [0xa8, ['pointer', ['void']]],
    'write_s64': [0xb0, ['pointer', ['void']]],
    'write': [0xb8, ['pointer', ['void']]],
}],
  'wakeup_source': [ size : 0xd8, {
    'name': [0x0, ['pointer', ['char']]],
    'entry': [0x8, ['list_head']],
    'lock': [0x18, ['spinlock']],
    'wakeirq': [0x20, ['pointer', ['wake_irq']]],
    'timer': [0x28, ['timer_list']],
    'timer_expires': [0x78, ['unsigned long']],
    'total_time': [0x80, ['ktime']],
    'max_time': [0x88, ['ktime']],
    'last_time': [0x90, ['ktime']],
    'start_prevent_time': [0x98, ['ktime']],
    'prevent_sleep_time': [0xa0, ['ktime']],
    'event_count': [0xa8, ['unsigned long']],
    'active_count': [0xb0, ['unsigned long']],
    'relax_count': [0xb8, ['unsigned long']],
    'expire_count': [0xc0, ['unsigned long']],
    'wakeup_count': [0xc8, ['unsigned long']],
    'autosleep_enabled': [0xd0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'active': [0xd0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
}],
  'x86_init_mpparse': [ size : 0x40, {
    'mpc_record': [0x0, ['pointer', ['void']]],
    'setup_ioapic_ids': [0x8, ['pointer', ['void']]],
    'mpc_apic_id': [0x10, ['pointer', ['void']]],
    'smp_read_mpc_oem': [0x18, ['pointer', ['void']]],
    'mpc_oem_pci_bus': [0x20, ['pointer', ['void']]],
    'mpc_oem_bus_info': [0x28, ['pointer', ['void']]],
    'find_smp_config': [0x30, ['pointer', ['void']]],
    'get_smp_config': [0x38, ['pointer', ['void']]],
}],
  'dqstats': [ size : 0x160, {
    'stat': [0x0, ['array', 8, ['int']]],
    'counter': [0x20, ['array', 8, ['percpu_counter']]],
}],
  '__unnamed_0xb250': [ size : 0x8, {
    'sig': [0x0, ['array', 1, ['unsigned long']]],
}],
  'completion': [ size : 0x20, {
    'done': [0x0, ['unsigned int']],
    'wait': [0x8, ['__wait_queue_head']],
}],
  '__unnamed_0x5664': [ size : 0x8, {
    's_mem': [0x0, ['pointer', ['void']]],
    'mapping': [0x0, ['pointer', ['address_space']]],
}],
  'uid_gid_map': [ size : 0x40, {
    'nr_extents': [0x0, ['unsigned int']],
    'extent': [0x4, ['array', 5, ['uid_gid_extent']]],
}],
  '__unnamed_0x624': [ size : 0x28, {
    'nanosleep': [0x0, ['__unnamed_0x51a']],
    'poll': [0x0, ['__unnamed_0x5a9']],
    'futex': [0x0, ['__unnamed_0x4c3']],
}],
  'ethtool_ringparam': [ size : 0x24, {
    'cmd': [0x0, ['unsigned int']],
    'rx_max_pending': [0x4, ['unsigned int']],
    'rx_mini_max_pending': [0x8, ['unsigned int']],
    'rx_jumbo_max_pending': [0xc, ['unsigned int']],
    'tx_max_pending': [0x10, ['unsigned int']],
    'rx_pending': [0x14, ['unsigned int']],
    'rx_mini_pending': [0x18, ['unsigned int']],
    'rx_jumbo_pending': [0x1c, ['unsigned int']],
    'tx_pending': [0x20, ['unsigned int']],
}],
  '__unnamed_0x15fd': [ size : 0x10, {
    '__unnamed_0x160a': [0x0, ['__unnamed_0x15c4']],
    '__unnamed_0x1605': [0x0, ['__unnamed_0x15a3']],
}],
  'pv_apic_ops': [ size : 0x8, {
    'startup_ipi_hook': [0x0, ['pointer', ['void']]],
}],
  'rps_sock_flow_table': [ size : 0x40, {
    'mask': [0x0, ['unsigned int']],
    'ents': [0x40, ['array', 0, ['unsigned int']]],
}],
  '__unnamed_0xfe2a': [ size : 0x4, {
    'csum_start': [0x0, ['unsigned short']],
    'csum_offset': [0x2, ['unsigned short']],
}],
  'siginfo': [ size : 0x80, {
    'si_signo': [0x0, ['int']],
    'si_errno': [0x4, ['int']],
    'si_code': [0x8, ['int']],
    '_sifields': [0x10, ['__unnamed_0xb459']],
}],
  'atomic_notifier_head': [ size : 0x10, {
    'lock': [0x0, ['spinlock']],
    'head': [0x8, ['pointer', ['notifier_block']]],
}],
  'x86_init_ops': [ size : 0xd0, {
    'resources': [0x0, ['x86_init_resources']],
    'mpparse': [0x18, ['x86_init_mpparse']],
    'irqs': [0x58, ['x86_init_irqs']],
    'oem': [0x70, ['x86_init_oem']],
    'paging': [0x80, ['x86_init_paging']],
    'timers': [0x88, ['x86_init_timers']],
    'iommu': [0xa8, ['x86_init_iommu']],
    'pci': [0xb0, ['x86_init_pci']],
}],
  '__unnamed_0x581a': [ size : 0x10, {
    'next': [0x0, ['pointer', ['page']]],
    'pages': [0x8, ['int']],
    'pobjects': [0xc, ['int']],
}],
  'super_operations': [ size : 0xd0, {
    'alloc_inode': [0x0, ['pointer', ['void']]],
    'destroy_inode': [0x8, ['pointer', ['void']]],
    'dirty_inode': [0x10, ['pointer', ['void']]],
    'write_inode': [0x18, ['pointer', ['void']]],
    'drop_inode': [0x20, ['pointer', ['void']]],
    'evict_inode': [0x28, ['pointer', ['void']]],
    'put_super': [0x30, ['pointer', ['void']]],
    'sync_fs': [0x38, ['pointer', ['void']]],
    'freeze_super': [0x40, ['pointer', ['void']]],
    'freeze_fs': [0x48, ['pointer', ['void']]],
    'thaw_super': [0x50, ['pointer', ['void']]],
    'unfreeze_fs': [0x58, ['pointer', ['void']]],
    'statfs': [0x60, ['pointer', ['void']]],
    'remount_fs': [0x68, ['pointer', ['void']]],
    'umount_begin': [0x70, ['pointer', ['void']]],
    'show_options': [0x78, ['pointer', ['void']]],
    'show_devname': [0x80, ['pointer', ['void']]],
    'show_path': [0x88, ['pointer', ['void']]],
    'show_stats': [0x90, ['pointer', ['void']]],
    'quota_read': [0x98, ['pointer', ['void']]],
    'quota_write': [0xa0, ['pointer', ['void']]],
    'get_dquots': [0xa8, ['pointer', ['void']]],
    'bdev_try_to_free_page': [0xb0, ['pointer', ['void']]],
    'nr_cached_objects': [0xb8, ['pointer', ['void']]],
    'free_cached_objects': [0xc0, ['pointer', ['void']]],
    'real_loop': [0xc8, ['pointer', ['void']]],
}],
  'module_layout': [ size : 0x50, {
    'base': [0x0, ['pointer', ['void']]],
    'size': [0x8, ['unsigned int']],
    'text_size': [0xc, ['unsigned int']],
    'ro_size': [0x10, ['unsigned int']],
    'mtn': [0x18, ['mod_tree_node']],
}],
  'percpu_ref': [ size : 0x38, {
    'count': [0x0, ['__unnamed_0x371']],
    'percpu_count_ptr': [0x8, ['unsigned long']],
    'release': [0x10, ['pointer', ['void']]],
    'confirm_switch': [0x18, ['pointer', ['void']]],
    'force_atomic': [0x20, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'rcu': [0x28, ['callback_head']],
}],
  'tty_struct': [ size : 0x2e0, {
    'magic': [0x0, ['int']],
    'kref': [0x4, ['kref']],
    'dev': [0x8, ['pointer', ['device']]],
    'driver': [0x10, ['pointer', ['tty_driver']]],
    'ops': [0x18, ['pointer', ['tty_operations']]],
    'index': [0x20, ['int']],
    'ldisc_sem': [0x28, ['ld_semaphore']],
    'ldisc': [0x58, ['pointer', ['tty_ldisc']]],
    'atomic_write_lock': [0x60, ['mutex']],
    'legacy_mutex': [0x88, ['mutex']],
    'throttle_mutex': [0xb0, ['mutex']],
    'termios_rwsem': [0xd8, ['rw_semaphore']],
    'winsize_mutex': [0x100, ['mutex']],
    'ctrl_lock': [0x128, ['spinlock']],
    'flow_lock': [0x12c, ['spinlock']],
    'termios': [0x130, ['ktermios']],
    'termios_locked': [0x15c, ['ktermios']],
    'termiox': [0x188, ['pointer', ['termiox']]],
    'name': [0x190, ['array', 64, ['char']]],
    'pgrp': [0x1d0, ['pointer', ['pid']]],
    'session': [0x1d8, ['pointer', ['pid']]],
    'flags': [0x1e0, ['unsigned long']],
    'count': [0x1e8, ['int']],
    'winsize': [0x1ec, ['winsize']],
    'stopped': [0x1f0, ['BitField', {'end_bit': 33, 'start_bit': 32}]],
    'flow_stopped': [0x1f0, ['BitField', {'end_bit': 34, 'start_bit': 33}]],
    'unused': [0x1f8, ['BitField', {'end_bit': 62, 'start_bit': 0}]],
    'packet': [0x200, ['BitField', {'end_bit': 41, 'start_bit': 40}]],
    'hw_stopped': [0x200, ['int']],
    'ctrl_status': [0x200, ['BitField', {'end_bit': 40, 'start_bit': 32}]],
    'unused_ctrl': [0x208, ['BitField', {'end_bit': 55, 'start_bit': 0}]],
    'receive_room': [0x210, ['unsigned int']],
    'flow_change': [0x214, ['int']],
    'link': [0x218, ['pointer', ['tty_struct']]],
    'fasync': [0x220, ['pointer', ['fasync_struct']]],
    'alt_speed': [0x228, ['int']],
    'write_wait': [0x230, ['__wait_queue_head']],
    'read_wait': [0x248, ['__wait_queue_head']],
    'hangup_work': [0x260, ['work_struct']],
    'disc_data': [0x280, ['pointer', ['void']]],
    'driver_data': [0x288, ['pointer', ['void']]],
    'tty_files': [0x290, ['list_head']],
    'closing': [0x2a0, ['int']],
    'write_buf': [0x2a8, ['pointer', ['unsigned char']]],
    'write_cnt': [0x2b0, ['int']],
    'SAK_work': [0x2b8, ['work_struct']],
    'port': [0x2d8, ['pointer', ['tty_port']]],
}],
  'idr_layer': [ size : 0x830, {
    'prefix': [0x0, ['int']],
    'layer': [0x4, ['int']],
    'ary': [0x8, ['array', 256, ['pointer', ['idr_layer']]]],
    'count': [0x808, ['int']],
    '__unnamed_0x36aa': [0x810, ['__unnamed_0x364d']],
}],
  'kparam_array': [ size : 0x20, {
    'max': [0x0, ['unsigned int']],
    'elemsize': [0x4, ['unsigned int']],
    'num': [0x8, ['pointer', ['unsigned int']]],
    'ops': [0x10, ['pointer', ['kernel_param_ops']]],
    'elem': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x13d29': [ size : 0x8, {
    'net': [0x0, ['pointer', ['net']]],
}],
  'pneigh_entry': [ size : 0x20, {
    'next': [0x0, ['pointer', ['pneigh_entry']]],
    'net': [0x8, ['__unnamed_0x13d29']],
    'dev': [0x10, ['pointer', ['net_device']]],
    'flags': [0x18, ['unsigned char']],
    'key': [0x19, ['array', 0, ['unsigned char']]],
}],
  'work_struct': [ size : 0x20, {
    'data': [0x0, ['__unnamed_0x371']],
    'entry': [0x8, ['list_head']],
    'func': [0x18, ['pointer', ['void']]],
}],
  'xfrm_policy_hthresh': [ size : 0x30, {
    'work': [0x0, ['work_struct']],
    'lock': [0x20, ['__unnamed_0x2c51']],
    'lbits4': [0x28, ['unsigned char']],
    'rbits4': [0x29, ['unsigned char']],
    'lbits6': [0x2a, ['unsigned char']],
    'rbits6': [0x2b, ['unsigned char']],
}],
  'timerqueue_head': [ size : 0x10, {
    'head': [0x0, ['rb_root']],
    'next': [0x8, ['pointer', ['timerqueue_node']]],
}],
  'resource': [ size : 0x38, {
    'start': [0x0, ['unsigned long long']],
    'end': [0x8, ['unsigned long long']],
    'name': [0x10, ['pointer', ['char']]],
    'flags': [0x18, ['unsigned long']],
    'parent': [0x20, ['pointer', ['resource']]],
    'sibling': [0x28, ['pointer', ['resource']]],
    'child': [0x30, ['pointer', ['resource']]],
}],
  'dcb_peer_app_info': [ size : 0x2, {
    'willing': [0x0, ['unsigned char']],
    'error': [0x1, ['unsigned char']],
}],
  'restart_block': [ size : 0x30, {
    'fn': [0x0, ['pointer', ['void']]],
    '__unnamed_0x665': [0x8, ['__unnamed_0x624']],
}],
  'clocksource': [ size : 0xc0, {
    'read': [0x0, ['pointer', ['void']]],
    'mask': [0x8, ['unsigned long long']],
    'mult': [0x10, ['unsigned int']],
    'shift': [0x14, ['unsigned int']],
    'max_idle_ns': [0x18, ['unsigned long long']],
    'maxadj': [0x20, ['unsigned int']],
    'archdata': [0x24, ['arch_clocksource_data']],
    'max_cycles': [0x28, ['unsigned long long']],
    'name': [0x30, ['pointer', ['char']]],
    'list': [0x38, ['list_head']],
    'rating': [0x48, ['int']],
    'enable': [0x50, ['pointer', ['void']]],
    'disable': [0x58, ['pointer', ['void']]],
    'flags': [0x60, ['unsigned long']],
    'suspend': [0x68, ['pointer', ['void']]],
    'resume': [0x70, ['pointer', ['void']]],
    'wd_list': [0x78, ['list_head']],
    'cs_last': [0x88, ['unsigned long long']],
    'wd_last': [0x90, ['unsigned long long']],
    'owner': [0x98, ['pointer', ['module']]],
}],
  'neigh_ops': [ size : 0x28, {
    'family': [0x0, ['int']],
    'solicit': [0x8, ['pointer', ['void']]],
    'error_report': [0x10, ['pointer', ['void']]],
    'output': [0x18, ['pointer', ['void']]],
    'connected_output': [0x20, ['pointer', ['void']]],
}],
  'ethhdr': [ size : 0xe, {
    'h_dest': [0x0, ['array', 6, ['unsigned char']]],
    'h_source': [0x6, ['array', 6, ['unsigned char']]],
    'h_proto': [0xc, ['unsigned short']],
}],
  '__unnamed_0x17e09': [ size : 0x0, {
    'insns': [0x0, ['array', 0, ['sock_filter']]],
    'insnsi': [0x0, ['array', 0, ['bpf_insn']]],
}],
  'linux_xfrm_mib': [ size : 0xe8, {
    'mibs': [0x0, ['array', 29, ['unsigned long']]],
}],
  'netns_core': [ size : 0x18, {
    'sysctl_hdr': [0x0, ['pointer', ['ctl_table_header']]],
    'sysctl_somaxconn': [0x8, ['int']],
    'inuse': [0x10, ['pointer', ['prot_inuse']]],
}],
  'dev_pm_info': [ size : 0x140, {
    'power_state': [0x0, ['pm_message']],
    'is_suspended': [0x4, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'is_noirq_suspended': [0x4, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'early_init': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'async_suspend': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'can_wakeup': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'is_prepared': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'is_late_suspended': [0x4, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ignore_children': [0x4, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'direct_complete': [0x5, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'lock': [0x8, ['spinlock']],
    'entry': [0x10, ['list_head']],
    'completion': [0x20, ['completion']],
    'wakeup': [0x40, ['pointer', ['wakeup_source']]],
    'syscore': [0x48, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'wakeup_path': [0x48, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'suspend_timer': [0x50, ['timer_list']],
    'timer_expires': [0xa0, ['unsigned long']],
    'work': [0xa8, ['work_struct']],
    'wait_queue': [0xc8, ['__wait_queue_head']],
    'wakeirq': [0xe0, ['pointer', ['wake_irq']]],
    'usage_count': [0xe8, ['__unnamed_0x351']],
    'child_count': [0xec, ['__unnamed_0x351']],
    'run_wake': [0xf0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'runtime_auto': [0xf0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'irq_safe': [0xf0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'idle_notification': [0xf0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'memalloc_noio': [0xf0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'request_pending': [0xf0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'use_autosuspend': [0xf0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'no_callbacks': [0xf0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'disable_depth': [0xf0, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'deferred_resume': [0xf0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'timer_autosuspends': [0xf0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'request': [0xf4, ['Enumeration', {'target': 'int', 'choices': {0: 'RPM_REQ_NONE', 1: 'RPM_REQ_IDLE', 2: 'RPM_REQ_SUSPEND', 3: 'RPM_REQ_AUTOSUSPEND', 4: 'RPM_REQ_RESUME'}}]],
    'runtime_status': [0xf8, ['Enumeration', {'target': 'int', 'choices': {0: 'RPM_ACTIVE', 1: 'RPM_RESUMING', 2: 'RPM_SUSPENDED', 3: 'RPM_SUSPENDING'}}]],
    'runtime_error': [0xfc, ['int']],
    'autosuspend_delay': [0x100, ['int']],
    'last_busy': [0x108, ['unsigned long']],
    'active_jiffies': [0x110, ['unsigned long']],
    'suspended_jiffies': [0x118, ['unsigned long']],
    'accounting_timestamp': [0x120, ['unsigned long']],
    'subsys_data': [0x128, ['pointer', ['pm_subsys_data']]],
    'set_latency_tolerance': [0x130, ['pointer', ['void']]],
    'qos': [0x138, ['pointer', ['dev_pm_qos']]],
}],
  'udp_table': [ size : 0x18, {
    'hash': [0x0, ['pointer', ['udp_hslot']]],
    'hash2': [0x8, ['pointer', ['udp_hslot']]],
    'mask': [0x10, ['unsigned int']],
    'log': [0x14, ['unsigned int']],
}],
  'backing_dev_info': [ size : 0x3d0, {
    'bdi_list': [0x0, ['list_head']],
    'ra_pages': [0x10, ['unsigned long']],
    'capabilities': [0x18, ['unsigned int']],
    'congested_fn': [0x20, ['pointer', ['void']]],
    'congested_data': [0x28, ['pointer', ['void']]],
    'name': [0x30, ['pointer', ['char']]],
    'refcnt': [0x38, ['kref']],
    'min_ratio': [0x3c, ['unsigned int']],
    'max_ratio': [0x40, ['unsigned int']],
    'max_prop_frac': [0x44, ['unsigned int']],
    'tot_write_bandwidth': [0x48, ['__unnamed_0x371']],
    'wb': [0x50, ['bdi_writeback']],
    'wb_list': [0x320, ['list_head']],
    'cgwb_tree': [0x330, ['radix_tree_root']],
    'cgwb_congested_tree': [0x340, ['rb_root']],
    'wb_waitq': [0x348, ['__wait_queue_head']],
    'dev': [0x360, ['pointer', ['device']]],
    'owner': [0x368, ['pointer', ['device']]],
    'laptop_mode_wb_timer': [0x370, ['timer_list']],
    'debug_dir': [0x3c0, ['pointer', ['dentry']]],
    'debug_stats': [0x3c8, ['pointer', ['dentry']]],
}],
  'module_kobject': [ size : 0x60, {
    'kobj': [0x0, ['kobject']],
    'mod': [0x40, ['pointer', ['module']]],
    'drivers_dir': [0x48, ['pointer', ['kobject']]],
    'mp': [0x50, ['pointer', ['module_param_attrs']]],
    'kobj_completion': [0x58, ['pointer', ['completion']]],
}],
  'dev_pm_ops': [ size : 0xb8, {
    'prepare': [0x0, ['pointer', ['void']]],
    'complete': [0x8, ['pointer', ['void']]],
    'suspend': [0x10, ['pointer', ['void']]],
    'resume': [0x18, ['pointer', ['void']]],
    'freeze': [0x20, ['pointer', ['void']]],
    'thaw': [0x28, ['pointer', ['void']]],
    'poweroff': [0x30, ['pointer', ['void']]],
    'restore': [0x38, ['pointer', ['void']]],
    'suspend_late': [0x40, ['pointer', ['void']]],
    'resume_early': [0x48, ['pointer', ['void']]],
    'freeze_late': [0x50, ['pointer', ['void']]],
    'thaw_early': [0x58, ['pointer', ['void']]],
    'poweroff_late': [0x60, ['pointer', ['void']]],
    'restore_early': [0x68, ['pointer', ['void']]],
    'suspend_noirq': [0x70, ['pointer', ['void']]],
    'resume_noirq': [0x78, ['pointer', ['void']]],
    'freeze_noirq': [0x80, ['pointer', ['void']]],
    'thaw_noirq': [0x88, ['pointer', ['void']]],
    'poweroff_noirq': [0x90, ['pointer', ['void']]],
    'restore_noirq': [0x98, ['pointer', ['void']]],
    'runtime_suspend': [0xa0, ['pointer', ['void']]],
    'runtime_resume': [0xa8, ['pointer', ['void']]],
    'runtime_idle': [0xb0, ['pointer', ['void']]],
}],
  'net_device_ops': [ size : 0x238, {
    'ndo_init': [0x0, ['pointer', ['void']]],
    'ndo_uninit': [0x8, ['pointer', ['void']]],
    'ndo_open': [0x10, ['pointer', ['void']]],
    'ndo_stop': [0x18, ['pointer', ['void']]],
    'ndo_start_xmit': [0x20, ['pointer', ['void']]],
    'ndo_select_queue': [0x28, ['pointer', ['void']]],
    'ndo_change_rx_flags': [0x30, ['pointer', ['void']]],
    'ndo_set_rx_mode': [0x38, ['pointer', ['void']]],
    'ndo_set_mac_address': [0x40, ['pointer', ['void']]],
    'ndo_validate_addr': [0x48, ['pointer', ['void']]],
    'ndo_do_ioctl': [0x50, ['pointer', ['void']]],
    'ndo_set_config': [0x58, ['pointer', ['void']]],
    'ndo_change_mtu': [0x60, ['pointer', ['void']]],
    'ndo_neigh_setup': [0x68, ['pointer', ['void']]],
    'ndo_tx_timeout': [0x70, ['pointer', ['void']]],
    'ndo_get_stats64': [0x78, ['pointer', ['void']]],
    'ndo_get_stats': [0x80, ['pointer', ['void']]],
    'ndo_vlan_rx_add_vid': [0x88, ['pointer', ['void']]],
    'ndo_vlan_rx_kill_vid': [0x90, ['pointer', ['void']]],
    'ndo_poll_controller': [0x98, ['pointer', ['void']]],
    'ndo_netpoll_setup': [0xa0, ['pointer', ['void']]],
    'ndo_netpoll_cleanup': [0xa8, ['pointer', ['void']]],
    'ndo_busy_poll': [0xb0, ['pointer', ['void']]],
    'ndo_set_vf_mac': [0xb8, ['pointer', ['void']]],
    'ndo_set_vf_vlan': [0xc0, ['pointer', ['void']]],
    'ndo_set_vf_rate': [0xc8, ['pointer', ['void']]],
    'ndo_set_vf_spoofchk': [0xd0, ['pointer', ['void']]],
    'ndo_set_vf_trust': [0xd8, ['pointer', ['void']]],
    'ndo_get_vf_config': [0xe0, ['pointer', ['void']]],
    'ndo_set_vf_link_state': [0xe8, ['pointer', ['void']]],
    'ndo_get_vf_stats': [0xf0, ['pointer', ['void']]],
    'ndo_set_vf_port': [0xf8, ['pointer', ['void']]],
    'ndo_get_vf_port': [0x100, ['pointer', ['void']]],
    'ndo_set_vf_rss_query_en': [0x108, ['pointer', ['void']]],
    'ndo_setup_tc': [0x110, ['pointer', ['void']]],
    'ndo_fcoe_enable': [0x118, ['pointer', ['void']]],
    'ndo_fcoe_disable': [0x120, ['pointer', ['void']]],
    'ndo_fcoe_ddp_setup': [0x128, ['pointer', ['void']]],
    'ndo_fcoe_ddp_done': [0x130, ['pointer', ['void']]],
    'ndo_fcoe_ddp_target': [0x138, ['pointer', ['void']]],
    'ndo_fcoe_get_hbainfo': [0x140, ['pointer', ['void']]],
    'ndo_fcoe_get_wwn': [0x148, ['pointer', ['void']]],
    'ndo_rx_flow_steer': [0x150, ['pointer', ['void']]],
    'ndo_add_slave': [0x158, ['pointer', ['void']]],
    'ndo_del_slave': [0x160, ['pointer', ['void']]],
    'ndo_fix_features': [0x168, ['pointer', ['void']]],
    'ndo_set_features': [0x170, ['pointer', ['void']]],
    'ndo_neigh_construct': [0x178, ['pointer', ['void']]],
    'ndo_neigh_destroy': [0x180, ['pointer', ['void']]],
    'ndo_fdb_add': [0x188, ['pointer', ['void']]],
    'ndo_fdb_del': [0x190, ['pointer', ['void']]],
    'ndo_fdb_dump': [0x198, ['pointer', ['void']]],
    'ndo_bridge_setlink': [0x1a0, ['pointer', ['void']]],
    'ndo_bridge_getlink': [0x1a8, ['pointer', ['void']]],
    'ndo_bridge_dellink': [0x1b0, ['pointer', ['void']]],
    'ndo_change_carrier': [0x1b8, ['pointer', ['void']]],
    'ndo_get_phys_port_id': [0x1c0, ['pointer', ['void']]],
    'ndo_get_phys_port_name': [0x1c8, ['pointer', ['void']]],
    'ndo_add_vxlan_port': [0x1d0, ['pointer', ['void']]],
    'ndo_del_vxlan_port': [0x1d8, ['pointer', ['void']]],
    'ndo_add_geneve_port': [0x1e0, ['pointer', ['void']]],
    'ndo_del_geneve_port': [0x1e8, ['pointer', ['void']]],
    'ndo_dfwd_add_station': [0x1f0, ['pointer', ['void']]],
    'ndo_dfwd_del_station': [0x1f8, ['pointer', ['void']]],
    'ndo_dfwd_start_xmit': [0x200, ['pointer', ['void']]],
    'ndo_get_lock_subclass': [0x208, ['pointer', ['void']]],
    'ndo_features_check': [0x210, ['pointer', ['void']]],
    'ndo_set_tx_maxrate': [0x218, ['pointer', ['void']]],
    'ndo_get_iflink': [0x220, ['pointer', ['void']]],
    'ndo_change_proto_down': [0x228, ['pointer', ['void']]],
    'ndo_fill_metadata_dst': [0x230, ['pointer', ['void']]],
}],
  'qstr': [ size : 0x10, {
    '__unnamed_0x77fa': [0x0, ['__unnamed_0x77d5']],
    'name': [0x8, ['pointer', ['unsigned char']]],
}],
  '__unnamed_0x16ebc': [ size : 0x20, {
    'rcu': [0x0, ['callback_head']],
    'release_work': [0x0, ['work_struct']],
}],
  'module': [ size : 0x380, {
    'state': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'MODULE_STATE_LIVE', 1: 'MODULE_STATE_COMING', 2: 'MODULE_STATE_GOING', 3: 'MODULE_STATE_UNFORMED'}}]],
    'list': [0x8, ['list_head']],
    'name': [0x18, ['array', 56, ['char']]],
    'mkobj': [0x50, ['module_kobject']],
    'modinfo_attrs': [0xb0, ['pointer', ['module_attribute']]],
    'version': [0xb8, ['pointer', ['char']]],
    'srcversion': [0xc0, ['pointer', ['char']]],
    'holders_dir': [0xc8, ['pointer', ['kobject']]],
    'syms': [0xd0, ['pointer', ['kernel_symbol']]],
    'crcs': [0xd8, ['pointer', ['unsigned long']]],
    'num_syms': [0xe0, ['unsigned int']],
    'param_lock': [0xe8, ['mutex']],
    'kp': [0x110, ['pointer', ['kernel_param']]],
    'num_kp': [0x118, ['unsigned int']],
    'num_gpl_syms': [0x11c, ['unsigned int']],
    'gpl_syms': [0x120, ['pointer', ['kernel_symbol']]],
    'gpl_crcs': [0x128, ['pointer', ['unsigned long']]],
    'unused_syms': [0x130, ['pointer', ['kernel_symbol']]],
    'unused_crcs': [0x138, ['pointer', ['unsigned long']]],
    'num_unused_syms': [0x140, ['unsigned int']],
    'num_unused_gpl_syms': [0x144, ['unsigned int']],
    'unused_gpl_syms': [0x148, ['pointer', ['kernel_symbol']]],
    'unused_gpl_crcs': [0x150, ['pointer', ['unsigned long']]],
    'sig_ok': [0x158, ['unsigned char']],
    'async_probe_requested': [0x159, ['unsigned char']],
    'gpl_future_syms': [0x160, ['pointer', ['kernel_symbol']]],
    'gpl_future_crcs': [0x168, ['pointer', ['unsigned long']]],
    'num_gpl_future_syms': [0x170, ['unsigned int']],
    'num_exentries': [0x174, ['unsigned int']],
    'extable': [0x178, ['pointer', ['exception_table_entry']]],
    'init': [0x180, ['pointer', ['void']]],
    'core_layout': [0x1c0, ['module_layout']],
    'init_layout': [0x210, ['module_layout']],
    'arch': [0x260, ['mod_arch_specific']],
    'taints': [0x260, ['unsigned int']],
    'num_bugs': [0x264, ['unsigned int']],
    'bug_list': [0x268, ['list_head']],
    'bug_table': [0x278, ['pointer', ['bug_entry']]],
    'kallsyms': [0x280, ['pointer', ['mod_kallsyms']]],
    'core_kallsyms': [0x288, ['mod_kallsyms']],
    'sect_attrs': [0x2a0, ['pointer', ['module_sect_attrs']]],
    'notes_attrs': [0x2a8, ['pointer', ['module_notes_attrs']]],
    'args': [0x2b0, ['pointer', ['char']]],
    'percpu': [0x2b8, ['pointer', ['void']]],
    'percpu_size': [0x2c0, ['unsigned int']],
    'num_tracepoints': [0x2c4, ['unsigned int']],
    'tracepoints_ptrs': [0x2c8, ['pointer', ['pointer', ['tracepoint']]]],
    'jump_entries': [0x2d0, ['pointer', ['jump_entry']]],
    'num_jump_entries': [0x2d8, ['unsigned int']],
    'num_trace_bprintk_fmt': [0x2dc, ['unsigned int']],
    'trace_bprintk_fmt_start': [0x2e0, ['pointer', ['pointer', ['char']]]],
    'trace_events': [0x2e8, ['pointer', ['pointer', ['trace_event_call']]]],
    'num_trace_events': [0x2f0, ['unsigned int']],
    'trace_enums': [0x2f8, ['pointer', ['pointer', ['trace_enum_map']]]],
    'num_trace_enums': [0x300, ['unsigned int']],
    'num_ftrace_callsites': [0x304, ['unsigned int']],
    'ftrace_callsites': [0x308, ['pointer', ['unsigned long']]],
    'klp_alive': [0x310, ['unsigned char']],
    'source_list': [0x318, ['list_head']],
    'target_list': [0x328, ['list_head']],
    'exit': [0x338, ['pointer', ['void']]],
    'refcnt': [0x340, ['__unnamed_0x1a5']],
}],
  'mm_rss_stat': [ size : 0x18, {
    'count': [0x0, ['array', 3, ['__unnamed_0x1c5']]],
}],
  'kiocb': [ size : 0x28, {
    'ki_filp': [0x0, ['pointer', ['file']]],
    'ki_pos': [0x8, ['long long']],
    'ki_complete': [0x10, ['pointer', ['void']]],
    'private': [0x18, ['pointer', ['void']]],
    'ki_flags': [0x20, ['int']],
}],
  'ethtool_rxnfc': [ size : 0xc0, {
    'cmd': [0x0, ['unsigned int']],
    'flow_type': [0x4, ['unsigned int']],
    'data': [0x8, ['unsigned long long']],
    'fs': [0x10, ['ethtool_rx_flow_spec']],
    'rule_cnt': [0xb8, ['unsigned int']],
    'rule_locs': [0xbc, ['array', 0, ['unsigned int']]],
}],
  'netns_sysctl_ipv6': [ size : 0x70, {
    'hdr': [0x0, ['pointer', ['ctl_table_header']]],
    'route_hdr': [0x8, ['pointer', ['ctl_table_header']]],
    'icmp_hdr': [0x10, ['pointer', ['ctl_table_header']]],
    'frags_hdr': [0x18, ['pointer', ['ctl_table_header']]],
    'xfrm6_hdr': [0x20, ['pointer', ['ctl_table_header']]],
    'bindv6only': [0x28, ['int']],
    'flush_delay': [0x2c, ['int']],
    'ip6_rt_max_size': [0x30, ['int']],
    'ip6_rt_gc_min_interval': [0x34, ['int']],
    'ip6_rt_gc_timeout': [0x38, ['int']],
    'ip6_rt_gc_interval': [0x3c, ['int']],
    'ip6_rt_gc_elasticity': [0x40, ['int']],
    'ip6_rt_mtu_expires': [0x44, ['int']],
    'ip6_rt_min_advmss': [0x48, ['int']],
    'flowlabel_consistency': [0x4c, ['int']],
    'auto_flowlabels': [0x50, ['int']],
    'icmpv6_time': [0x54, ['int']],
    'anycast_src_echo_reply': [0x58, ['int']],
    'ip_nonlocal_bind': [0x5c, ['int']],
    'fwmark_reflect': [0x60, ['int']],
    'idgen_retries': [0x64, ['int']],
    'idgen_delay': [0x68, ['int']],
    'flowlabel_state_ranges': [0x6c, ['int']],
}],
  'sock_fprog_kern': [ size : 0x10, {
    'len': [0x0, ['unsigned short']],
    'filter': [0x8, ['pointer', ['sock_filter']]],
}],
  'pv_irq_ops': [ size : 0x38, {
    'save_fl': [0x0, ['paravirt_callee_save']],
    'restore_fl': [0x8, ['paravirt_callee_save']],
    'irq_disable': [0x10, ['paravirt_callee_save']],
    'irq_enable': [0x18, ['paravirt_callee_save']],
    'safe_halt': [0x20, ['pointer', ['void']]],
    'halt': [0x28, ['pointer', ['void']]],
    'adjust_exception_frame': [0x30, ['pointer', ['void']]],
}],
  '__unnamed_0xefe4': [ size : 0x2, {
    'type': [0x0, ['unsigned char']],
    'code': [0x1, ['unsigned char']],
}],
  'compat_timespec': [ size : 0x8, {
    'tv_sec': [0x0, ['int']],
    'tv_nsec': [0x4, ['int']],
}],
  'ip_options_rcu': [ size : 0x20, {
    'rcu': [0x0, ['callback_head']],
    'opt': [0x10, ['ip_options']],
}],
  'vm_fault': [ size : 0x38, {
    'flags': [0x0, ['unsigned int']],
    'gfp_mask': [0x4, ['unsigned int']],
    'pgoff': [0x8, ['unsigned long']],
    'virtual_address': [0x10, ['pointer', ['void']]],
    'cow_page': [0x18, ['pointer', ['page']]],
    'page': [0x20, ['pointer', ['page']]],
    'max_pgoff': [0x28, ['unsigned long']],
    'pte': [0x30, ['pointer', ['__unnamed_0x9b6']]],
}],
  '__unnamed_0x1a5': [ size : 0x4, {
    'counter': [0x0, ['int']],
}],
  '__unnamed_0x7767': [ size : 0x8, {
    'lock': [0x0, ['spinlock']],
    'count': [0x4, ['int']],
}],
  'radix_tree_root': [ size : 0x10, {
    'height': [0x0, ['unsigned int']],
    'gfp_mask': [0x4, ['unsigned int']],
    'rnode': [0x8, ['pointer', ['radix_tree_node']]],
}],
  'x86_init_resources': [ size : 0x18, {
    'probe_roms': [0x0, ['pointer', ['void']]],
    'reserve_resources': [0x8, ['pointer', ['void']]],
    'memory_setup': [0x10, ['pointer', ['void']]],
}],
  'ethtool_dump': [ size : 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'version': [0x4, ['unsigned int']],
    'flag': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['unsigned char']]],
}],
  'address_space': [ size : 0x98, {
    'host': [0x0, ['pointer', ['inode']]],
    'page_tree': [0x8, ['radix_tree_root']],
    'tree_lock': [0x18, ['spinlock']],
    'i_mmap_writable': [0x1c, ['__unnamed_0x351']],
    'i_mmap': [0x20, ['rb_root']],
    'i_mmap_rwsem': [0x28, ['rw_semaphore']],
    'nrpages': [0x50, ['unsigned long']],
    'nrshadows': [0x58, ['unsigned long']],
    'writeback_index': [0x60, ['unsigned long']],
    'a_ops': [0x68, ['pointer', ['address_space_operations']]],
    'flags': [0x70, ['unsigned long']],
    'private_lock': [0x78, ['spinlock']],
    'private_list': [0x80, ['list_head']],
    'private_data': [0x90, ['pointer', ['void']]],
}],
  'mutex': [ size : 0x28, {
    'count': [0x0, ['__unnamed_0x1a5']],
    'wait_lock': [0x4, ['spinlock']],
    'wait_list': [0x8, ['list_head']],
    'owner': [0x18, ['pointer', ['task_struct']]],
    'osq': [0x20, ['optimistic_spin_queue']],
}],
  '__unnamed_0x410f': [ size : 0x8, {
    'arr': [0x0, ['pointer', ['kparam_array']]],
    'str': [0x0, ['pointer', ['kparam_string']]],
    'arg': [0x0, ['pointer', ['void']]],
}],
  'ifmcaddr6': [ size : 0xb8, {
    'mca_addr': [0x0, ['in6_addr']],
    'idev': [0x10, ['pointer', ['inet6_dev']]],
    'next': [0x18, ['pointer', ['ifmcaddr6']]],
    'mca_sources': [0x20, ['pointer', ['ip6_sf_list']]],
    'mca_tomb': [0x28, ['pointer', ['ip6_sf_list']]],
    'mca_sfmode': [0x30, ['unsigned int']],
    'mca_crcount': [0x34, ['unsigned char']],
    'mca_sfcount': [0x38, ['array', 2, ['unsigned long']]],
    'mca_timer': [0x48, ['timer_list']],
    'mca_flags': [0x98, ['unsigned int']],
    'mca_users': [0x9c, ['int']],
    'mca_refcnt': [0xa0, ['__unnamed_0x351']],
    'mca_lock': [0xa4, ['spinlock']],
    'mca_cstamp': [0xa8, ['unsigned long']],
    'mca_tstamp': [0xb0, ['unsigned long']],
}],
  '__unnamed_0x58c3': [ size : 0x8, {
    'ptl': [0x0, ['spinlock']],
    'slab_cache': [0x0, ['pointer', ['kmem_cache']]],
    'private': [0x0, ['unsigned long']],
}],
  'mem_cgroup': [ size : 0x3c8, {
    'css': [0x0, ['cgroup_subsys_state']],
    'id': [0xb8, ['mem_cgroup_id']],
    'memory': [0xc0, ['page_counter']],
    'memsw': [0xe8, ['page_counter']],
    'kmem': [0x110, ['page_counter']],
    'low': [0x138, ['unsigned long']],
    'high': [0x140, ['unsigned long']],
    'soft_limit': [0x148, ['unsigned long']],
    'vmpressure': [0x150, ['vmpressure']],
    'initialized': [0x1c0, ['int']],
    'use_hierarchy': [0x1c4, ['unsigned char']],
    'oom_lock': [0x1c5, ['unsigned char']],
    'under_oom': [0x1c8, ['int']],
    'swappiness': [0x1cc, ['int']],
    'oom_kill_disable': [0x1d0, ['int']],
    'events_file': [0x1d8, ['cgroup_file']],
    'thresholds_lock': [0x1e0, ['mutex']],
    'thresholds': [0x208, ['mem_cgroup_thresholds']],
    'memsw_thresholds': [0x218, ['mem_cgroup_thresholds']],
    'oom_notify': [0x228, ['list_head']],
    'move_charge_at_immigrate': [0x238, ['unsigned long']],
    'moving_account': [0x240, ['__unnamed_0x351']],
    'move_lock': [0x244, ['spinlock']],
    'move_lock_task': [0x248, ['pointer', ['task_struct']]],
    'move_lock_flags': [0x250, ['unsigned long']],
    'stat': [0x258, ['pointer', ['mem_cgroup_stat_cpu']]],
    'tcp_mem': [0x260, ['cg_proto']],
    'kmemcg_id': [0x2e0, ['int']],
    'kmem_acct_activated': [0x2e4, ['unsigned char']],
    'kmem_acct_active': [0x2e5, ['unsigned char']],
    'last_scanned_node': [0x2e8, ['int']],
    'scan_nodes': [0x2f0, ['__unnamed_0x2e17']],
    'numainfo_events': [0x2f8, ['__unnamed_0x351']],
    'numainfo_updating': [0x2fc, ['__unnamed_0x351']],
    'cgwb_list': [0x300, ['list_head']],
    'cgwb_domain': [0x310, ['wb_domain']],
    'event_list': [0x3b0, ['list_head']],
    'event_list_lock': [0x3c0, ['spinlock']],
    'nodeinfo': [0x3c8, ['array', 0, ['pointer', ['mem_cgroup_per_node']]]],
}],
  'fxregs_state': [ size : 0x200, {
    'cwd': [0x0, ['unsigned short']],
    'swd': [0x2, ['unsigned short']],
    'twd': [0x4, ['unsigned short']],
    'fop': [0x6, ['unsigned short']],
    '__unnamed_0x167c': [0x8, ['__unnamed_0x15fd']],
    'mxcsr': [0x18, ['unsigned int']],
    'mxcsr_mask': [0x1c, ['unsigned int']],
    'st_space': [0x20, ['array', 32, ['unsigned int']]],
    'xmm_space': [0xa0, ['array', 64, ['unsigned int']]],
    'padding': [0x1a0, ['array', 12, ['unsigned int']]],
    '__unnamed_0x16bf': [0x1d0, ['__unnamed_0x1610']],
}],
  'net_device_stats': [ size : 0xb8, {
    'rx_packets': [0x0, ['unsigned long']],
    'tx_packets': [0x8, ['unsigned long']],
    'rx_bytes': [0x10, ['unsigned long']],
    'tx_bytes': [0x18, ['unsigned long']],
    'rx_errors': [0x20, ['unsigned long']],
    'tx_errors': [0x28, ['unsigned long']],
    'rx_dropped': [0x30, ['unsigned long']],
    'tx_dropped': [0x38, ['unsigned long']],
    'multicast': [0x40, ['unsigned long']],
    'collisions': [0x48, ['unsigned long']],
    'rx_length_errors': [0x50, ['unsigned long']],
    'rx_over_errors': [0x58, ['unsigned long']],
    'rx_crc_errors': [0x60, ['unsigned long']],
    'rx_frame_errors': [0x68, ['unsigned long']],
    'rx_fifo_errors': [0x70, ['unsigned long']],
    'rx_missed_errors': [0x78, ['unsigned long']],
    'tx_aborted_errors': [0x80, ['unsigned long']],
    'tx_carrier_errors': [0x88, ['unsigned long']],
    'tx_fifo_errors': [0x90, ['unsigned long']],
    'tx_heartbeat_errors': [0x98, ['unsigned long']],
    'tx_window_errors': [0xa0, ['unsigned long']],
    'rx_compressed': [0xa8, ['unsigned long']],
    'tx_compressed': [0xb0, ['unsigned long']],
}],
  '__unnamed_0x7788': [ size : 0x8, {
    '__unnamed_0x779b': [0x0, ['__unnamed_0x7767']],
    'lock_count': [0x0, ['unsigned long long']],
}],
  'inet_cork_full': [ size : 0x70, {
    'base': [0x0, ['inet_cork']],
    'fl': [0x28, ['flowi']],
}],
  'task_delay_info': [ size : 0x40, {
    'lock': [0x0, ['spinlock']],
    'flags': [0x4, ['unsigned int']],
    'blkio_start': [0x8, ['unsigned long long']],
    'blkio_delay': [0x10, ['unsigned long long']],
    'swapin_delay': [0x18, ['unsigned long long']],
    'blkio_count': [0x20, ['unsigned int']],
    'swapin_count': [0x24, ['unsigned int']],
    'freepages_start': [0x28, ['unsigned long long']],
    'freepages_delay': [0x30, ['unsigned long long']],
    'freepages_count': [0x38, ['unsigned int']],
}],
  'ethtool_channels': [ size : 0x24, {
    'cmd': [0x0, ['unsigned int']],
    'max_rx': [0x4, ['unsigned int']],
    'max_tx': [0x8, ['unsigned int']],
    'max_other': [0xc, ['unsigned int']],
    'max_combined': [0x10, ['unsigned int']],
    'rx_count': [0x14, ['unsigned int']],
    'tx_count': [0x18, ['unsigned int']],
    'other_count': [0x1c, ['unsigned int']],
    'combined_count': [0x20, ['unsigned int']],
}],
  'xps_map': [ size : 0x18, {
    'len': [0x0, ['unsigned int']],
    'alloc_len': [0x4, ['unsigned int']],
    'rcu': [0x8, ['callback_head']],
    'queues': [0x18, ['array', 0, ['unsigned short']]],
}],
  'compat_robust_list_head': [ size : 0xc, {
    'list': [0x0, ['compat_robust_list']],
    'futex_offset': [0x4, ['int']],
    'list_op_pending': [0x8, ['unsigned int']],
}],
  '__unnamed_0x2b74': [ size : 0x8, {
    'raw_lock': [0x0, ['qrwlock']],
}],
  'ethtool_eee': [ size : 0x28, {
    'cmd': [0x0, ['unsigned int']],
    'supported': [0x4, ['unsigned int']],
    'advertised': [0x8, ['unsigned int']],
    'lp_advertised': [0xc, ['unsigned int']],
    'eee_active': [0x10, ['unsigned int']],
    'eee_enabled': [0x14, ['unsigned int']],
    'tx_lpi_enabled': [0x18, ['unsigned int']],
    'tx_lpi_timer': [0x1c, ['unsigned int']],
    'reserved': [0x20, ['array', 2, ['unsigned int']]],
}],
  'key': [ size : 0xc0, {
    'usage': [0x0, ['__unnamed_0x351']],
    'serial': [0x4, ['int']],
    '__unnamed_0xba6f': [0x8, ['__unnamed_0xb999']],
    'sem': [0x20, ['rw_semaphore']],
    'user': [0x48, ['pointer', ['key_user']]],
    'security': [0x50, ['pointer', ['void']]],
    '__unnamed_0xba99': [0x58, ['__unnamed_0xb9b8']],
    'last_used_at': [0x60, ['long']],
    'uid': [0x68, ['__unnamed_0x2c81']],
    'gid': [0x6c, ['__unnamed_0x2ca1']],
    'perm': [0x70, ['unsigned int']],
    'quotalen': [0x74, ['unsigned short']],
    'datalen': [0x76, ['unsigned short']],
    'state': [0x78, ['short']],
    'flags': [0x80, ['unsigned long']],
    '__unnamed_0xbaff': [0x88, ['__unnamed_0xb9f8']],
    '__unnamed_0xbb05': [0xa0, ['__unnamed_0xba32']],
}],
  'user_namespace': [ size : 0x130, {
    'uid_map': [0x0, ['uid_gid_map']],
    'gid_map': [0x40, ['uid_gid_map']],
    'projid_map': [0x80, ['uid_gid_map']],
    'count': [0xc0, ['__unnamed_0x351']],
    'parent': [0xc8, ['pointer', ['user_namespace']]],
    'level': [0xd0, ['int']],
    'owner': [0xd4, ['__unnamed_0x2c81']],
    'group': [0xd8, ['__unnamed_0x2ca1']],
    'ns': [0xe0, ['ns_common']],
    'flags': [0xf8, ['unsigned long']],
    'persistent_keyring_register': [0x100, ['pointer', ['key']]],
    'persistent_keyring_register_sem': [0x108, ['rw_semaphore']],
}],
  '__unnamed_0xb9f8': [ size : 0x18, {
    '__unnamed_0xba0b': [0x0, ['__unnamed_0xb9d7']],
    'index_key': [0x0, ['keyring_index_key']],
}],
  'mpc_table': [ size : 0x2c, {
    'signature': [0x0, ['array', 4, ['char']]],
    'length': [0x4, ['unsigned short']],
    'spec': [0x6, ['char']],
    'checksum': [0x7, ['char']],
    'oem': [0x8, ['array', 8, ['char']]],
    'productid': [0x10, ['array', 12, ['char']]],
    'oemptr': [0x1c, ['unsigned int']],
    'oemsize': [0x20, ['unsigned short']],
    'oemcount': [0x22, ['unsigned short']],
    'lapic': [0x24, ['unsigned int']],
    'reserved': [0x28, ['unsigned int']],
}],
  'sigaction': [ size : 0x20, {
    'sa_handler': [0x0, ['pointer', ['void']]],
    'sa_flags': [0x8, ['unsigned long']],
    'sa_restorer': [0x10, ['pointer', ['void']]],
    'sa_mask': [0x18, ['__unnamed_0xb250']],
}],
  'x86_init_oem': [ size : 0x10, {
    'arch_setup': [0x0, ['pointer', ['void']]],
    'banner': [0x8, ['pointer', ['void']]],
}],
  'swregs_state': [ size : 0x88, {
    'cwd': [0x0, ['unsigned int']],
    'swd': [0x4, ['unsigned int']],
    'twd': [0x8, ['unsigned int']],
    'fip': [0xc, ['unsigned int']],
    'fcs': [0x10, ['unsigned int']],
    'foo': [0x14, ['unsigned int']],
    'fos': [0x18, ['unsigned int']],
    'st_space': [0x1c, ['array', 20, ['unsigned int']]],
    'ftop': [0x6c, ['unsigned char']],
    'changed': [0x6d, ['unsigned char']],
    'lookahead': [0x6e, ['unsigned char']],
    'no_update': [0x6f, ['unsigned char']],
    'rm': [0x70, ['unsigned char']],
    'alimit': [0x71, ['unsigned char']],
    'info': [0x78, ['pointer', ['math_emu_info']]],
    'entry_eip': [0x80, ['unsigned int']],
}],
  'task_rss_stat': [ size : 0x10, {
    'events': [0x0, ['int']],
    'count': [0x4, ['array', 3, ['int']]],
}],
  '__unnamed_0x102e0': [ size : 0x4, {
    'dlci': [0x0, ['unsigned int']],
}],
  'ifreq': [ size : 0x28, {
    'ifr_ifrn': [0x0, ['__unnamed_0x1045d']],
    'ifr_ifru': [0x10, ['__unnamed_0x10471']],
}],
  '__unnamed_0x1863a': [ size : 0x8, {
    'skc_flags': [0x0, ['unsigned long']],
    'skc_tw_dr': [0x0, ['pointer', ['inet_timewait_death_row']]],
    'skc_listener': [0x0, ['pointer', ['sock']]],
}],
  'tcp_seq_afinfo': [ size : 0x38, {
    'name': [0x0, ['pointer', ['char']]],
    'family': [0x8, ['unsigned short']],
    'seq_fops': [0x10, ['pointer', ['file_operations']]],
    'seq_ops': [0x18, ['seq_operations']],
}],
  'kernfs_syscall_ops': [ size : 0x30, {
    'remount_fs': [0x0, ['pointer', ['void']]],
    'show_options': [0x8, ['pointer', ['void']]],
    'mkdir': [0x10, ['pointer', ['void']]],
    'rmdir': [0x18, ['pointer', ['void']]],
    'rename': [0x20, ['pointer', ['void']]],
    'show_path': [0x28, ['pointer', ['void']]],
}],
  'msghdr': [ size : 0x58, {
    'msg_name': [0x0, ['pointer', ['void']]],
    'msg_namelen': [0x8, ['int']],
    'msg_iter': [0x10, ['iov_iter']],
    'msg_control': [0x38, ['pointer', ['void']]],
    'msg_controllen': [0x40, ['unsigned long']],
    'msg_flags': [0x48, ['unsigned int']],
    'msg_iocb': [0x50, ['pointer', ['kiocb']]],
}],
  'tc_to_netdev': [ size : 0x10, {
    'type': [0x0, ['unsigned int']],
    '__unnamed_0x15c08': [0x8, ['__unnamed_0x15bc2']],
}],
  'inet_hashinfo': [ size : 0x240, {
    'ehash': [0x0, ['pointer', ['inet_ehash_bucket']]],
    'ehash_locks': [0x8, ['pointer', ['spinlock']]],
    'ehash_mask': [0x10, ['unsigned int']],
    'ehash_locks_mask': [0x14, ['unsigned int']],
    'bhash': [0x18, ['pointer', ['inet_bind_hashbucket']]],
    'bhash_size': [0x20, ['unsigned int']],
    'bind_bucket_cachep': [0x28, ['pointer', ['kmem_cache']]],
    'listening_hash': [0x40, ['array', 32, ['inet_listen_hashbucket']]],
}],
  'tty_bufhead': [ size : 0x90, {
    'head': [0x0, ['pointer', ['tty_buffer']]],
    'work': [0x8, ['work_struct']],
    'lock': [0x28, ['mutex']],
    'priority': [0x50, ['__unnamed_0x351']],
    'sentinel': [0x58, ['tty_buffer']],
    'free': [0x78, ['llist_head']],
    'mem_used': [0x80, ['__unnamed_0x351']],
    'mem_limit': [0x84, ['int']],
    'tail': [0x88, ['pointer', ['tty_buffer']]],
}],
  'flowi4': [ size : 0x30, {
    '__fl_common': [0x0, ['flowi_common']],
    'saddr': [0x20, ['unsigned int']],
    'daddr': [0x24, ['unsigned int']],
    'uli': [0x28, ['flowi_uli']],
}],
  'ethtool_tcpip4_spec': [ size : 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'psrc': [0x8, ['unsigned short']],
    'pdst': [0xa, ['unsigned short']],
    'tos': [0xc, ['unsigned char']],
}],
  'fpregs_state': [ size : 0x1000, {
    'fsave': [0x0, ['fregs_state']],
    '__padding': [0x0, ['array', 4096, ['unsigned char']]],
    'xsave': [0x0, ['xregs_state']],
    'soft': [0x0, ['swregs_state']],
    'fxsave': [0x0, ['fxregs_state']],
}],
  'module_attribute': [ size : 0x38, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
    'setup': [0x20, ['pointer', ['void']]],
    'test': [0x28, ['pointer', ['void']]],
    'free': [0x30, ['pointer', ['void']]],
}],
  'qrwlock': [ size : 0x8, {
    'cnts': [0x0, ['__unnamed_0x351']],
    'wait_lock': [0x4, ['qspinlock']],
}],
  'inet_bind_hashbucket': [ size : 0x10, {
    'lock': [0x0, ['spinlock']],
    'chain': [0x8, ['hlist_head']],
}],
  'ctl_table_poll': [ size : 0x20, {
    'event': [0x0, ['__unnamed_0x351']],
    'wait': [0x8, ['__wait_queue_head']],
}],
  'inode': [ size : 0x230, {
    'i_mode': [0x0, ['unsigned short']],
    'i_opflags': [0x2, ['unsigned short']],
    'i_uid': [0x4, ['__unnamed_0x2c81']],
    'i_gid': [0x8, ['__unnamed_0x2ca1']],
    'i_flags': [0xc, ['unsigned int']],
    'i_acl': [0x10, ['pointer', ['posix_acl']]],
    'i_default_acl': [0x18, ['pointer', ['posix_acl']]],
    'i_op': [0x20, ['pointer', ['inode_operations']]],
    'i_sb': [0x28, ['pointer', ['super_block']]],
    'i_mapping': [0x30, ['pointer', ['address_space']]],
    'i_security': [0x38, ['pointer', ['void']]],
    'i_ino': [0x40, ['unsigned long']],
    '__unnamed_0x78e1': [0x48, ['__unnamed_0x9a85']],
    'i_rdev': [0x4c, ['unsigned int']],
    'i_size': [0x50, ['long long']],
    'i_atime': [0x58, ['timespec']],
    'i_mtime': [0x68, ['timespec']],
    'i_ctime': [0x78, ['timespec']],
    'i_lock': [0x88, ['spinlock']],
    'i_bytes': [0x8c, ['unsigned short']],
    'i_blkbits': [0x90, ['unsigned int']],
    'i_blocks': [0x98, ['unsigned long']],
    'i_state': [0xa0, ['unsigned long']],
    'i_mutex': [0xa8, ['mutex']],
    'dirtied_when': [0xd0, ['unsigned long']],
    'dirtied_time_when': [0xd8, ['unsigned long']],
    'i_hash': [0xe0, ['hlist_node']],
    'i_io_list': [0xf0, ['list_head']],
    'i_wb': [0x100, ['pointer', ['bdi_writeback']]],
    'i_wb_frn_winner': [0x108, ['int']],
    'i_wb_frn_avg_time': [0x10c, ['unsigned short']],
    'i_wb_frn_history': [0x10e, ['unsigned short']],
    'i_lru': [0x110, ['list_head']],
    'i_sb_list': [0x120, ['list_head']],
    '__unnamed_0x79fe': [0x130, ['__unnamed_0x9aac']],
    'i_version': [0x140, ['unsigned long long']],
    'i_count': [0x148, ['__unnamed_0x351']],
    'i_dio_count': [0x14c, ['__unnamed_0x351']],
    'i_writecount': [0x150, ['__unnamed_0x351']],
    'i_readcount': [0x154, ['__unnamed_0x351']],
    'i_fop': [0x158, ['pointer', ['file_operations']]],
    'i_flctx': [0x160, ['pointer', ['file_lock_context']]],
    'i_data': [0x168, ['address_space']],
    'i_devices': [0x200, ['list_head']],
    '__unnamed_0x7a83': [0x210, ['__unnamed_0x9ace']],
    'i_generation': [0x218, ['unsigned int']],
    'i_fsnotify_mask': [0x21c, ['unsigned int']],
    'i_fsnotify_marks': [0x220, ['hlist_head']],
    'i_private': [0x228, ['pointer', ['void']]],
}],
  'free_area': [ size : 0x68, {
    'free_list': [0x0, ['array', 6, ['list_head']]],
    'nr_free': [0x60, ['unsigned long']],
}],
  'sched_avg': [ size : 0x28, {
    'last_update_time': [0x0, ['unsigned long long']],
    'load_sum': [0x8, ['unsigned long long']],
    'util_sum': [0x10, ['unsigned int']],
    'period_contrib': [0x14, ['unsigned int']],
    'load_avg': [0x18, ['unsigned long']],
    'util_avg': [0x20, ['unsigned long']],
}],
  'ethtool_link_ksettings': [ size : 0x48, {
    'base': [0x0, ['ethtool_link_settings']],
    'link_modes': [0x30, ['__unnamed_0x111be']],
}],
  'linux_mib': [ size : 0x3a8, {
    'mibs': [0x0, ['array', 117, ['unsigned long']]],
}],
  'quota_format_ops': [ size : 0x38, {
    'check_quota_file': [0x0, ['pointer', ['void']]],
    'read_file_info': [0x8, ['pointer', ['void']]],
    'write_file_info': [0x10, ['pointer', ['void']]],
    'free_file_info': [0x18, ['pointer', ['void']]],
    'read_dqblk': [0x20, ['pointer', ['void']]],
    'commit_dqblk': [0x28, ['pointer', ['void']]],
    'release_dqblk': [0x30, ['pointer', ['void']]],
}],
  'cgroup_file': [ size : 0x8, {
    'kn': [0x0, ['pointer', ['kernfs_node']]],
}],
  'in6_addr': [ size : 0x10, {
    'in6_u': [0x0, ['__unnamed_0xed30']],
}],
  '__unnamed_0x103ad': [ size : 0x8, {
    'fr': [0x0, ['pointer', ['__unnamed_0x10278']]],
    'fr_pvc_info': [0x0, ['pointer', ['__unnamed_0x10300']]],
    'sync': [0x0, ['pointer', ['__unnamed_0x101d0']]],
    'fr_pvc': [0x0, ['pointer', ['__unnamed_0x102e0']]],
    'te1': [0x0, ['pointer', ['__unnamed_0x10208']]],
    'cisco': [0x0, ['pointer', ['__unnamed_0x1032c']]],
    'raw_hdlc': [0x0, ['pointer', ['__unnamed_0x1024c']]],
}],
  'ctl_table': [ size : 0x40, {
    'procname': [0x0, ['pointer', ['char']]],
    'data': [0x8, ['pointer', ['void']]],
    'maxlen': [0x10, ['int']],
    'mode': [0x14, ['unsigned short']],
    'child': [0x18, ['pointer', ['ctl_table']]],
    'proc_handler': [0x20, ['pointer', ['void']]],
    'poll': [0x28, ['pointer', ['ctl_table_poll']]],
    'extra1': [0x30, ['pointer', ['void']]],
    'extra2': [0x38, ['pointer', ['void']]],
}],
  '__unnamed_0x5a9': [ size : 0x20, {
    'ufds': [0x0, ['pointer', ['pollfd']]],
    'nfds': [0x8, ['int']],
    'has_timeout': [0xc, ['int']],
    'tv_sec': [0x10, ['unsigned long']],
    'tv_nsec': [0x18, ['unsigned long']],
}],
  'kernfs_open_file': [ size : 0x78, {
    'kn': [0x0, ['pointer', ['kernfs_node']]],
    'file': [0x8, ['pointer', ['file']]],
    'priv': [0x10, ['pointer', ['void']]],
    'mutex': [0x18, ['mutex']],
    'event': [0x40, ['int']],
    'list': [0x48, ['list_head']],
    'prealloc_buf': [0x58, ['pointer', ['char']]],
    'atomic_write_len': [0x60, ['unsigned long']],
    'mmapped': [0x68, ['unsigned char']],
    'vm_ops': [0x70, ['pointer', ['vm_operations_struct']]],
}],
  'k_sigaction': [ size : 0x20, {
    'sa': [0x0, ['sigaction']],
}],
  'pv_info': [ size : 0x20, {
    'kernel_rpl': [0x0, ['unsigned int']],
    'shared_kernel_pmd': [0x4, ['int']],
    'extra_user_64bit_cs': [0x8, ['unsigned short']],
    'paravirt_enabled': [0xc, ['int']],
    'features': [0x10, ['unsigned int']],
    'name': [0x18, ['pointer', ['char']]],
}],
  'pv_mmu_ops': [ size : 0x158, {
    'read_cr2': [0x0, ['pointer', ['void']]],
    'write_cr2': [0x8, ['pointer', ['void']]],
    'read_cr3': [0x10, ['pointer', ['void']]],
    'write_cr3': [0x18, ['pointer', ['void']]],
    'activate_mm': [0x20, ['pointer', ['void']]],
    'dup_mmap': [0x28, ['pointer', ['void']]],
    'exit_mmap': [0x30, ['pointer', ['void']]],
    'flush_tlb_user': [0x38, ['pointer', ['void']]],
    'flush_tlb_kernel': [0x40, ['pointer', ['void']]],
    'flush_tlb_single': [0x48, ['pointer', ['void']]],
    'flush_tlb_others': [0x50, ['pointer', ['void']]],
    'pgd_alloc': [0x58, ['pointer', ['void']]],
    'pgd_free': [0x60, ['pointer', ['void']]],
    'alloc_pte': [0x68, ['pointer', ['void']]],
    'alloc_pmd': [0x70, ['pointer', ['void']]],
    'alloc_pud': [0x78, ['pointer', ['void']]],
    'release_pte': [0x80, ['pointer', ['void']]],
    'release_pmd': [0x88, ['pointer', ['void']]],
    'release_pud': [0x90, ['pointer', ['void']]],
    'set_pte': [0x98, ['pointer', ['void']]],
    'set_pte_at': [0xa0, ['pointer', ['void']]],
    'set_pmd': [0xa8, ['pointer', ['void']]],
    'set_pmd_at': [0xb0, ['pointer', ['void']]],
    'pte_update': [0xb8, ['pointer', ['void']]],
    'pte_update_defer': [0xc0, ['pointer', ['void']]],
    'pmd_update': [0xc8, ['pointer', ['void']]],
    'pmd_update_defer': [0xd0, ['pointer', ['void']]],
    'ptep_modify_prot_start': [0xd8, ['pointer', ['void']]],
    'ptep_modify_prot_commit': [0xe0, ['pointer', ['void']]],
    'pte_val': [0xe8, ['paravirt_callee_save']],
    'make_pte': [0xf0, ['paravirt_callee_save']],
    'pgd_val': [0xf8, ['paravirt_callee_save']],
    'make_pgd': [0x100, ['paravirt_callee_save']],
    'set_pud': [0x108, ['pointer', ['void']]],
    'pmd_val': [0x110, ['paravirt_callee_save']],
    'make_pmd': [0x118, ['paravirt_callee_save']],
    'pud_val': [0x120, ['paravirt_callee_save']],
    'make_pud': [0x128, ['paravirt_callee_save']],
    'set_pgd': [0x130, ['pointer', ['void']]],
    'lazy_mode': [0x138, ['pv_lazy_ops']],
    'set_fixmap': [0x150, ['pointer', ['void']]],
}],
  'cgroup_namespace': [ size : 0x30, {
    'count': [0x0, ['__unnamed_0x351']],
    'ns': [0x8, ['ns_common']],
    'user_ns': [0x20, ['pointer', ['user_namespace']]],
    'root_cset': [0x28, ['pointer', ['css_set']]],
}],
  'gnet_stats_basic_packed': [ size : 0xc, {
    'bytes': [0x0, ['unsigned long long']],
    'packets': [0x8, ['unsigned int']],
}],
  'pm_message': [ size : 0x4, {
    'event': [0x0, ['int']],
}],
  'neighbour': [ size : 0x198, {
    'next': [0x0, ['pointer', ['neighbour']]],
    'tbl': [0x8, ['pointer', ['neigh_table']]],
    'parms': [0x10, ['pointer', ['neigh_parms']]],
    'confirmed': [0x18, ['unsigned long']],
    'updated': [0x20, ['unsigned long']],
    'lock': [0x28, ['__unnamed_0x2b74']],
    'refcnt': [0x30, ['__unnamed_0x351']],
    'arp_queue': [0x38, ['sk_buff_head']],
    'arp_queue_len_bytes': [0x50, ['unsigned int']],
    'timer': [0x58, ['timer_list']],
    'used': [0xa8, ['unsigned long']],
    'probes': [0xb0, ['__unnamed_0x351']],
    'flags': [0xb4, ['unsigned char']],
    'nud_state': [0xb5, ['unsigned char']],
    'type': [0xb6, ['unsigned char']],
    'dead': [0xb7, ['unsigned char']],
    'ha_lock': [0xb8, ['__unnamed_0x2c51']],
    'ha': [0xc0, ['array', 32, ['unsigned char']]],
    'hh': [0xe0, ['hh_cache']],
    'output': [0x170, ['pointer', ['void']]],
    'ops': [0x178, ['pointer', ['neigh_ops']]],
    'rcu': [0x180, ['callback_head']],
    'dev': [0x190, ['pointer', ['net_device']]],
    'primary_key': [0x198, ['array', 0, ['unsigned char']]],
}],
  'cpuinfo_x86': [ size : 0xe8, {
    'x86': [0x0, ['unsigned char']],
    'x86_vendor': [0x1, ['unsigned char']],
    'x86_model': [0x2, ['unsigned char']],
    'x86_mask': [0x3, ['unsigned char']],
    'x86_tlbsize': [0x4, ['int']],
    'x86_virt_bits': [0x8, ['unsigned char']],
    'x86_phys_bits': [0x9, ['unsigned char']],
    'x86_coreid_bits': [0xa, ['unsigned char']],
    'extended_cpuid_level': [0xc, ['unsigned int']],
    'cpuid_level': [0x10, ['int']],
    'x86_capability': [0x14, ['array', 20, ['unsigned int']]],
    'x86_vendor_id': [0x64, ['array', 16, ['char']]],
    'x86_model_id': [0x74, ['array', 64, ['char']]],
    'x86_cache_size': [0xb4, ['unsigned int']],
    'x86_cache_alignment': [0xb8, ['int']],
    'x86_cache_max_rmid': [0xbc, ['int']],
    'x86_cache_occ_scale': [0xc0, ['int']],
    'x86_power': [0xc4, ['int']],
    'loops_per_jiffy': [0xc8, ['unsigned long']],
    'x86_max_cores': [0xd0, ['unsigned short']],
    'apicid': [0xd2, ['unsigned short']],
    'initial_apicid': [0xd4, ['unsigned short']],
    'x86_clflush_size': [0xd6, ['unsigned short']],
    'booted_cores': [0xd8, ['unsigned short']],
    'phys_proc_id': [0xda, ['unsigned short']],
    'logical_proc_id': [0xdc, ['unsigned short']],
    'cpu_core_id': [0xde, ['unsigned short']],
    'compute_unit_id': [0xe0, ['unsigned char']],
    'cpu_index': [0xe2, ['unsigned short']],
    'microcode': [0xe4, ['unsigned int']],
}],
  'pollfd': [ size : 0x8, {
    'fd': [0x0, ['int']],
    'events': [0x4, ['short']],
    'revents': [0x6, ['short']],
}],
  'static_key_true': [ size : 0x18, {
    'key': [0x0, ['static_key']],
}],
  'physid_mask': [ size : 0x1000, {
    'mask': [0x0, ['array', 512, ['unsigned long']]],
}],
  'unix_sock': [ size : 0x400, {
    'sk': [0x0, ['sock']],
    'addr': [0x2c0, ['pointer', ['unix_address']]],
    'path': [0x2c8, ['path']],
    'iolock': [0x2d8, ['mutex']],
    'bindlock': [0x300, ['mutex']],
    'peer': [0x328, ['pointer', ['sock']]],
    'link': [0x330, ['list_head']],
    'inflight': [0x340, ['__unnamed_0x371']],
    'lock': [0x348, ['spinlock']],
    'recursion_level': [0x34c, ['unsigned char']],
    'gc_flags': [0x350, ['unsigned long']],
    'peer_wq': [0x380, ['socket_wq']],
    'peer_wake': [0x3c0, ['__wait_queue']],
}],
  '__unnamed_0x15c4': [ size : 0x10, {
    'fip': [0x0, ['unsigned int']],
    'fcs': [0x4, ['unsigned int']],
    'foo': [0x8, ['unsigned int']],
    'fos': [0xc, ['unsigned int']],
}],
  'mem_dqblk': [ size : 0x48, {
    'dqb_bhardlimit': [0x0, ['long long']],
    'dqb_bsoftlimit': [0x8, ['long long']],
    'dqb_curspace': [0x10, ['long long']],
    'dqb_rsvspace': [0x18, ['long long']],
    'dqb_ihardlimit': [0x20, ['long long']],
    'dqb_isoftlimit': [0x28, ['long long']],
    'dqb_curinodes': [0x30, ['long long']],
    'dqb_btime': [0x38, ['long']],
    'dqb_itime': [0x40, ['long']],
}],
  'block_device': [ size : 0xf8, {
    'bd_dev': [0x0, ['unsigned int']],
    'bd_openers': [0x4, ['int']],
    'bd_inode': [0x8, ['pointer', ['inode']]],
    'bd_super': [0x10, ['pointer', ['super_block']]],
    'bd_mutex': [0x18, ['mutex']],
    'bd_inodes': [0x40, ['list_head']],
    'bd_claiming': [0x50, ['pointer', ['void']]],
    'bd_holder': [0x58, ['pointer', ['void']]],
    'bd_holders': [0x60, ['int']],
    'bd_write_holder': [0x64, ['unsigned char']],
    'bd_holder_disks': [0x68, ['list_head']],
    'bd_contains': [0x78, ['pointer', ['block_device']]],
    'bd_block_size': [0x80, ['unsigned int']],
    'bd_part': [0x88, ['pointer', ['hd_struct']]],
    'bd_part_count': [0x90, ['unsigned int']],
    'bd_invalidated': [0x94, ['int']],
    'bd_disk': [0x98, ['pointer', ['gendisk']]],
    'bd_queue': [0xa0, ['pointer', ['request_queue']]],
    'bd_bdi': [0xa8, ['pointer', ['backing_dev_info']]],
    'bd_list': [0xb0, ['list_head']],
    'bd_private': [0xc0, ['unsigned long']],
    'bd_fsfreeze_count': [0xc8, ['int']],
    'bd_fsfreeze_mutex': [0xd0, ['mutex']],
}],
  'inetpeer_addr': [ size : 0x14, {
    '__unnamed_0x19db5': [0x0, ['__unnamed_0x19d71']],
    'family': [0x10, ['unsigned short']],
}],
  'mount': [ size : 0x108, {
    'mnt_hash': [0x0, ['list_head']],
    'mnt_parent': [0x10, ['pointer', ['mount']]],
    'mnt_mountpoint': [0x18, ['pointer', ['dentry']]],
    'mnt': [0x20, ['vfsmount']],
    'rcu': [0x38, ['callback_head']],
    'mnt_pcp': [0x48, ['pointer', ['mnt_pcp']]],
    'mnt_mounts': [0x50, ['list_head']],
    'mnt_child': [0x60, ['list_head']],
    'mnt_instance': [0x70, ['list_head']],
    'mnt_devname': [0x80, ['pointer', ['char']]],
    'mnt_list': [0x88, ['list_head']],
    'mnt_expire': [0x98, ['list_head']],
    'mnt_share': [0xa8, ['list_head']],
    'mnt_slave_list': [0xb8, ['list_head']],
    'mnt_slave': [0xc8, ['list_head']],
    'mnt_master': [0xd8, ['pointer', ['mount']]],
    'mnt_ns': [0xe0, ['pointer', ['mnt_namespace']]],
    'mnt_fsnotify_marks': [0xe8, ['hlist_head']],
    'mnt_fsnotify_mask': [0xf0, ['unsigned int']],
    'mnt_id': [0xf4, ['int']],
    'mnt_group_id': [0xf8, ['int']],
    'mnt_expiry_mark': [0xfc, ['int']],
    'mnt_pinned': [0x100, ['int']],
    'mnt_ghosts': [0x104, ['int']],
}],
  'acpi_device_id': [ size : 0x20, {
    'id': [0x0, ['array', 9, ['unsigned char']]],
    'driver_data': [0x10, ['unsigned long']],
    'cls': [0x18, ['unsigned int']],
    'cls_msk': [0x1c, ['unsigned int']],
}],
  '__unnamed_0xa4ec': [ size : 0x18, {
    'link': [0x0, ['list_head']],
    'state': [0x10, ['int']],
}],
  'gnet_stats_rate_est64': [ size : 0x10, {
    'bps': [0x0, ['unsigned long long']],
    'pps': [0x8, ['unsigned long long']],
}],
  '__unnamed_0x1662d': [ size : 0x20, {
    'upper': [0x0, ['list_head']],
    'lower': [0x10, ['list_head']],
}],
  'phy_driver': [ size : 0x160, {
    'phy_id': [0x0, ['unsigned int']],
    'name': [0x8, ['pointer', ['char']]],
    'phy_id_mask': [0x10, ['unsigned int']],
    'features': [0x14, ['unsigned int']],
    'flags': [0x18, ['unsigned int']],
    'driver_data': [0x20, ['pointer', ['void']]],
    'soft_reset': [0x28, ['pointer', ['void']]],
    'config_init': [0x30, ['pointer', ['void']]],
    'probe': [0x38, ['pointer', ['void']]],
    'suspend': [0x40, ['pointer', ['void']]],
    'resume': [0x48, ['pointer', ['void']]],
    'config_aneg': [0x50, ['pointer', ['void']]],
    'aneg_done': [0x58, ['pointer', ['void']]],
    'read_status': [0x60, ['pointer', ['void']]],
    'ack_interrupt': [0x68, ['pointer', ['void']]],
    'config_intr': [0x70, ['pointer', ['void']]],
    'did_interrupt': [0x78, ['pointer', ['void']]],
    'remove': [0x80, ['pointer', ['void']]],
    'match_phy_device': [0x88, ['pointer', ['void']]],
    'ts_info': [0x90, ['pointer', ['void']]],
    'hwtstamp': [0x98, ['pointer', ['void']]],
    'rxtstamp': [0xa0, ['pointer', ['void']]],
    'txtstamp': [0xa8, ['pointer', ['void']]],
    'set_wol': [0xb0, ['pointer', ['void']]],
    'get_wol': [0xb8, ['pointer', ['void']]],
    'link_change_notify': [0xc0, ['pointer', ['void']]],
    'read_mmd_indirect': [0xc8, ['pointer', ['void']]],
    'write_mmd_indirect': [0xd0, ['pointer', ['void']]],
    'module_info': [0xd8, ['pointer', ['void']]],
    'module_eeprom': [0xe0, ['pointer', ['void']]],
    'driver': [0xe8, ['device_driver']],
}],
  'property': [ size : 0x68, {
    'name': [0x0, ['pointer', ['char']]],
    'length': [0x8, ['int']],
    'value': [0x10, ['pointer', ['void']]],
    'next': [0x18, ['pointer', ['property']]],
    '_flags': [0x20, ['unsigned long']],
    'unique_id': [0x28, ['unsigned int']],
    'attr': [0x30, ['bin_attribute']],
}],
  '__unnamed_0x574d': [ size : 0x8, {
    'index': [0x0, ['unsigned long']],
    'freelist': [0x0, ['pointer', ['void']]],
}],
  'scatterlist': [ size : 0x20, {
    'page_link': [0x0, ['unsigned long']],
    'offset': [0x8, ['unsigned int']],
    'length': [0xc, ['unsigned int']],
    'dma_address': [0x10, ['unsigned long long']],
    'dma_length': [0x18, ['unsigned int']],
}],
  '__unnamed_0xf14d': [ size : 0x48, {
    'dn': [0x0, ['flowidn']],
    '__fl_common': [0x0, ['flowi_common']],
    'ip6': [0x0, ['flowi6']],
    'ip4': [0x0, ['flowi4']],
}],
  'icmpv6_mib': [ size : 0x30, {
    'mibs': [0x0, ['array', 6, ['unsigned long']]],
}],
  'iovec': [ size : 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['unsigned long']],
}],
  'tcf_proto_ops': [ size : 0x68, {
    'head': [0x0, ['list_head']],
    'kind': [0x10, ['array', 16, ['char']]],
    'classify': [0x20, ['pointer', ['void']]],
    'init': [0x28, ['pointer', ['void']]],
    'destroy': [0x30, ['pointer', ['void']]],
    'get': [0x38, ['pointer', ['void']]],
    'change': [0x40, ['pointer', ['void']]],
    'delete': [0x48, ['pointer', ['void']]],
    'walk': [0x50, ['pointer', ['void']]],
    'dump': [0x58, ['pointer', ['void']]],
    'owner': [0x60, ['pointer', ['module']]],
}],
  'sched_rt_entity': [ size : 0x30, {
    'run_list': [0x0, ['list_head']],
    'timeout': [0x10, ['unsigned long']],
    'watchdog_stamp': [0x18, ['unsigned long']],
    'time_slice': [0x20, ['unsigned int']],
    'back': [0x28, ['pointer', ['sched_rt_entity']]],
}],
  'modversion_info': [ size : 0x40, {
    'crc': [0x0, ['unsigned long']],
    'name': [0x8, ['array', 56, ['char']]],
}],
  'pt_regs': [ size : 0xa8, {
    'r15': [0x0, ['unsigned long']],
    'r14': [0x8, ['unsigned long']],
    'r13': [0x10, ['unsigned long']],
    'r12': [0x18, ['unsigned long']],
    'bp': [0x20, ['unsigned long']],
    'bx': [0x28, ['unsigned long']],
    'r11': [0x30, ['unsigned long']],
    'r10': [0x38, ['unsigned long']],
    'r9': [0x40, ['unsigned long']],
    'r8': [0x48, ['unsigned long']],
    'ax': [0x50, ['unsigned long']],
    'cx': [0x58, ['unsigned long']],
    'dx': [0x60, ['unsigned long']],
    'si': [0x68, ['unsigned long']],
    'di': [0x70, ['unsigned long']],
    'orig_ax': [0x78, ['unsigned long']],
    'ip': [0x80, ['unsigned long']],
    'cs': [0x88, ['unsigned long']],
    'flags': [0x90, ['unsigned long']],
    'sp': [0x98, ['unsigned long']],
    'ss': [0xa0, ['unsigned long']],
}],
  'inet_listen_hashbucket': [ size : 0x10, {
    'lock': [0x0, ['spinlock']],
    'head': [0x8, ['hlist_nulls_head']],
}],
  'uprobes_state': [ size : 0x8, {
    'xol_area': [0x0, ['pointer', ['xol_area']]],
}],
  'signal_struct': [ size : 0x428, {
    'sigcnt': [0x0, ['__unnamed_0x351']],
    'live': [0x4, ['__unnamed_0x351']],
    'nr_threads': [0x8, ['int']],
    'thread_head': [0x10, ['list_head']],
    'wait_chldexit': [0x20, ['__wait_queue_head']],
    'curr_target': [0x38, ['pointer', ['task_struct']]],
    'shared_pending': [0x40, ['sigpending']],
    'group_exit_code': [0x58, ['int']],
    'notify_count': [0x5c, ['int']],
    'group_exit_task': [0x60, ['pointer', ['task_struct']]],
    'group_stop_count': [0x68, ['int']],
    'flags': [0x6c, ['unsigned int']],
    'has_child_subreaper': [0x70, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'is_child_subreaper': [0x70, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'posix_timer_id': [0x74, ['int']],
    'posix_timers': [0x78, ['list_head']],
    'real_timer': [0x88, ['hrtimer']],
    'leader_pid': [0xe0, ['pointer', ['pid']]],
    'it_real_incr': [0xe8, ['ktime']],
    'it': [0xf0, ['array', 2, ['cpu_itimer']]],
    'cputimer': [0x120, ['thread_group_cputimer']],
    'cputime_expires': [0x140, ['task_cputime']],
    'cpu_timers': [0x158, ['array', 3, ['list_head']]],
    'tty_old_pgrp': [0x188, ['pointer', ['pid']]],
    'leader': [0x190, ['int']],
    'tty': [0x198, ['pointer', ['tty_struct']]],
    'autogroup': [0x1a0, ['pointer', ['autogroup']]],
    'stats_lock': [0x1a8, ['__unnamed_0x2c51']],
    'utime': [0x1b0, ['unsigned long']],
    'stime': [0x1b8, ['unsigned long']],
    'cutime': [0x1c0, ['unsigned long']],
    'cstime': [0x1c8, ['unsigned long']],
    'gtime': [0x1d0, ['unsigned long']],
    'cgtime': [0x1d8, ['unsigned long']],
    'prev_cputime': [0x1e0, ['prev_cputime']],
    'nvcsw': [0x1f8, ['unsigned long']],
    'nivcsw': [0x200, ['unsigned long']],
    'cnvcsw': [0x208, ['unsigned long']],
    'cnivcsw': [0x210, ['unsigned long']],
    'min_flt': [0x218, ['unsigned long']],
    'maj_flt': [0x220, ['unsigned long']],
    'cmin_flt': [0x228, ['unsigned long']],
    'cmaj_flt': [0x230, ['unsigned long']],
    'inblock': [0x238, ['unsigned long']],
    'oublock': [0x240, ['unsigned long']],
    'cinblock': [0x248, ['unsigned long']],
    'coublock': [0x250, ['unsigned long']],
    'maxrss': [0x258, ['unsigned long']],
    'cmaxrss': [0x260, ['unsigned long']],
    'ioac': [0x268, ['task_io_accounting']],
    'sum_sched_runtime': [0x2a0, ['unsigned long long']],
    'rlim': [0x2a8, ['array', 16, ['rlimit']]],
    'pacct': [0x3a8, ['pacct_struct']],
    'stats': [0x3e0, ['pointer', ['taskstats']]],
    'audit_tty': [0x3e8, ['unsigned int']],
    'audit_tty_log_passwd': [0x3ec, ['unsigned int']],
    'tty_audit_buf': [0x3f0, ['pointer', ['tty_audit_buf']]],
    'oom_flags': [0x3f8, ['unsigned int']],
    'oom_score_adj': [0x3fc, ['short']],
    'oom_score_adj_min': [0x3fe, ['short']],
    'cred_guard_mutex': [0x400, ['mutex']],
}],
  'udp_mib': [ size : 0x48, {
    'mibs': [0x0, ['array', 9, ['unsigned long']]],
}],
  'fdtable': [ size : 0x38, {
    'max_fds': [0x0, ['unsigned int']],
    'fd': [0x8, ['pointer', ['pointer', ['file']]]],
    'close_on_exec': [0x10, ['pointer', ['unsigned long']]],
    'open_fds': [0x18, ['pointer', ['unsigned long']]],
    'full_fds_bits': [0x20, ['pointer', ['unsigned long']]],
    'rcu': [0x28, ['callback_head']],
}],
  'hrtimer_cpu_base': [ size : 0x140, {
    'lock': [0x0, ['raw_spinlock']],
    'seq': [0x4, ['seqcount']],
    'running': [0x8, ['pointer', ['hrtimer']]],
    'cpu': [0x10, ['unsigned int']],
    'active_bases': [0x14, ['unsigned int']],
    'clock_was_set_seq': [0x18, ['unsigned int']],
    'in_hrtirq': [0x1c, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'hres_active': [0x1c, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'migration_enabled': [0x1c, ['unsigned char']],
    'hang_detected': [0x1c, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'nohz_active': [0x1d, ['unsigned char']],
    'expires_next': [0x20, ['ktime']],
    'next_timer': [0x28, ['pointer', ['hrtimer']]],
    'nr_events': [0x30, ['unsigned int']],
    'nr_retries': [0x34, ['unsigned int']],
    'nr_hangs': [0x38, ['unsigned int']],
    'max_hang_time': [0x3c, ['unsigned int']],
    'clock_base': [0x40, ['array', 4, ['hrtimer_clock_base']]],
}],
  'proto': [ size : 0x190, {
    'close': [0x0, ['pointer', ['void']]],
    'connect': [0x8, ['pointer', ['void']]],
    'disconnect': [0x10, ['pointer', ['void']]],
    'accept': [0x18, ['pointer', ['void']]],
    'ioctl': [0x20, ['pointer', ['void']]],
    'init': [0x28, ['pointer', ['void']]],
    'destroy': [0x30, ['pointer', ['void']]],
    'shutdown': [0x38, ['pointer', ['void']]],
    'setsockopt': [0x40, ['pointer', ['void']]],
    'getsockopt': [0x48, ['pointer', ['void']]],
    'compat_setsockopt': [0x50, ['pointer', ['void']]],
    'compat_getsockopt': [0x58, ['pointer', ['void']]],
    'compat_ioctl': [0x60, ['pointer', ['void']]],
    'sendmsg': [0x68, ['pointer', ['void']]],
    'recvmsg': [0x70, ['pointer', ['void']]],
    'sendpage': [0x78, ['pointer', ['void']]],
    'bind': [0x80, ['pointer', ['void']]],
    'backlog_rcv': [0x88, ['pointer', ['void']]],
    'release_cb': [0x90, ['pointer', ['void']]],
    'hash': [0x98, ['pointer', ['void']]],
    'unhash': [0xa0, ['pointer', ['void']]],
    'rehash': [0xa8, ['pointer', ['void']]],
    'get_port': [0xb0, ['pointer', ['void']]],
    'clear_sk': [0xb8, ['pointer', ['void']]],
    'inuse_idx': [0xc0, ['unsigned int']],
    'stream_memory_free': [0xc8, ['pointer', ['void']]],
    'enter_memory_pressure': [0xd0, ['pointer', ['void']]],
    'memory_allocated': [0xd8, ['pointer', ['__unnamed_0x371']]],
    'sockets_allocated': [0xe0, ['pointer', ['percpu_counter']]],
    'memory_pressure': [0xe8, ['pointer', ['int']]],
    'sysctl_mem': [0xf0, ['pointer', ['long']]],
    'sysctl_wmem': [0xf8, ['pointer', ['int']]],
    'sysctl_rmem': [0x100, ['pointer', ['int']]],
    'max_header': [0x108, ['int']],
    'no_autobind': [0x10c, ['unsigned char']],
    'slab': [0x110, ['pointer', ['kmem_cache']]],
    'obj_size': [0x118, ['unsigned int']],
    'slab_flags': [0x11c, ['int']],
    'orphan_count': [0x120, ['pointer', ['percpu_counter']]],
    'rsk_prot': [0x128, ['pointer', ['request_sock_ops']]],
    'twsk_prot': [0x130, ['pointer', ['timewait_sock_ops']]],
    'h': [0x138, ['__unnamed_0x18b8b']],
    'owner': [0x140, ['pointer', ['module']]],
    'name': [0x148, ['array', 32, ['char']]],
    'node': [0x168, ['list_head']],
    'init_cgroup': [0x178, ['pointer', ['void']]],
    'destroy_cgroup': [0x180, ['pointer', ['void']]],
    'proto_cgroup': [0x188, ['pointer', ['void']]],
}],
  'smp_ops': [ size : 0x58, {
    'smp_prepare_boot_cpu': [0x0, ['pointer', ['void']]],
    'smp_prepare_cpus': [0x8, ['pointer', ['void']]],
    'smp_cpus_done': [0x10, ['pointer', ['void']]],
    'stop_other_cpus': [0x18, ['pointer', ['void']]],
    'smp_send_reschedule': [0x20, ['pointer', ['void']]],
    'cpu_up': [0x28, ['pointer', ['void']]],
    'cpu_disable': [0x30, ['pointer', ['void']]],
    'cpu_die': [0x38, ['pointer', ['void']]],
    'play_dead': [0x40, ['pointer', ['void']]],
    'send_call_func_ipi': [0x48, ['pointer', ['void']]],
    'send_call_func_single_ipi': [0x50, ['pointer', ['void']]],
}],
  '__unnamed_0xfdc3': [ size : 0x8, {
    'skb_mstamp': [0x0, ['skb_mstamp']],
    'tstamp': [0x0, ['ktime']],
}],
  'netns_sctp': [ size : 0x118, {
    'sctp_statistics': [0x0, ['pointer', ['sctp_mib']]],
    'proc_net_sctp': [0x8, ['pointer', ['proc_dir_entry']]],
    'sysctl_header': [0x10, ['pointer', ['ctl_table_header']]],
    'ctl_sock': [0x18, ['pointer', ['sock']]],
    'local_addr_list': [0x20, ['list_head']],
    'addr_waitq': [0x30, ['list_head']],
    'addr_wq_timer': [0x40, ['timer_list']],
    'auto_asconf_splist': [0x90, ['list_head']],
    'addr_wq_lock': [0xa0, ['spinlock']],
    'local_addr_lock': [0xa4, ['spinlock']],
    'rto_initial': [0xa8, ['unsigned int']],
    'rto_min': [0xac, ['unsigned int']],
    'rto_max': [0xb0, ['unsigned int']],
    'rto_alpha': [0xb4, ['int']],
    'rto_beta': [0xb8, ['int']],
    'max_burst': [0xbc, ['int']],
    'cookie_preserve_enable': [0xc0, ['int']],
    'sctp_hmac_alg': [0xc8, ['pointer', ['char']]],
    'valid_cookie_life': [0xd0, ['unsigned int']],
    'sack_timeout': [0xd4, ['unsigned int']],
    'hb_interval': [0xd8, ['unsigned int']],
    'max_retrans_association': [0xdc, ['int']],
    'max_retrans_path': [0xe0, ['int']],
    'max_retrans_init': [0xe4, ['int']],
    'pf_retrans': [0xe8, ['int']],
    'sndbuf_policy': [0xec, ['int']],
    'rcvbuf_policy': [0xf0, ['int']],
    'default_auto_asconf': [0xf4, ['int']],
    'addip_enable': [0xf8, ['int']],
    'addip_noauth': [0xfc, ['int']],
    'prsctp_enable': [0x100, ['int']],
    'auth_enable': [0x104, ['int']],
    'scope_policy': [0x108, ['int']],
    'rwnd_upd_shift': [0x10c, ['int']],
    'max_autoclose': [0x110, ['unsigned long']],
}],
  'desc_struct': [ size : 0x8, {
    '__unnamed_0x4b6': [0x0, ['__unnamed_0x497']],
}],
  'fib_rule_hdr': [ size : 0xc, {
    'family': [0x0, ['unsigned char']],
    'dst_len': [0x1, ['unsigned char']],
    'src_len': [0x2, ['unsigned char']],
    'tos': [0x3, ['unsigned char']],
    'table': [0x4, ['unsigned char']],
    'res1': [0x5, ['unsigned char']],
    'res2': [0x6, ['unsigned char']],
    'action': [0x7, ['unsigned char']],
    'flags': [0x8, ['unsigned int']],
}],
  'notifier_block': [ size : 0x18, {
    'notifier_call': [0x0, ['pointer', ['void']]],
    'next': [0x8, ['pointer', ['notifier_block']]],
    'priority': [0x10, ['int']],
}],
  'io_context': [ size : 0x68, {
    'refcount': [0x0, ['__unnamed_0x371']],
    'active_ref': [0x8, ['__unnamed_0x351']],
    'nr_tasks': [0xc, ['__unnamed_0x351']],
    'lock': [0x10, ['spinlock']],
    'ioprio': [0x14, ['unsigned short']],
    'nr_batch_requests': [0x18, ['int']],
    'last_waited': [0x20, ['unsigned long']],
    'icq_tree': [0x28, ['radix_tree_root']],
    'icq_hint': [0x38, ['pointer', ['io_cq']]],
    'icq_list': [0x40, ['hlist_head']],
    'release_work': [0x48, ['work_struct']],
}],
  'cgroup_subsys': [ size : 0x100, {
    'css_alloc': [0x0, ['pointer', ['void']]],
    'css_online': [0x8, ['pointer', ['void']]],
    'css_offline': [0x10, ['pointer', ['void']]],
    'css_released': [0x18, ['pointer', ['void']]],
    'css_free': [0x20, ['pointer', ['void']]],
    'css_reset': [0x28, ['pointer', ['void']]],
    'css_e_css_changed': [0x30, ['pointer', ['void']]],
    'can_attach': [0x38, ['pointer', ['void']]],
    'cancel_attach': [0x40, ['pointer', ['void']]],
    'attach': [0x48, ['pointer', ['void']]],
    'post_attach': [0x50, ['pointer', ['void']]],
    'can_fork': [0x58, ['pointer', ['void']]],
    'cancel_fork': [0x60, ['pointer', ['void']]],
    'fork': [0x68, ['pointer', ['void']]],
    'exit': [0x70, ['pointer', ['void']]],
    'free': [0x78, ['pointer', ['void']]],
    'bind': [0x80, ['pointer', ['void']]],
    'early_init': [0x88, ['int']],
    'broken_hierarchy': [0x8c, ['unsigned char']],
    'warned_broken_hierarchy': [0x8d, ['unsigned char']],
    'id': [0x90, ['int']],
    'name': [0x98, ['pointer', ['char']]],
    'legacy_name': [0xa0, ['pointer', ['char']]],
    'root': [0xa8, ['pointer', ['cgroup_root']]],
    'css_idr': [0xb0, ['idr']],
    'cfts': [0xd8, ['list_head']],
    'dfl_cftypes': [0xe8, ['pointer', ['cftype']]],
    'legacy_cftypes': [0xf0, ['pointer', ['cftype']]],
    'depends_on': [0xf8, ['unsigned int']],
}],
  '__unnamed_0x18599': [ size : 0x8, {
    'skc_addrpair': [0x0, ['unsigned long long']],
    '__unnamed_0x185ac': [0x0, ['__unnamed_0x18578']],
}],
  'lockref': [ size : 0x8, {
    '__unnamed_0x77ad': [0x0, ['__unnamed_0x7788']],
}],
  'pipe_buffer': [ size : 0x28, {
    'page': [0x0, ['pointer', ['page']]],
    'offset': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'ops': [0x10, ['pointer', ['pipe_buf_operations']]],
    'flags': [0x18, ['unsigned int']],
    'private': [0x20, ['unsigned long']],
}],
  'llist_node': [ size : 0x8, {
    'next': [0x0, ['pointer', ['llist_node']]],
}],
  'flowi': [ size : 0x48, {
    'u': [0x0, ['__unnamed_0xf14d']],
}],
  'netlink_callback': [ size : 0x78, {
    'skb': [0x0, ['pointer', ['sk_buff']]],
    'nlh': [0x8, ['pointer', ['nlmsghdr']]],
    'start': [0x10, ['pointer', ['void']]],
    'dump': [0x18, ['pointer', ['void']]],
    'done': [0x20, ['pointer', ['void']]],
    'data': [0x28, ['pointer', ['void']]],
    'module': [0x30, ['pointer', ['module']]],
    'family': [0x38, ['unsigned short']],
    'min_dump_alloc': [0x3a, ['unsigned short']],
    'prev_seq': [0x3c, ['unsigned int']],
    'seq': [0x40, ['unsigned int']],
    'args': [0x48, ['array', 6, ['long']]],
}],
  '__unnamed_0x3be': [ size : 0x8, {
    'a': [0x0, ['unsigned int']],
    'b': [0x4, ['unsigned int']],
}],
  'mnt_pcp': [ size : 0x8, {
    'mnt_count': [0x0, ['int']],
    'mnt_writers': [0x4, ['int']],
}],
  'dst_metrics': [ size : 0x44, {
    'metrics': [0x0, ['array', 16, ['unsigned int']]],
    'refcnt': [0x40, ['__unnamed_0x351']],
}],
  'net': [ size : 0x18c0, {
    'passive': [0x0, ['__unnamed_0x351']],
    'count': [0x4, ['__unnamed_0x351']],
    'rules_mod_lock': [0x8, ['spinlock']],
    'cookie_gen': [0x10, ['__unnamed_0x371']],
    'list': [0x18, ['list_head']],
    'cleanup_list': [0x28, ['list_head']],
    'exit_list': [0x38, ['list_head']],
    'user_ns': [0x48, ['pointer', ['user_namespace']]],
    'nsid_lock': [0x50, ['spinlock']],
    'netns_ids': [0x58, ['idr']],
    'ns': [0x80, ['ns_common']],
    'proc_net': [0x98, ['pointer', ['proc_dir_entry']]],
    'proc_net_stat': [0xa0, ['pointer', ['proc_dir_entry']]],
    'sysctls': [0xa8, ['ctl_table_set']],
    'rtnl': [0x100, ['pointer', ['sock']]],
    'genl_sock': [0x108, ['pointer', ['sock']]],
    'dev_base_head': [0x110, ['list_head']],
    'dev_name_head': [0x120, ['pointer', ['hlist_head']]],
    'dev_index_head': [0x128, ['pointer', ['hlist_head']]],
    'dev_base_seq': [0x130, ['unsigned int']],
    'ifindex': [0x134, ['int']],
    'dev_unreg_count': [0x138, ['unsigned int']],
    'rules_ops': [0x140, ['list_head']],
    'loopback_dev': [0x150, ['pointer', ['net_device']]],
    'core': [0x158, ['netns_core']],
    'mib': [0x170, ['netns_mib']],
    'packet': [0x1e0, ['netns_packet']],
    'unx': [0x210, ['netns_unix']],
    'ipv4': [0x240, ['netns_ipv4']],
    'ipv6': [0x400, ['netns_ipv6']],
    'ieee802154_lowpan': [0x700, ['netns_ieee802154_lowpan']],
    'sctp': [0x780, ['netns_sctp']],
    'dccp': [0x898, ['netns_dccp']],
    'nf': [0x8a8, ['netns_nf']],
    'xt': [0xfa8, ['netns_xt']],
    'ct': [0x1098, ['netns_ct']],
    'nft': [0x12b0, ['netns_nftables']],
    'nf_frag': [0x1340, ['netns_nf_frag']],
    'nfnl': [0x1400, ['pointer', ['sock']]],
    'nfnl_stash': [0x1408, ['pointer', ['sock']]],
    'nfnl_acct_list': [0x1410, ['list_head']],
    'wext_nlevents': [0x1420, ['sk_buff_head']],
    'gen': [0x1438, ['pointer', ['net_generic']]],
    'xfrm': [0x1440, ['netns_xfrm']],
    'ipvs': [0x1880, ['pointer', ['netns_ipvs']]],
    'mpls': [0x1888, ['netns_mpls']],
    'diag_nlsk': [0x18a0, ['pointer', ['sock']]],
    'fnhe_genid': [0x18a8, ['__unnamed_0x351']],
}],
  '__unnamed_0x10471': [ size : 0x18, {
    'ifru_hwaddr': [0x0, ['sockaddr']],
    'ifru_data': [0x0, ['pointer', ['void']]],
    'ifru_broadaddr': [0x0, ['sockaddr']],
    'ifru_settings': [0x0, ['if_settings']],
    'ifru_map': [0x0, ['ifmap']],
    'ifru_mtu': [0x0, ['int']],
    'ifru_addr': [0x0, ['sockaddr']],
    'ifru_flags': [0x0, ['short']],
    'ifru_ivalue': [0x0, ['int']],
    'ifru_newname': [0x0, ['array', 16, ['char']]],
    'ifru_dstaddr': [0x0, ['sockaddr']],
    'ifru_slave': [0x0, ['array', 16, ['char']]],
    'ifru_netmask': [0x0, ['sockaddr']],
}],
  'nf_generic_net': [ size : 0x20, {
    'pn': [0x0, ['nf_proto_net']],
    'timeout': [0x18, ['unsigned int']],
}],
  'kernfs_root': [ size : 0x70, {
    'kn': [0x0, ['pointer', ['kernfs_node']]],
    'flags': [0x8, ['unsigned int']],
    'ino_ida': [0x10, ['ida']],
    'syscall_ops': [0x40, ['pointer', ['kernfs_syscall_ops']]],
    'supers': [0x48, ['list_head']],
    'deactivate_waitq': [0x58, ['__wait_queue_head']],
}],
  'in6_pktinfo': [ size : 0x14, {
    'ipi6_addr': [0x0, ['in6_addr']],
    'ipi6_ifindex': [0x10, ['int']],
}],
  'device_dma_parameters': [ size : 0x10, {
    'max_segment_size': [0x0, ['unsigned int']],
    'segment_boundary_mask': [0x8, ['unsigned long']],
}],
  'qc_info': [ size : 0x20, {
    'i_fieldmask': [0x0, ['int']],
    'i_flags': [0x4, ['unsigned int']],
    'i_spc_timelimit': [0x8, ['unsigned int']],
    'i_ino_timelimit': [0xc, ['unsigned int']],
    'i_rt_spc_timelimit': [0x10, ['unsigned int']],
    'i_spc_warnlimit': [0x14, ['unsigned int']],
    'i_ino_warnlimit': [0x18, ['unsigned int']],
    'i_rt_spc_warnlimit': [0x1c, ['unsigned int']],
}],
  'taskstats': [ size : 0x148, {
    'version': [0x0, ['unsigned short']],
    'ac_exitcode': [0x4, ['unsigned int']],
    'ac_flag': [0x8, ['unsigned char']],
    'ac_nice': [0x9, ['unsigned char']],
    'cpu_count': [0x10, ['unsigned long long']],
    'cpu_delay_total': [0x18, ['unsigned long long']],
    'blkio_count': [0x20, ['unsigned long long']],
    'blkio_delay_total': [0x28, ['unsigned long long']],
    'swapin_count': [0x30, ['unsigned long long']],
    'swapin_delay_total': [0x38, ['unsigned long long']],
    'cpu_run_real_total': [0x40, ['unsigned long long']],
    'cpu_run_virtual_total': [0x48, ['unsigned long long']],
    'ac_comm': [0x50, ['array', 32, ['char']]],
    'ac_sched': [0x70, ['unsigned char']],
    'ac_pad': [0x71, ['array', 3, ['unsigned char']]],
    'ac_uid': [0x78, ['unsigned int']],
    'ac_gid': [0x7c, ['unsigned int']],
    'ac_pid': [0x80, ['unsigned int']],
    'ac_ppid': [0x84, ['unsigned int']],
    'ac_btime': [0x88, ['unsigned int']],
    'ac_etime': [0x90, ['unsigned long long']],
    'ac_utime': [0x98, ['unsigned long long']],
    'ac_stime': [0xa0, ['unsigned long long']],
    'ac_minflt': [0xa8, ['unsigned long long']],
    'ac_majflt': [0xb0, ['unsigned long long']],
    'coremem': [0xb8, ['unsigned long long']],
    'virtmem': [0xc0, ['unsigned long long']],
    'hiwater_rss': [0xc8, ['unsigned long long']],
    'hiwater_vm': [0xd0, ['unsigned long long']],
    'read_char': [0xd8, ['unsigned long long']],
    'write_char': [0xe0, ['unsigned long long']],
    'read_syscalls': [0xe8, ['unsigned long long']],
    'write_syscalls': [0xf0, ['unsigned long long']],
    'read_bytes': [0xf8, ['unsigned long long']],
    'write_bytes': [0x100, ['unsigned long long']],
    'cancelled_write_bytes': [0x108, ['unsigned long long']],
    'nvcsw': [0x110, ['unsigned long long']],
    'nivcsw': [0x118, ['unsigned long long']],
    'ac_utimescaled': [0x120, ['unsigned long long']],
    'ac_stimescaled': [0x128, ['unsigned long long']],
    'cpu_scaled_run_real_total': [0x130, ['unsigned long long']],
    'freepages_count': [0x138, ['unsigned long long']],
    'freepages_delay_total': [0x140, ['unsigned long long']],
}],
  'file_lock_operations': [ size : 0x10, {
    'fl_copy_lock': [0x0, ['pointer', ['void']]],
    'fl_release_private': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x18602': [ size : 0x4, {
    '__unnamed_0x18615': [0x0, ['__unnamed_0x185e1']],
    'skc_portpair': [0x0, ['unsigned int']],
}],
  'quotactl_ops': [ size : 0x50, {
    'quota_on': [0x0, ['pointer', ['void']]],
    'quota_off': [0x8, ['pointer', ['void']]],
    'quota_enable': [0x10, ['pointer', ['void']]],
    'quota_disable': [0x18, ['pointer', ['void']]],
    'quota_sync': [0x20, ['pointer', ['void']]],
    'set_info': [0x28, ['pointer', ['void']]],
    'get_dqblk': [0x30, ['pointer', ['void']]],
    'set_dqblk': [0x38, ['pointer', ['void']]],
    'get_state': [0x40, ['pointer', ['void']]],
    'rm_xquota': [0x48, ['pointer', ['void']]],
}],
  'core_thread': [ size : 0x10, {
    'task': [0x0, ['pointer', ['task_struct']]],
    'next': [0x8, ['pointer', ['core_thread']]],
}],
  'dquot': [ size : 0xf0, {
    'dq_hash': [0x0, ['hlist_node']],
    'dq_inuse': [0x10, ['list_head']],
    'dq_free': [0x20, ['list_head']],
    'dq_dirty': [0x30, ['list_head']],
    'dq_lock': [0x40, ['mutex']],
    'dq_count': [0x68, ['__unnamed_0x351']],
    'dq_wait_unused': [0x70, ['__wait_queue_head']],
    'dq_sb': [0x88, ['pointer', ['super_block']]],
    'dq_id': [0x90, ['kqid']],
    'dq_off': [0x98, ['long long']],
    'dq_flags': [0xa0, ['unsigned long']],
    'dq_dqb': [0xa8, ['mem_dqblk']],
}],
  'zonelist': [ size : 0x1410, {
    '_zonerefs': [0x0, ['array', 321, ['zoneref']]],
}],
  '__unnamed_0x186f0': [ size : 0x4, {
    'skc_rxhash': [0x0, ['unsigned int']],
    'skc_window_clamp': [0x0, ['unsigned int']],
    'skc_tw_snd_nxt': [0x0, ['unsigned int']],
}],
  '__unnamed_0x10208': [ size : 0x10, {
    'clock_rate': [0x0, ['unsigned int']],
    'clock_type': [0x4, ['unsigned int']],
    'loopback': [0x8, ['unsigned short']],
    'slot_map': [0xc, ['unsigned int']],
}],
  'tty_ldisc': [ size : 0x10, {
    'ops': [0x0, ['pointer', ['tty_ldisc_ops']]],
    'tty': [0x8, ['pointer', ['tty_struct']]],
}],
  '__unnamed_0xd883': [ size : 0x8, {
    'bvec': [0x0, ['pointer', ['bio_vec']]],
    'iov': [0x0, ['pointer', ['iovec']]],
    'kvec': [0x0, ['pointer', ['kvec']]],
}],
  'mem_cgroup_per_node': [ size : 0x820, {
    'zoneinfo': [0x0, ['array', 5, ['mem_cgroup_per_zone']]],
}],
  'tcp_mib': [ size : 0x80, {
    'mibs': [0x0, ['array', 16, ['unsigned long']]],
}],
  '__unnamed_0x185e1': [ size : 0x4, {
    'skc_dport': [0x0, ['unsigned short']],
    'skc_num': [0x2, ['unsigned short']],
}],
  'rt_hash_bucket': [ size : 0x8, {
    'chain': [0x0, ['pointer', ['rtable']]],
}],
  'pid_link': [ size : 0x18, {
    'node': [0x0, ['hlist_node']],
    'pid': [0x10, ['pointer', ['pid']]],
}],
  'nfs_lock_info': [ size : 0x20, {
    'state': [0x0, ['unsigned int']],
    'owner': [0x8, ['pointer', ['nlm_lockowner']]],
    'list': [0x10, ['list_head']],
}],
  'icmpmsg_mib': [ size : 0x1000, {
    'mibs': [0x0, ['array', 512, ['__unnamed_0x371']]],
}],
  '__unnamed_0x57e1': [ size : 0x8, {
    'active': [0x0, ['unsigned int']],
    '__unnamed_0x57f4': [0x0, ['__unnamed_0x57c6']],
    'counters': [0x0, ['unsigned long']],
}],
  'ifmap': [ size : 0x18, {
    'mem_start': [0x0, ['unsigned long']],
    'mem_end': [0x8, ['unsigned long']],
    'base_addr': [0x10, ['unsigned short']],
    'irq': [0x12, ['unsigned char']],
    'dma': [0x13, ['unsigned char']],
    'port': [0x14, ['unsigned char']],
}],
  '__unnamed_0x15bc2': [ size : 0x8, {
    'cls_u32': [0x0, ['pointer', ['tc_cls_u32_offload']]],
    'tc': [0x0, ['unsigned char']],
}],
  'lock_manager_operations': [ size : 0x48, {
    'lm_compare_owner': [0x0, ['pointer', ['void']]],
    'lm_owner_key': [0x8, ['pointer', ['void']]],
    'lm_get_owner': [0x10, ['pointer', ['void']]],
    'lm_put_owner': [0x18, ['pointer', ['void']]],
    'lm_notify': [0x20, ['pointer', ['void']]],
    'lm_grant': [0x28, ['pointer', ['void']]],
    'lm_break': [0x30, ['pointer', ['void']]],
    'lm_change': [0x38, ['pointer', ['void']]],
    'lm_setup': [0x40, ['pointer', ['void']]],
}],
  '__unnamed_0x185b2': [ size : 0x4, {
    'skc_hash': [0x0, ['unsigned int']],
    'skc_u16hashes': [0x0, ['array', 2, ['unsigned short']]],
}],
  'tc_stats': [ size : 0x28, {
    'bytes': [0x0, ['unsigned long long']],
    'packets': [0x8, ['unsigned int']],
    'drops': [0xc, ['unsigned int']],
    'overlimits': [0x10, ['unsigned int']],
    'bps': [0x14, ['unsigned int']],
    'pps': [0x18, ['unsigned int']],
    'qlen': [0x1c, ['unsigned int']],
    'backlog': [0x20, ['unsigned int']],
}],
  'sched_info': [ size : 0x20, {
    'pcount': [0x0, ['unsigned long']],
    'run_delay': [0x8, ['unsigned long long']],
    'last_arrival': [0x10, ['unsigned long long']],
    'last_queued': [0x18, ['unsigned long long']],
}],
  '__unnamed_0xa1b0': [ size : 0x10, {
    'fu_rcuhead': [0x0, ['callback_head']],
    'fu_llist': [0x0, ['llist_node']],
}],
  'neigh_hash_table': [ size : 0x30, {
    'hash_buckets': [0x0, ['pointer', ['pointer', ['neighbour']]]],
    'hash_shift': [0x8, ['unsigned int']],
    'hash_rnd': [0xc, ['array', 4, ['unsigned int']]],
    'rcu': [0x20, ['callback_head']],
}],
  'task_cputime_atomic': [ size : 0x18, {
    'utime': [0x0, ['__unnamed_0x371']],
    'stime': [0x8, ['__unnamed_0x371']],
    'sum_exec_runtime': [0x10, ['__unnamed_0x371']],
}],
  'quota_format_type': [ size : 0x20, {
    'qf_fmt_id': [0x0, ['int']],
    'qf_ops': [0x8, ['pointer', ['quota_format_ops']]],
    'qf_owner': [0x10, ['pointer', ['module']]],
    'qf_next': [0x18, ['pointer', ['quota_format_type']]],
}],
  '__unnamed_0xb40b': [ size : 0x10, {
    '_band': [0x0, ['long']],
    '_fd': [0x8, ['int']],
}],
  'sock_filter': [ size : 0x8, {
    'code': [0x0, ['unsigned short']],
    'jt': [0x2, ['unsigned char']],
    'jf': [0x3, ['unsigned char']],
    'k': [0x4, ['unsigned int']],
}],
  'dql': [ size : 0x80, {
    'num_queued': [0x0, ['unsigned int']],
    'adj_limit': [0x4, ['unsigned int']],
    'last_obj_cnt': [0x8, ['unsigned int']],
    'limit': [0x40, ['unsigned int']],
    'num_completed': [0x44, ['unsigned int']],
    'prev_ovlimit': [0x48, ['unsigned int']],
    'prev_num_queued': [0x4c, ['unsigned int']],
    'prev_last_obj_cnt': [0x50, ['unsigned int']],
    'lowest_slack': [0x54, ['unsigned int']],
    'slack_start_time': [0x58, ['unsigned long']],
    'max_limit': [0x60, ['unsigned int']],
    'min_limit': [0x64, ['unsigned int']],
    'slack_hold_time': [0x68, ['unsigned int']],
}],
  '__unnamed_0x186c6': [ size : 0x4, {
    'skc_rcv_wnd': [0x0, ['unsigned int']],
    'skc_tw_rcv_nxt': [0x0, ['unsigned int']],
    'skc_incoming_cpu': [0x0, ['int']],
}],
  '__unnamed_0x1d38': [ size : 0x8, {
    'seqcount': [0x0, ['seqcount']],
    'lock': [0x4, ['spinlock']],
}],
  'bio': [ size : 0x88, {
    'bi_next': [0x0, ['pointer', ['bio']]],
    'bi_bdev': [0x8, ['pointer', ['block_device']]],
    'bi_flags': [0x10, ['unsigned int']],
    'bi_error': [0x14, ['int']],
    'bi_rw': [0x18, ['unsigned long']],
    'bi_iter': [0x20, ['bvec_iter']],
    'bi_phys_segments': [0x38, ['unsigned int']],
    'bi_seg_front_size': [0x3c, ['unsigned int']],
    'bi_seg_back_size': [0x40, ['unsigned int']],
    '__bi_remaining': [0x44, ['__unnamed_0x351']],
    'bi_end_io': [0x48, ['pointer', ['void']]],
    'bi_private': [0x50, ['pointer', ['void']]],
    'bi_ioc': [0x58, ['pointer', ['io_context']]],
    'bi_css': [0x60, ['pointer', ['cgroup_subsys_state']]],
    '__unnamed_0x866a': [0x68, ['__unnamed_0x8727']],
    'bi_vcnt': [0x70, ['unsigned short']],
    'bi_max_vecs': [0x72, ['unsigned short']],
    '__bi_cnt': [0x74, ['__unnamed_0x351']],
    'bi_io_vec': [0x78, ['pointer', ['bio_vec']]],
    'bi_pool': [0x80, ['pointer', ['bio_set']]],
    'bi_inline_vecs': [0x88, ['array', 0, ['bio_vec']]],
}],
  'kernfs_ops': [ size : 0x48, {
    'seq_show': [0x0, ['pointer', ['void']]],
    'seq_start': [0x8, ['pointer', ['void']]],
    'seq_next': [0x10, ['pointer', ['void']]],
    'seq_stop': [0x18, ['pointer', ['void']]],
    'read': [0x20, ['pointer', ['void']]],
    'atomic_write_len': [0x28, ['unsigned long']],
    'prealloc': [0x30, ['unsigned char']],
    'write': [0x38, ['pointer', ['void']]],
    'mmap': [0x40, ['pointer', ['void']]],
}],
  'bio_list': [ size : 0x10, {
    'head': [0x0, ['pointer', ['bio']]],
    'tail': [0x8, ['pointer', ['bio']]],
}],
  'compat_robust_list': [ size : 0x4, {
    'next': [0x0, ['unsigned int']],
}],
  'ethtool_tunable': [ size : 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'id': [0x4, ['unsigned int']],
    'type_id': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['pointer', ['void']]]],
}],
  'rtable': [ size : 0xd0, {
    'dst': [0x0, ['dst_entry']],
    'rt_genid': [0x98, ['int']],
    'rt_flags': [0x9c, ['unsigned int']],
    'rt_type': [0xa0, ['unsigned short']],
    'rt_is_input': [0xa2, ['unsigned char']],
    'rt_uses_gateway': [0xa3, ['unsigned char']],
    'rt_iif': [0xa4, ['int']],
    'rt_gateway': [0xa8, ['unsigned int']],
    'rt_pmtu': [0xac, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'rt_mtu_locked': [0xac, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'rt_table_id': [0xb0, ['unsigned int']],
    'rt_uncached': [0xb8, ['list_head']],
    'rt_uncached_list': [0xc8, ['pointer', ['uncached_list']]],
}],
  'netns_xt': [ size : 0xf0, {
    'tables': [0x0, ['array', 13, ['list_head']]],
    'notrack_deprecated_warning': [0xd0, ['unsigned char']],
    'clusterip_deprecated_warning': [0xd1, ['unsigned char']],
    'broute_table': [0xd8, ['pointer', ['ebt_table']]],
    'frame_filter': [0xe0, ['pointer', ['ebt_table']]],
    'frame_nat': [0xe8, ['pointer', ['ebt_table']]],
}],
  'dst_ops': [ size : 0xc0, {
    'family': [0x0, ['unsigned short']],
    'gc_thresh': [0x4, ['unsigned int']],
    'gc': [0x8, ['pointer', ['void']]],
    'check': [0x10, ['pointer', ['void']]],
    'default_advmss': [0x18, ['pointer', ['void']]],
    'mtu': [0x20, ['pointer', ['void']]],
    'cow_metrics': [0x28, ['pointer', ['void']]],
    'destroy': [0x30, ['pointer', ['void']]],
    'ifdown': [0x38, ['pointer', ['void']]],
    'negative_advice': [0x40, ['pointer', ['void']]],
    'link_failure': [0x48, ['pointer', ['void']]],
    'update_pmtu': [0x50, ['pointer', ['void']]],
    'redirect': [0x58, ['pointer', ['void']]],
    'local_out': [0x60, ['pointer', ['void']]],
    'neigh_lookup': [0x68, ['pointer', ['void']]],
    'confirm_neigh': [0x70, ['pointer', ['void']]],
    'kmem_cachep': [0x78, ['pointer', ['kmem_cache']]],
    'pcpuc_entries': [0x80, ['percpu_counter']],
}],
  'mempool_s': [ size : 0x48, {
    'lock': [0x0, ['spinlock']],
    'min_nr': [0x4, ['int']],
    'curr_nr': [0x8, ['int']],
    'elements': [0x10, ['pointer', ['pointer', ['void']]]],
    'pool_data': [0x18, ['pointer', ['void']]],
    'alloc': [0x20, ['pointer', ['void']]],
    'free': [0x28, ['pointer', ['void']]],
    'wait': [0x30, ['__wait_queue_head']],
}],
  '__unnamed_0x5895': [ size : 0x10, {
    '__unnamed_0x58bd': [0x0, ['__unnamed_0x5874']],
    '__unnamed_0x58b8': [0x0, ['__unnamed_0x5847']],
    'lru': [0x0, ['list_head']],
    '__unnamed_0x58a8': [0x0, ['__unnamed_0x581a']],
    'callback_head': [0x0, ['callback_head']],
}],
  'x86_init_iommu': [ size : 0x8, {
    'iommu_init': [0x0, ['pointer', ['void']]],
}],
  'ethtool_drvinfo': [ size : 0xc4, {
    'cmd': [0x0, ['unsigned int']],
    'driver': [0x4, ['array', 32, ['char']]],
    'version': [0x24, ['array', 32, ['char']]],
    'fw_version': [0x44, ['array', 32, ['char']]],
    'bus_info': [0x64, ['array', 32, ['char']]],
    'erom_version': [0x84, ['array', 32, ['char']]],
    'reserved2': [0xa4, ['array', 12, ['char']]],
    'n_priv_flags': [0xb0, ['unsigned int']],
    'n_stats': [0xb4, ['unsigned int']],
    'testinfo_len': [0xb8, ['unsigned int']],
    'eedump_len': [0xbc, ['unsigned int']],
    'regdump_len': [0xc0, ['unsigned int']],
}],
  'netns_dccp': [ size : 0x10, {
    'v4_ctl_sk': [0x0, ['pointer', ['sock']]],
    'v6_ctl_sk': [0x8, ['pointer', ['sock']]],
}],
  'ipv6_pinfo': [ size : 0xa0, {
    'saddr': [0x0, ['in6_addr']],
    'sticky_pktinfo': [0x10, ['in6_pktinfo']],
    'daddr_cache': [0x28, ['pointer', ['in6_addr']]],
    'saddr_cache': [0x30, ['pointer', ['in6_addr']]],
    'flow_label': [0x38, ['unsigned int']],
    'frag_size': [0x3c, ['unsigned int']],
    '__unused_1': [0x40, ['BitField', {'end_bit': 7, 'start_bit': 0}]],
    'hop_limit': [0x40, ['BitField', {'end_bit': 16, 'start_bit': 7}]],
    '__unused_2': [0x42, ['BitField', {'end_bit': 7, 'start_bit': 1}]],
    'mc_loop': [0x42, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'mcast_hops': [0x42, ['BitField', {'end_bit': 16, 'start_bit': 7}]],
    'ucast_oif': [0x44, ['int']],
    'mcast_oif': [0x48, ['int']],
    'rxopt': [0x4c, ['__unnamed_0x198fd']],
    'pmtudisc': [0x4e, ['BitField', {'end_bit': 6, 'start_bit': 3}]],
    'sndflow': [0x4e, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'srcprefs': [0x4e, ['BitField', {'end_bit': 10, 'start_bit': 7}]],
    'autoflowlabel': [0x4e, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'repflow': [0x4e, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'dontfrag': [0x4e, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'padding': [0x4e, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'recverr': [0x4e, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'autoflowlabel_set': [0x4e, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'min_hopcount': [0x50, ['unsigned char']],
    'tclass': [0x51, ['unsigned char']],
    'rcv_flowinfo': [0x54, ['unsigned int']],
    'dst_cookie': [0x58, ['unsigned int']],
    'rx_dst_cookie': [0x5c, ['unsigned int']],
    'ipv6_mc_list': [0x60, ['pointer', ['ipv6_mc_socklist']]],
    'ipv6_ac_list': [0x68, ['pointer', ['ipv6_ac_socklist']]],
    'ipv6_fl_list': [0x70, ['pointer', ['ipv6_fl_socklist']]],
    'opt': [0x78, ['pointer', ['ipv6_txoptions']]],
    'pktoptions': [0x80, ['pointer', ['sk_buff']]],
    'rxpmtu': [0x88, ['pointer', ['sk_buff']]],
    'cork': [0x90, ['inet6_cork']],
}],
  'lock_class_key': [ size : 0x0, {
}],
  'kobj_ns_type_operations': [ size : 0x30, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'KOBJ_NS_TYPE_NONE', 1: 'KOBJ_NS_TYPE_NET', 2: 'KOBJ_NS_TYPES'}}]],
    'current_may_mount': [0x8, ['pointer', ['void']]],
    'grab_current_ns': [0x10, ['pointer', ['void']]],
    'netlink_ns': [0x18, ['pointer', ['void']]],
    'initial_ns': [0x20, ['pointer', ['void']]],
    'drop_ns': [0x28, ['pointer', ['void']]],
}],
  'vmpressure': [ size : 0x70, {
    'scanned': [0x0, ['unsigned long']],
    'reclaimed': [0x8, ['unsigned long']],
    'sr_lock': [0x10, ['spinlock']],
    'events': [0x18, ['list_head']],
    'events_lock': [0x28, ['mutex']],
    'work': [0x50, ['work_struct']],
}],
  'netdev_queue': [ size : 0x180, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'qdisc': [0x8, ['pointer', ['Qdisc']]],
    'qdisc_sleeping': [0x10, ['pointer', ['Qdisc']]],
    'kobj': [0x18, ['kobject']],
    'numa_node': [0x58, ['int']],
    '_xmit_lock': [0x80, ['spinlock']],
    'xmit_lock_owner': [0x84, ['int']],
    'trans_start': [0x88, ['unsigned long']],
    'trans_timeout': [0x90, ['unsigned long']],
    'state': [0x98, ['unsigned long']],
    'dql': [0xc0, ['dql']],
    'tx_maxrate': [0x140, ['unsigned long']],
}],
  'fn_hash': [ size : 0x110, {
    'fn_zones': [0x0, ['array', 33, ['pointer', ['fn_zone']]]],
    'fn_zone_list': [0x108, ['pointer', ['fn_zone']]],
}],
  'tcf_result': [ size : 0x10, {
    'class': [0x0, ['unsigned long']],
    'classid': [0x8, ['unsigned int']],
}],
  'page': [ size : 0x40, {
    'flags': [0x0, ['unsigned long']],
    '__unnamed_0xa8a': [0x8, ['__unnamed_0x5664']],
    '__unnamed_0xa90': [0x10, ['__unnamed_0x5805']],
    '__unnamed_0xa96': [0x20, ['__unnamed_0x5895']],
    '__unnamed_0xa9c': [0x30, ['__unnamed_0x58c3']],
    'mem_cgroup': [0x38, ['pointer', ['mem_cgroup']]],
}],
  'ipv6_devstat': [ size : 0x20, {
    'proc_dir_entry': [0x0, ['pointer', ['proc_dir_entry']]],
    'ipv6': [0x8, ['pointer', ['ipstats_mib']]],
    'icmpv6dev': [0x10, ['pointer', ['icmpv6_mib_device']]],
    'icmpv6msgdev': [0x18, ['pointer', ['icmpv6msg_mib_device']]],
}],
  'phy_device': [ size : 0x448, {
    'drv': [0x0, ['pointer', ['phy_driver']]],
    'bus': [0x8, ['pointer', ['mii_bus']]],
    'dev': [0x10, ['device']],
    'phy_id': [0x2e8, ['unsigned int']],
    'c45_ids': [0x2ec, ['phy_c45_device_ids']],
    'is_c45': [0x310, ['unsigned char']],
    'is_internal': [0x311, ['unsigned char']],
    'is_pseudo_fixed_link': [0x312, ['unsigned char']],
    'has_fixups': [0x313, ['unsigned char']],
    'suspended': [0x314, ['unsigned char']],
    'state': [0x318, ['Enumeration', {'target': 'int', 'choices': {0: 'PHY_DOWN', 1: 'PHY_STARTING', 2: 'PHY_READY', 3: 'PHY_PENDING', 4: 'PHY_UP', 5: 'PHY_AN', 6: 'PHY_RUNNING', 7: 'PHY_NOLINK', 8: 'PHY_FORCING', 9: 'PHY_CHANGELINK', 10: 'PHY_HALTED', 11: 'PHY_RESUMING'}}]],
    'dev_flags': [0x31c, ['unsigned int']],
    'interface': [0x320, ['Enumeration', {'target': 'int', 'choices': {0: 'PHY_INTERFACE_MODE_NA', 1: 'PHY_INTERFACE_MODE_MII', 2: 'PHY_INTERFACE_MODE_GMII', 3: 'PHY_INTERFACE_MODE_SGMII', 4: 'PHY_INTERFACE_MODE_TBI', 5: 'PHY_INTERFACE_MODE_REVMII', 6: 'PHY_INTERFACE_MODE_RMII', 7: 'PHY_INTERFACE_MODE_RGMII', 8: 'PHY_INTERFACE_MODE_RGMII_ID', 9: 'PHY_INTERFACE_MODE_RGMII_RXID', 10: 'PHY_INTERFACE_MODE_RGMII_TXID', 11: 'PHY_INTERFACE_MODE_RTBI', 12: 'PHY_INTERFACE_MODE_SMII', 13: 'PHY_INTERFACE_MODE_XGMII', 14: 'PHY_INTERFACE_MODE_MOCA', 15: 'PHY_INTERFACE_MODE_QSGMII', 16: 'PHY_INTERFACE_MODE_MAX'}}]],
    'addr': [0x324, ['int']],
    'speed': [0x328, ['int']],
    'duplex': [0x32c, ['int']],
    'pause': [0x330, ['int']],
    'asym_pause': [0x334, ['int']],
    'link': [0x338, ['int']],
    'interrupts': [0x33c, ['unsigned int']],
    'supported': [0x340, ['unsigned int']],
    'advertising': [0x344, ['unsigned int']],
    'lp_advertising': [0x348, ['unsigned int']],
    'autoneg': [0x34c, ['int']],
    'link_timeout': [0x350, ['int']],
    'irq': [0x354, ['int']],
    'priv': [0x358, ['pointer', ['void']]],
    'phy_queue': [0x360, ['work_struct']],
    'state_queue': [0x380, ['delayed_work']],
    'irq_disable': [0x400, ['__unnamed_0x351']],
    'lock': [0x408, ['mutex']],
    'attached_dev': [0x430, ['pointer', ['net_device']]],
    'mdix': [0x438, ['unsigned char']],
    'adjust_link': [0x440, ['pointer', ['void']]],
}],
  'ethtool_pauseparam': [ size : 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'autoneg': [0x4, ['unsigned int']],
    'rx_pause': [0x8, ['unsigned int']],
    'tx_pause': [0xc, ['unsigned int']],
}],
  '__unnamed_0x5874': [ size : 0x10, {
    '__pad': [0x0, ['unsigned long']],
    'pmd_huge_pte': [0x8, ['pointer', ['page']]],
}],
  'list_head': [ size : 0x10, {
    'next': [0x0, ['pointer', ['list_head']]],
    'prev': [0x8, ['pointer', ['list_head']]],
}],
  'mem_dqinfo': [ size : 0x48, {
    'dqi_format': [0x0, ['pointer', ['quota_format_type']]],
    'dqi_fmt_id': [0x8, ['int']],
    'dqi_dirty_list': [0x10, ['list_head']],
    'dqi_flags': [0x20, ['unsigned long']],
    'dqi_bgrace': [0x28, ['unsigned int']],
    'dqi_igrace': [0x2c, ['unsigned int']],
    'dqi_max_spc_limit': [0x30, ['long long']],
    'dqi_max_ino_limit': [0x38, ['long long']],
    'dqi_priv': [0x40, ['pointer', ['void']]],
}],
  '__unnamed_0x334e': [ size : 0x20, {
    'rb': [0x0, ['rb_node']],
    'rb_subtree_last': [0x18, ['unsigned long']],
}],
  'optimistic_spin_queue': [ size : 0x4, {
    'tail': [0x0, ['__unnamed_0x1a5']],
}],
  'ipv6_rt_hdr': [ size : 0x4, {
    'nexthdr': [0x0, ['unsigned char']],
    'hdrlen': [0x1, ['unsigned char']],
    'type': [0x2, ['unsigned char']],
    'segments_left': [0x3, ['unsigned char']],
}],
  'tty_port': [ size : 0x160, {
    'buf': [0x0, ['tty_bufhead']],
    'tty': [0x90, ['pointer', ['tty_struct']]],
    'itty': [0x98, ['pointer', ['tty_struct']]],
    'ops': [0xa0, ['pointer', ['tty_port_operations']]],
    'lock': [0xa8, ['spinlock']],
    'blocked_open': [0xac, ['int']],
    'count': [0xb0, ['int']],
    'open_wait': [0xb8, ['__wait_queue_head']],
    'delta_msr_wait': [0xd0, ['__wait_queue_head']],
    'flags': [0xe8, ['unsigned long']],
    'console': [0xf0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'low_latency': [0xf0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'mutex': [0xf8, ['mutex']],
    'buf_mutex': [0x120, ['mutex']],
    'xmit_buf': [0x148, ['pointer', ['unsigned char']]],
    'close_delay': [0x150, ['unsigned int']],
    'closing_wait': [0x154, ['unsigned int']],
    'drain_delay': [0x158, ['int']],
    'kref': [0x15c, ['kref']],
}],
  'proto_ops': [ size : 0xb8, {
    'family': [0x0, ['int']],
    'owner': [0x8, ['pointer', ['module']]],
    'release': [0x10, ['pointer', ['void']]],
    'bind': [0x18, ['pointer', ['void']]],
    'connect': [0x20, ['pointer', ['void']]],
    'socketpair': [0x28, ['pointer', ['void']]],
    'accept': [0x30, ['pointer', ['void']]],
    'getname': [0x38, ['pointer', ['void']]],
    'poll': [0x40, ['pointer', ['void']]],
    'ioctl': [0x48, ['pointer', ['void']]],
    'compat_ioctl': [0x50, ['pointer', ['void']]],
    'listen': [0x58, ['pointer', ['void']]],
    'shutdown': [0x60, ['pointer', ['void']]],
    'setsockopt': [0x68, ['pointer', ['void']]],
    'getsockopt': [0x70, ['pointer', ['void']]],
    'compat_setsockopt': [0x78, ['pointer', ['void']]],
    'compat_getsockopt': [0x80, ['pointer', ['void']]],
    'sendmsg': [0x88, ['pointer', ['void']]],
    'recvmsg': [0x90, ['pointer', ['void']]],
    'mmap': [0x98, ['pointer', ['void']]],
    'sendpage': [0xa0, ['pointer', ['void']]],
    'splice_read': [0xa8, ['pointer', ['void']]],
    'set_peek_off': [0xb0, ['pointer', ['void']]],
}],
  '__unnamed_0x19dfc': [ size : 0x10, {
    'rcu': [0x0, ['callback_head']],
    '__unnamed_0x19e04': [0x0, ['__unnamed_0x19de7']],
    'gc_next': [0x0, ['pointer', ['inet_peer']]],
}],
  'ifla_vf_stats': [ size : 0x30, {
    'rx_packets': [0x0, ['unsigned long long']],
    'tx_packets': [0x8, ['unsigned long long']],
    'rx_bytes': [0x10, ['unsigned long long']],
    'tx_bytes': [0x18, ['unsigned long long']],
    'broadcast': [0x20, ['unsigned long long']],
    'multicast': [0x28, ['unsigned long long']],
}],
  'ctl_dir': [ size : 0x50, {
    'header': [0x0, ['ctl_table_header']],
    'root': [0x48, ['rb_root']],
}],
  'local_ports': [ size : 0x14, {
    'lock': [0x0, ['__unnamed_0x2c51']],
    'range': [0x8, ['array', 2, ['int']]],
    'warned': [0x10, ['unsigned char']],
}],
  '__unnamed_0xb2f7': [ size : 0x18, {
    '_tid': [0x0, ['int']],
    '_overrun': [0x4, ['int']],
    '_pad': [0x8, ['array', 0, ['char']]],
    '_sigval': [0x8, ['sigval']],
    '_sys_private': [0x10, ['int']],
}],
  '__unnamed_0x9a85': [ size : 0x4, {
    '__i_nlink': [0x0, ['unsigned int']],
    'i_nlink': [0x0, ['unsigned int']],
}],
  '__unnamed_0xfea1': [ size : 0x4, {
    'reserved_tailroom': [0x0, ['unsigned int']],
    'mark': [0x0, ['unsigned int']],
}],
  'vm_event_state': [ size : 0x268, {
    'event': [0x0, ['array', 77, ['unsigned long']]],
}],
  'key_payload': [ size : 0x20, {
    'rcu_data0': [0x0, ['pointer', ['void']]],
    'data': [0x0, ['array', 4, ['pointer', ['void']]]],
}],
  'list_lru_node': [ size : 0x40, {
    'lock': [0x0, ['spinlock']],
    'lru': [0x8, ['list_lru_one']],
    'memcg_lrus': [0x20, ['pointer', ['list_lru_memcg']]],
    'nr_items': [0x28, ['long']],
}],
  '__unnamed_0xba11': [ size : 0x20, {
    'name_link': [0x0, ['list_head']],
    'keys': [0x10, ['assoc_array']],
}],
  'kernel_cap_struct': [ size : 0x8, {
    'cap': [0x0, ['array', 2, ['unsigned int']]],
}],
  'exception_table_entry': [ size : 0x8, {
    'insn': [0x0, ['int']],
    'fixup': [0x4, ['int']],
}],
  'sysv_sem': [ size : 0x8, {
    'undo_list': [0x0, ['pointer', ['sem_undo_list']]],
}],
  '__unnamed_0x17027': [ size : 0x10, {
    '__rcu_icq_cache': [0x0, ['pointer', ['kmem_cache']]],
    'q_node': [0x0, ['list_head']],
}],
  'Qdisc_ops': [ size : 0x88, {
    'next': [0x0, ['pointer', ['Qdisc_ops']]],
    'cl_ops': [0x8, ['pointer', ['Qdisc_class_ops']]],
    'id': [0x10, ['array', 16, ['char']]],
    'priv_size': [0x20, ['int']],
    'enqueue': [0x28, ['pointer', ['void']]],
    'dequeue': [0x30, ['pointer', ['void']]],
    'peek': [0x38, ['pointer', ['void']]],
    'drop': [0x40, ['pointer', ['void']]],
    'init': [0x48, ['pointer', ['void']]],
    'reset': [0x50, ['pointer', ['void']]],
    'destroy': [0x58, ['pointer', ['void']]],
    'change': [0x60, ['pointer', ['void']]],
    'attach': [0x68, ['pointer', ['void']]],
    'dump': [0x70, ['pointer', ['void']]],
    'dump_stats': [0x78, ['pointer', ['void']]],
    'owner': [0x80, ['pointer', ['module']]],
}],
  'Qdisc': [ size : 0x140, {
    'enqueue': [0x0, ['pointer', ['void']]],
    'dequeue': [0x8, ['pointer', ['void']]],
    'flags': [0x10, ['unsigned int']],
    'limit': [0x14, ['unsigned int']],
    'ops': [0x18, ['pointer', ['Qdisc_ops']]],
    'stab': [0x20, ['pointer', ['qdisc_size_table']]],
    'list': [0x28, ['list_head']],
    'handle': [0x38, ['unsigned int']],
    'parent': [0x3c, ['unsigned int']],
    'reshape_fail': [0x40, ['pointer', ['void']]],
    'u32_node': [0x48, ['pointer', ['void']]],
    '__parent': [0x50, ['pointer', ['Qdisc']]],
    'dev_queue': [0x58, ['pointer', ['netdev_queue']]],
    'rate_est': [0x60, ['gnet_stats_rate_est64']],
    'cpu_bstats': [0x70, ['pointer', ['gnet_stats_basic_cpu']]],
    'cpu_qstats': [0x78, ['pointer', ['gnet_stats_queue']]],
    'next_sched': [0x80, ['pointer', ['Qdisc']]],
    'gso_skb': [0x88, ['pointer', ['sk_buff']]],
    'state': [0x90, ['unsigned long']],
    'q': [0x98, ['sk_buff_head']],
    'bstats': [0xb0, ['gnet_stats_basic_packed']],
    '__state': [0xbc, ['unsigned int']],
    'qstats': [0xc0, ['gnet_stats_queue']],
    'callback_head': [0xd8, ['callback_head']],
    'padded': [0xe8, ['int']],
    'refcnt': [0xec, ['__unnamed_0x351']],
    'busylock': [0x100, ['spinlock']],
}],
  'list_lru_memcg': [ size : 0x0, {
    'lru': [0x0, ['array', 0, ['pointer', ['list_lru_one']]]],
}],
  'fib_nh_exception': [ size : 0x50, {
    'fnhe_next': [0x0, ['pointer', ['fib_nh_exception']]],
    'fnhe_genid': [0x8, ['int']],
    'fnhe_daddr': [0xc, ['unsigned int']],
    'fnhe_pmtu': [0x10, ['unsigned int']],
    'fnhe_mtu_locked': [0x14, ['unsigned char']],
    'fnhe_gw': [0x18, ['unsigned int']],
    'fnhe_expires': [0x20, ['unsigned long']],
    'fnhe_rth_input': [0x28, ['pointer', ['rtable']]],
    'fnhe_rth_output': [0x30, ['pointer', ['rtable']]],
    'fnhe_stamp': [0x38, ['unsigned long']],
    'rcu': [0x40, ['callback_head']],
}],
  'nla_policy': [ size : 0x4, {
    'type': [0x0, ['unsigned short']],
    'len': [0x2, ['unsigned short']],
}],
  'netdev_phys_item_id': [ size : 0x21, {
    'id': [0x0, ['array', 32, ['unsigned char']]],
    'id_len': [0x20, ['unsigned char']],
}],
  'qc_dqblk': [ size : 0x78, {
    'd_fieldmask': [0x0, ['int']],
    'd_spc_hardlimit': [0x8, ['unsigned long long']],
    'd_spc_softlimit': [0x10, ['unsigned long long']],
    'd_ino_hardlimit': [0x18, ['unsigned long long']],
    'd_ino_softlimit': [0x20, ['unsigned long long']],
    'd_space': [0x28, ['unsigned long long']],
    'd_ino_count': [0x30, ['unsigned long long']],
    'd_ino_timer': [0x38, ['long long']],
    'd_spc_timer': [0x40, ['long long']],
    'd_ino_warns': [0x48, ['int']],
    'd_spc_warns': [0x4c, ['int']],
    'd_rt_spc_hardlimit': [0x50, ['unsigned long long']],
    'd_rt_spc_softlimit': [0x58, ['unsigned long long']],
    'd_rt_space': [0x60, ['unsigned long long']],
    'd_rt_spc_timer': [0x68, ['long long']],
    'd_rt_spc_warns': [0x70, ['int']],
}],
  '__unnamed_0x19d71': [ size : 0x10, {
    'a4': [0x0, ['ipv4_addr_key']],
    'key': [0x0, ['array', 4, ['unsigned int']]],
    'a6': [0x0, ['in6_addr']],
}],
  'core_state': [ size : 0x38, {
    'nr_threads': [0x0, ['__unnamed_0x1a5']],
    'dumper': [0x8, ['core_thread']],
    'startup': [0x18, ['completion']],
}],
  '__unnamed_0x8cc6': [ size : 0x4, {
    'val': [0x0, ['unsigned int']],
}],
  '__unnamed_0xf026': [ size : 0x1, {
    'type': [0x0, ['unsigned char']],
}],
  '__unnamed_0x8727': [ size : 0x8, {
    'bi_integrity': [0x0, ['pointer', ['bio_integrity_payload']]],
}],
  '__unnamed_0x77b4': [ size : 0x8, {
    'hash': [0x0, ['unsigned int']],
    'len': [0x4, ['unsigned int']],
}],
  'nf_sockopt_ops': [ size : 0x50, {
    'list': [0x0, ['list_head']],
    'pf': [0x10, ['unsigned char']],
    'set_optmin': [0x14, ['int']],
    'set_optmax': [0x18, ['int']],
    'set': [0x20, ['pointer', ['void']]],
    'compat_set': [0x28, ['pointer', ['void']]],
    'get_optmin': [0x30, ['int']],
    'get_optmax': [0x34, ['int']],
    'get': [0x38, ['pointer', ['void']]],
    'compat_get': [0x40, ['pointer', ['void']]],
    'owner': [0x48, ['pointer', ['module']]],
}],
  'zone_reclaim_stat': [ size : 0x20, {
    'recent_rotated': [0x0, ['array', 2, ['unsigned long']]],
    'recent_scanned': [0x10, ['array', 2, ['unsigned long']]],
}],
  'dev_pin_info': [ size : 0x28, {
    'p': [0x0, ['pointer', ['pinctrl']]],
    'default_state': [0x8, ['pointer', ['pinctrl_state']]],
    'init_state': [0x10, ['pointer', ['pinctrl_state']]],
    'sleep_state': [0x18, ['pointer', ['pinctrl_state']]],
    'idle_state': [0x20, ['pointer', ['pinctrl_state']]],
}],
  'mod_kallsyms': [ size : 0x18, {
    'symtab': [0x0, ['pointer', ['elf64_sym']]],
    'num_symtab': [0x8, ['unsigned int']],
    'strtab': [0x10, ['pointer', ['char']]],
}],
  'xfrm_policy_hash': [ size : 0x10, {
    'table': [0x0, ['pointer', ['hlist_head']]],
    'hmask': [0x8, ['unsigned int']],
    'dbits4': [0xc, ['unsigned char']],
    'sbits4': [0xd, ['unsigned char']],
    'dbits6': [0xe, ['unsigned char']],
    'sbits6': [0xf, ['unsigned char']],
}],
  'hrtimer_clock_base': [ size : 0x40, {
    'cpu_base': [0x0, ['pointer', ['hrtimer_cpu_base']]],
    'index': [0x8, ['int']],
    'clockid': [0xc, ['int']],
    'active': [0x10, ['timerqueue_head']],
    'get_time': [0x20, ['pointer', ['void']]],
    'offset': [0x28, ['ktime']],
}],
  'io_cq': [ size : 0x38, {
    'q': [0x0, ['pointer', ['request_queue']]],
    'ioc': [0x8, ['pointer', ['io_context']]],
    '__unnamed_0x17087': [0x10, ['__unnamed_0x17027']],
    '__unnamed_0x1708d': [0x20, ['__unnamed_0x17046']],
    'flags': [0x30, ['unsigned int']],
}],
  'in_device': [ size : 0x198, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'refcnt': [0x8, ['__unnamed_0x351']],
    'dead': [0xc, ['int']],
    'ifa_list': [0x10, ['pointer', ['in_ifaddr']]],
    'mc_list': [0x18, ['pointer', ['ip_mc_list']]],
    'mc_hash': [0x20, ['pointer', ['pointer', ['ip_mc_list']]]],
    'mc_count': [0x28, ['int']],
    'mc_tomb_lock': [0x2c, ['spinlock']],
    'mc_tomb': [0x30, ['pointer', ['ip_mc_list']]],
    'mr_v1_seen': [0x38, ['unsigned long']],
    'mr_v2_seen': [0x40, ['unsigned long']],
    'mr_maxdelay': [0x48, ['unsigned long']],
    'mr_qrv': [0x50, ['unsigned char']],
    'mr_gq_running': [0x51, ['unsigned char']],
    'mr_ifc_count': [0x52, ['unsigned char']],
    'mr_gq_timer': [0x58, ['timer_list']],
    'mr_ifc_timer': [0xa8, ['timer_list']],
    'arp_parms': [0xf8, ['pointer', ['neigh_parms']]],
    'cnf': [0x100, ['ipv4_devconf']],
    'callback_head': [0x188, ['callback_head']],
}],
  'idr': [ size : 0x28, {
    'hint': [0x0, ['pointer', ['idr_layer']]],
    'top': [0x8, ['pointer', ['idr_layer']]],
    'layers': [0x10, ['int']],
    'cur': [0x14, ['int']],
    'lock': [0x18, ['spinlock']],
    'id_free_cnt': [0x1c, ['int']],
    'id_free': [0x20, ['pointer', ['idr_layer']]],
}],
  'nf_icmp_net': [ size : 0x20, {
    'pn': [0x0, ['nf_proto_net']],
    'timeout': [0x18, ['unsigned int']],
}],
  'skb_mstamp': [ size : 0x8, {
    '__unnamed_0xfdbc': [0x0, ['__unnamed_0xfd94']],
}],
  'netns_nf_frag': [ size : 0xc0, {
    'sysctl': [0x0, ['netns_sysctl_ipv6']],
    'frags': [0x80, ['netns_frags']],
}],
  '__unnamed_0x19c8a': [ size : 0x8, {
    'pid': [0x0, ['pointer', ['pid']]],
    'uid': [0x0, ['__unnamed_0x2c81']],
}],
  'hlist_bl_head': [ size : 0x8, {
    'first': [0x0, ['pointer', ['hlist_bl_node']]],
}],
  'vfsmount': [ size : 0x18, {
    'mnt_root': [0x0, ['pointer', ['dentry']]],
    'mnt_sb': [0x8, ['pointer', ['super_block']]],
    'mnt_flags': [0x10, ['int']],
}],
  'css_set': [ size : 0x1c8, {
    'refcount': [0x0, ['__unnamed_0x351']],
    'hlist': [0x8, ['hlist_node']],
    'tasks': [0x18, ['list_head']],
    'mg_tasks': [0x28, ['list_head']],
    'cgrp_links': [0x38, ['list_head']],
    'dfl_cgrp': [0x48, ['pointer', ['cgroup']]],
    'subsys': [0x50, ['array', 12, ['pointer', ['cgroup_subsys_state']]]],
    'mg_preload_node': [0xb0, ['list_head']],
    'mg_node': [0xc0, ['list_head']],
    'mg_src_cgrp': [0xd0, ['pointer', ['cgroup']]],
    'mg_dst_cset': [0xd8, ['pointer', ['css_set']]],
    'e_cset_node': [0xe0, ['array', 12, ['list_head']]],
    'task_iters': [0x1a0, ['list_head']],
    'dead': [0x1b0, ['unsigned char']],
    'callback_head': [0x1b8, ['callback_head']],
}],
  'ipv6_stable_secret': [ size : 0x14, {
    'initialized': [0x0, ['unsigned char']],
    'secret': [0x4, ['in6_addr']],
}],
  'load_weight': [ size : 0x10, {
    'weight': [0x0, ['unsigned long']],
    'inv_weight': [0x8, ['unsigned int']],
}],
  'flowi_tunnel': [ size : 0x8, {
    'tun_id': [0x0, ['unsigned long long']],
}],
  'fnhe_hash_bucket': [ size : 0x8, {
    'chain': [0x0, ['pointer', ['fib_nh_exception']]],
}],
  '__unnamed_0xb3bd': [ size : 0x10, {
    '_lower': [0x0, ['pointer', ['void']]],
    '_upper': [0x8, ['pointer', ['void']]],
}],
  'ethtool_rx_flow_spec': [ size : 0xa8, {
    'flow_type': [0x0, ['unsigned int']],
    'h_u': [0x4, ['ethtool_flow_union']],
    'h_ext': [0x38, ['ethtool_flow_ext']],
    'm_u': [0x4c, ['ethtool_flow_union']],
    'm_ext': [0x80, ['ethtool_flow_ext']],
    'ring_cookie': [0x98, ['unsigned long long']],
    'location': [0xa0, ['unsigned int']],
}],
  'klist_node': [ size : 0x20, {
    'n_klist': [0x0, ['pointer', ['void']]],
    'n_node': [0x8, ['list_head']],
    'n_ref': [0x18, ['kref']],
}],
  'vm_userfaultfd_ctx': [ size : 0x8, {
    'ctx': [0x0, ['pointer', ['userfaultfd_ctx']]],
}],
  '__unnamed_0x39be': [ size : 0x18, {
    'ctl_table': [0x0, ['pointer', ['ctl_table']]],
    'used': [0x8, ['int']],
    'count': [0xc, ['int']],
    'nreg': [0x10, ['int']],
}],
  '__unnamed_0x351': [ size : 0x4, {
    'counter': [0x0, ['int']],
}],
  '__unnamed_0x166c1': [ size : 0x8, {
    'dstats': [0x0, ['pointer', ['pcpu_dstats']]],
    'lstats': [0x0, ['pointer', ['pcpu_lstats']]],
    'tstats': [0x0, ['pointer', ['pcpu_sw_netstats']]],
    'vstats': [0x0, ['pointer', ['pcpu_vstats']]],
    'ml_priv': [0x0, ['pointer', ['void']]],
}],
  '__unnamed_0x8d33': [ size : 0x4, {
    'gid': [0x0, ['__unnamed_0x2ca1']],
    'projid': [0x0, ['__unnamed_0x8cc6']],
    'uid': [0x0, ['__unnamed_0x2c81']],
}],
  'nf_udp_net': [ size : 0x20, {
    'pn': [0x0, ['nf_proto_net']],
    'timeouts': [0x18, ['array', 2, ['unsigned int']]],
}],
  'log': [ size : 0x10, {
    'ts_nsec': [0x0, ['unsigned long long']],
    'len': [0x8, ['unsigned short']],
    'text_len': [0xa, ['unsigned short']],
    'dict_len': [0xc, ['unsigned short']],
    'facility': [0xe, ['unsigned char']],
    'level': [0xf, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'flags': [0xf, ['BitField', {'end_bit': 5, 'start_bit': 0}]],
}],
  'kvec': [ size : 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['unsigned long']],
}],
  'kset': [ size : 0x60, {
    'list': [0x0, ['list_head']],
    'list_lock': [0x10, ['spinlock']],
    'kobj': [0x18, ['kobject']],
    'uevent_ops': [0x58, ['pointer', ['kset_uevent_ops']]],
}],
  'ctl_node': [ size : 0x20, {
    'node': [0x0, ['rb_node']],
    'header': [0x18, ['pointer', ['ctl_table_header']]],
}],
  '__unnamed_0x2aa6': [ size : 0x48, {
    'ldt': [0x0, ['pointer', ['ldt_struct']]],
    'ia32_compat': [0x8, ['unsigned short']],
    'lock': [0x10, ['mutex']],
    'vdso': [0x38, ['pointer', ['void']]],
    'perf_rdpmc_allowed': [0x40, ['__unnamed_0x1a5']],
}],
  'netns_mib': [ size : 0x70, {
    'tcp_statistics': [0x0, ['pointer', ['tcp_mib']]],
    'ip_statistics': [0x8, ['pointer', ['ipstats_mib']]],
    'net_statistics': [0x10, ['pointer', ['linux_mib']]],
    'udp_statistics': [0x18, ['pointer', ['udp_mib']]],
    'udplite_statistics': [0x20, ['pointer', ['udp_mib']]],
    'icmp_statistics': [0x28, ['pointer', ['icmp_mib']]],
    'icmpmsg_statistics': [0x30, ['pointer', ['icmpmsg_mib']]],
    'proc_net_devsnmp6': [0x38, ['pointer', ['proc_dir_entry']]],
    'udp_stats_in6': [0x40, ['pointer', ['udp_mib']]],
    'udplite_stats_in6': [0x48, ['pointer', ['udp_mib']]],
    'ipv6_statistics': [0x50, ['pointer', ['ipstats_mib']]],
    'icmpv6_statistics': [0x58, ['pointer', ['icmpv6_mib']]],
    'icmpv6msg_statistics': [0x60, ['pointer', ['icmpv6msg_mib']]],
    'xfrm_statistics': [0x68, ['pointer', ['linux_xfrm_mib']]],
}],
  'tk_read_base': [ size : 0x30, {
    'clock': [0x0, ['pointer', ['clocksource']]],
    'mask': [0x8, ['unsigned long long']],
    'cycle_last': [0x10, ['unsigned long long']],
    'mult': [0x18, ['unsigned int']],
    'shift': [0x1c, ['unsigned int']],
    'xtime_nsec': [0x20, ['unsigned long long']],
    'base': [0x28, ['ktime']],
}],
  'rlimit': [ size : 0x10, {
    'rlim_cur': [0x0, ['unsigned long']],
    'rlim_max': [0x8, ['unsigned long']],
}],
  'fib_alias': [ size : 0x20, {
    'fa_list': [0x0, ['list_head']],
    'fa_info': [0x10, ['pointer', ['fib_info']]],
    'fa_tos': [0x18, ['unsigned char']],
    'fa_type': [0x19, ['unsigned char']],
    'fa_scope': [0x1a, ['unsigned char']],
    'fa_state': [0x1b, ['unsigned char']],
}],
  'hlist_nulls_node': [ size : 0x10, {
    'next': [0x0, ['pointer', ['hlist_nulls_node']]],
    'pprev': [0x8, ['pointer', ['pointer', ['hlist_nulls_node']]]],
}],
  'llist_head': [ size : 0x8, {
    'first': [0x0, ['pointer', ['llist_node']]],
}],
  'neigh_table': [ size : 0x220, {
    'family': [0x0, ['int']],
    'entry_size': [0x4, ['int']],
    'key_len': [0x8, ['int']],
    'protocol': [0xc, ['unsigned short']],
    'hash': [0x10, ['pointer', ['void']]],
    'key_eq': [0x18, ['pointer', ['void']]],
    'constructor': [0x20, ['pointer', ['void']]],
    'pconstructor': [0x28, ['pointer', ['void']]],
    'pdestructor': [0x30, ['pointer', ['void']]],
    'proxy_redo': [0x38, ['pointer', ['void']]],
    'id': [0x40, ['pointer', ['char']]],
    'parms': [0x48, ['neigh_parms']],
    'parms_list': [0xe0, ['list_head']],
    'gc_interval': [0xf0, ['int']],
    'gc_thresh1': [0xf4, ['int']],
    'gc_thresh2': [0xf8, ['int']],
    'gc_thresh3': [0xfc, ['int']],
    'last_flush': [0x100, ['unsigned long']],
    'gc_work': [0x108, ['delayed_work']],
    'proxy_timer': [0x188, ['timer_list']],
    'proxy_queue': [0x1d8, ['sk_buff_head']],
    'entries': [0x1f0, ['__unnamed_0x351']],
    'lock': [0x1f4, ['__unnamed_0x2b74']],
    'last_rand': [0x200, ['unsigned long']],
    'stats': [0x208, ['pointer', ['neigh_statistics']]],
    'nht': [0x210, ['pointer', ['neigh_hash_table']]],
    'phash_buckets': [0x218, ['pointer', ['pointer', ['pneigh_entry']]]],
}],
  '__unnamed_0x1024c': [ size : 0x4, {
    'encoding': [0x0, ['unsigned short']],
    'parity': [0x2, ['unsigned short']],
}],
  'bpf_insn': [ size : 0x8, {
    'code': [0x0, ['unsigned char']],
    'src_reg': [0x1, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'dst_reg': [0x1, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'off': [0x2, ['short']],
    'imm': [0x4, ['int']],
}],
  'sched_entity': [ size : 0x188, {
    'load': [0x0, ['load_weight']],
    'run_node': [0x10, ['rb_node']],
    'group_node': [0x28, ['list_head']],
    'on_rq': [0x38, ['unsigned int']],
    'exec_start': [0x40, ['unsigned long long']],
    'sum_exec_runtime': [0x48, ['unsigned long long']],
    'vruntime': [0x50, ['unsigned long long']],
    'prev_sum_exec_runtime': [0x58, ['unsigned long long']],
    'nr_migrations': [0x60, ['unsigned long long']],
    'statistics': [0x68, ['sched_statistics']],
    'depth': [0x140, ['int']],
    'parent': [0x148, ['pointer', ['sched_entity']]],
    'cfs_rq': [0x150, ['pointer', ['cfs_rq']]],
    'my_q': [0x158, ['pointer', ['cfs_rq']]],
    'avg': [0x160, ['sched_avg']],
}],
  'callback_head': [ size : 0x10, {
    'next': [0x0, ['pointer', ['callback_head']]],
    'func': [0x8, ['pointer', ['void']]],
}],
  'mnt_namespace': [ size : 0x40, {
    'count': [0x0, ['__unnamed_0x351']],
    'root': [0x8, ['pointer', ['mount']]],
    'list': [0x10, ['list_head']],
    'poll': [0x20, ['__wait_queue_head']],
    'event': [0x38, ['int']],
}],
  'timekeeper': [ size : 0xf8, {
    'tkr_mono': [0x0, ['tk_read_base']],
    'tkr_raw': [0x30, ['tk_read_base']],
    'xtime_sec': [0x60, ['unsigned long long']],
    'ktime_sec': [0x68, ['unsigned long']],
    'wall_to_monotonic': [0x70, ['timespec']],
    'offs_real': [0x80, ['ktime']],
    'offs_boot': [0x88, ['ktime']],
    'offs_tai': [0x90, ['ktime']],
    'tai_offset': [0x98, ['int']],
    'clock_was_set_seq': [0x9c, ['unsigned int']],
    'cs_was_changed_seq': [0xa0, ['unsigned char']],
    'next_leap_ktime': [0xa8, ['ktime']],
    'raw_time': [0xb0, ['timespec']],
    'cycle_interval': [0xc0, ['unsigned long long']],
    'xtime_interval': [0xc8, ['unsigned long long']],
    'xtime_remainder': [0xd0, ['long long']],
    'raw_interval': [0xd8, ['unsigned long long']],
    'ntp_tick': [0xe0, ['unsigned long long']],
    'ntp_error': [0xe8, ['long long']],
    'ntp_error_shift': [0xf0, ['unsigned int']],
    'ntp_err_mult': [0xf4, ['unsigned int']],
}],
  'ipv6_ac_socklist': [ size : 0x20, {
    'acl_addr': [0x0, ['in6_addr']],
    'acl_ifindex': [0x10, ['int']],
    'acl_next': [0x18, ['pointer', ['ipv6_ac_socklist']]],
}],
  '__unnamed_0x1032c': [ size : 0x8, {
    'interval': [0x0, ['unsigned int']],
    'timeout': [0x4, ['unsigned int']],
}],
  'kparam_string': [ size : 0x10, {
    'maxlen': [0x0, ['unsigned int']],
    'string': [0x8, ['pointer', ['char']]],
}],
  'task_io_accounting': [ size : 0x38, {
    'rchar': [0x0, ['unsigned long long']],
    'wchar': [0x8, ['unsigned long long']],
    'syscr': [0x10, ['unsigned long long']],
    'syscw': [0x18, ['unsigned long long']],
    'read_bytes': [0x20, ['unsigned long long']],
    'write_bytes': [0x28, ['unsigned long long']],
    'cancelled_write_bytes': [0x30, ['unsigned long long']],
}],
  'fregs_state': [ size : 0x70, {
    'cwd': [0x0, ['unsigned int']],
    'swd': [0x4, ['unsigned int']],
    'twd': [0x8, ['unsigned int']],
    'fip': [0xc, ['unsigned int']],
    'fcs': [0x10, ['unsigned int']],
    'foo': [0x14, ['unsigned int']],
    'fos': [0x18, ['unsigned int']],
    'st_space': [0x1c, ['array', 20, ['unsigned int']]],
    'status': [0x6c, ['unsigned int']],
}],
  '__unnamed_0x57a2': [ size : 0x4, {
    'units': [0x0, ['int']],
    '_mapcount': [0x0, ['__unnamed_0x351']],
    '__unnamed_0x57b5': [0x0, ['__unnamed_0x576c']],
}],
  '__unnamed_0x497': [ size : 0x8, {
    '__unnamed_0x49f': [0x0, ['__unnamed_0x3be']],
    '__unnamed_0x4a4': [0x0, ['__unnamed_0x3db']],
}],
  'sched_dl_entity': [ size : 0xc0, {
    'rb_node': [0x0, ['rb_node']],
    'dl_runtime': [0x18, ['unsigned long long']],
    'dl_deadline': [0x20, ['unsigned long long']],
    'dl_period': [0x28, ['unsigned long long']],
    'dl_bw': [0x30, ['unsigned long long']],
    'dl_density': [0x38, ['unsigned long long']],
    'runtime': [0x40, ['long long']],
    'deadline': [0x48, ['unsigned long long']],
    'flags': [0x50, ['unsigned int']],
    'dl_throttled': [0x54, ['int']],
    'dl_new': [0x58, ['int']],
    'dl_boosted': [0x5c, ['int']],
    'dl_yielded': [0x60, ['int']],
    'dl_timer': [0x68, ['hrtimer']],
}],
  'bdi_writeback_congested': [ size : 0x38, {
    'state': [0x0, ['unsigned long']],
    'refcnt': [0x8, ['__unnamed_0x351']],
    '__bdi': [0x10, ['pointer', ['backing_dev_info']]],
    'blkcg_id': [0x18, ['int']],
    'rb_node': [0x20, ['rb_node']],
}],
  '__unnamed_0x18578': [ size : 0x8, {
    'skc_daddr': [0x0, ['unsigned int']],
    'skc_rcv_saddr': [0x4, ['unsigned int']],
}],
  'ipv6_fl_socklist': [ size : 0x20, {
    'next': [0x0, ['pointer', ['ipv6_fl_socklist']]],
    'fl': [0x8, ['pointer', ['ip6_flowlabel']]],
    'rcu': [0x10, ['callback_head']],
}],
  'ipv6_mc_socklist': [ size : 0x48, {
    'addr': [0x0, ['in6_addr']],
    'ifindex': [0x10, ['int']],
    'next': [0x18, ['pointer', ['ipv6_mc_socklist']]],
    'sflock': [0x20, ['__unnamed_0x2b74']],
    'sfmode': [0x28, ['unsigned int']],
    'sflist': [0x30, ['pointer', ['ip6_sf_socklist']]],
    'rcu': [0x38, ['callback_head']],
}],
  'seq_file': [ size : 0x88, {
    'buf': [0x0, ['pointer', ['char']]],
    'size': [0x8, ['unsigned long']],
    'from': [0x10, ['unsigned long']],
    'count': [0x18, ['unsigned long']],
    'pad_until': [0x20, ['unsigned long']],
    'index': [0x28, ['long long']],
    'read_pos': [0x30, ['long long']],
    'version': [0x38, ['unsigned long long']],
    'lock': [0x40, ['mutex']],
    'op': [0x68, ['pointer', ['seq_operations']]],
    'poll_event': [0x70, ['int']],
    'file': [0x78, ['pointer', ['file']]],
    'private': [0x80, ['pointer', ['void']]],
}],
  'sockaddr': [ size : 0x10, {
    'sa_family': [0x0, ['unsigned short']],
    'sa_data': [0x2, ['array', 14, ['char']]],
}],
  'mem_cgroup_threshold': [ size : 0x10, {
    'eventfd': [0x0, ['pointer', ['eventfd_ctx']]],
    'threshold': [0x8, ['unsigned long']],
}],
  'flowi6': [ size : 0x48, {
    '__fl_common': [0x0, ['flowi_common']],
    'daddr': [0x20, ['in6_addr']],
    'saddr': [0x30, ['in6_addr']],
    'flowlabel': [0x40, ['unsigned int']],
    'uli': [0x44, ['flowi_uli']],
}],
  'device_type': [ size : 0x30, {
    'name': [0x0, ['pointer', ['char']]],
    'groups': [0x8, ['pointer', ['pointer', ['attribute_group']]]],
    'uevent': [0x10, ['pointer', ['void']]],
    'devnode': [0x18, ['pointer', ['void']]],
    'release': [0x20, ['pointer', ['void']]],
    'pm': [0x28, ['pointer', ['dev_pm_ops']]],
}],
  'netdev_hw_addr_list': [ size : 0x18, {
    'list': [0x0, ['list_head']],
    'count': [0x10, ['int']],
}],
  'pid': [ size : 0x50, {
    'count': [0x0, ['__unnamed_0x351']],
    'level': [0x4, ['unsigned int']],
    'tasks': [0x8, ['array', 3, ['hlist_head']]],
    'rcu': [0x20, ['callback_head']],
    'numbers': [0x30, ['array', 1, ['upid']]],
}],
  'neigh_parms': [ size : 0x98, {
    'net': [0x0, ['__unnamed_0x13d29']],
    'dev': [0x8, ['pointer', ['net_device']]],
    'list': [0x10, ['list_head']],
    'neigh_setup': [0x20, ['pointer', ['void']]],
    'neigh_cleanup': [0x28, ['pointer', ['void']]],
    'tbl': [0x30, ['pointer', ['neigh_table']]],
    'sysctl_table': [0x38, ['pointer', ['void']]],
    'dead': [0x40, ['int']],
    'refcnt': [0x44, ['__unnamed_0x351']],
    'callback_head': [0x48, ['callback_head']],
    'reachable_time': [0x58, ['int']],
    'data': [0x5c, ['array', 13, ['int']]],
    'data_state': [0x90, ['array', 1, ['unsigned long']]],
}],
  'rps_dev_flow': [ size : 0x8, {
    'cpu': [0x0, ['unsigned short']],
    'filter': [0x2, ['unsigned short']],
    'last_qtail': [0x4, ['unsigned int']],
}],
  'fib_info': [ size : 0x60, {
    'fib_hash': [0x0, ['hlist_node']],
    'fib_lhash': [0x10, ['hlist_node']],
    'fib_net': [0x20, ['pointer', ['net']]],
    'fib_treeref': [0x28, ['int']],
    'fib_clntref': [0x2c, ['__unnamed_0x351']],
    'fib_flags': [0x30, ['unsigned int']],
    'fib_dead': [0x34, ['unsigned char']],
    'fib_protocol': [0x35, ['unsigned char']],
    'fib_scope': [0x36, ['unsigned char']],
    'fib_type': [0x37, ['unsigned char']],
    'fib_prefsrc': [0x38, ['unsigned int']],
    'fib_priority': [0x3c, ['unsigned int']],
    'fib_metrics': [0x40, ['pointer', ['dst_metrics']]],
    'fib_nhs': [0x48, ['int']],
    'fib_weight': [0x4c, ['int']],
    'rcu': [0x50, ['callback_head']],
    'fib_nh': [0x60, ['array', 0, ['fib_nh']]],
}],
  '__unnamed_0xb378': [ size : 0x20, {
    '_pid': [0x0, ['int']],
    '_uid': [0x4, ['unsigned int']],
    '_status': [0x8, ['int']],
    '_utime': [0x10, ['long']],
    '_stime': [0x18, ['long']],
}],
  'file': [ size : 0x100, {
    'f_u': [0x0, ['__unnamed_0xa1b0']],
    'f_path': [0x10, ['path']],
    'f_inode': [0x20, ['pointer', ['inode']]],
    'f_op': [0x28, ['pointer', ['file_operations']]],
    'f_lock': [0x30, ['spinlock']],
    'f_count': [0x38, ['__unnamed_0x371']],
    'f_flags': [0x40, ['unsigned int']],
    'f_mode': [0x44, ['unsigned int']],
    'f_pos_lock': [0x48, ['mutex']],
    'f_pos': [0x70, ['long long']],
    'f_owner': [0x78, ['fown_struct']],
    'f_cred': [0x98, ['pointer', ['cred']]],
    'f_ra': [0xa0, ['file_ra_state']],
    'f_version': [0xc0, ['unsigned long long']],
    'f_security': [0xc8, ['pointer', ['void']]],
    'private_data': [0xd0, ['pointer', ['void']]],
    'f_ep_links': [0xd8, ['list_head']],
    'f_tfile_llink': [0xe8, ['list_head']],
    'f_mapping': [0xf8, ['pointer', ['address_space']]],
}],
  'mm_struct': [ size : 0x3c8, {
    'mmap': [0x0, ['pointer', ['vm_area_struct']]],
    'mm_rb': [0x8, ['rb_root']],
    'vmacache_seqnum': [0x10, ['unsigned int']],
    'get_unmapped_area': [0x18, ['pointer', ['void']]],
    'mmap_base': [0x20, ['unsigned long']],
    'mmap_legacy_base': [0x28, ['unsigned long']],
    'task_size': [0x30, ['unsigned long']],
    'highest_vm_end': [0x38, ['unsigned long']],
    'pgd': [0x40, ['pointer', ['__unnamed_0x635']]],
    'mm_users': [0x48, ['__unnamed_0x1a5']],
    'mm_count': [0x4c, ['__unnamed_0x1a5']],
    'nr_ptes': [0x50, ['__unnamed_0x1c5']],
    'nr_pmds': [0x58, ['__unnamed_0x1c5']],
    'map_count': [0x60, ['int']],
    'page_table_lock': [0x64, ['spinlock']],
    'mmap_sem': [0x68, ['rw_semaphore']],
    'mmlist': [0x90, ['list_head']],
    'hiwater_rss': [0xa0, ['unsigned long']],
    'hiwater_vm': [0xa8, ['unsigned long']],
    'total_vm': [0xb0, ['unsigned long']],
    'locked_vm': [0xb8, ['unsigned long']],
    'pinned_vm': [0xc0, ['unsigned long']],
    'shared_vm': [0xc8, ['unsigned long']],
    'exec_vm': [0xd0, ['unsigned long']],
    'stack_vm': [0xd8, ['unsigned long']],
    'def_flags': [0xe0, ['unsigned long']],
    'start_code': [0xe8, ['unsigned long']],
    'end_code': [0xf0, ['unsigned long']],
    'start_data': [0xf8, ['unsigned long']],
    'end_data': [0x100, ['unsigned long']],
    'start_brk': [0x108, ['unsigned long']],
    'brk': [0x110, ['unsigned long']],
    'start_stack': [0x118, ['unsigned long']],
    'arg_start': [0x120, ['unsigned long']],
    'arg_end': [0x128, ['unsigned long']],
    'env_start': [0x130, ['unsigned long']],
    'env_end': [0x138, ['unsigned long']],
    'saved_auxv': [0x140, ['array', 46, ['unsigned long']]],
    'rss_stat': [0x2b0, ['mm_rss_stat']],
    'binfmt': [0x2c8, ['pointer', ['linux_binfmt']]],
    'cpu_vm_mask_var': [0x2d0, ['array', 1, ['cpumask']]],
    'context': [0x310, ['__unnamed_0x2aa6']],
    'flags': [0x358, ['unsigned long']],
    'core_state': [0x360, ['pointer', ['core_state']]],
    'ioctx_lock': [0x368, ['spinlock']],
    'ioctx_table': [0x370, ['pointer', ['kioctx_table']]],
    'owner': [0x378, ['pointer', ['task_struct']]],
    'user_ns': [0x380, ['pointer', ['user_namespace']]],
    'exe_file': [0x388, ['pointer', ['file']]],
    'mmu_notifier_mm': [0x390, ['pointer', ['mmu_notifier_mm']]],
    'numa_next_scan': [0x398, ['unsigned long']],
    'numa_scan_offset': [0x3a0, ['unsigned long']],
    'numa_scan_seq': [0x3a8, ['int']],
    'tlb_flush_pending': [0x3ac, ['unsigned char']],
    'tlb_flush_batched': [0x3ad, ['unsigned char']],
    'uprobes_state': [0x3b0, ['uprobes_state']],
    'bd_addr': [0x3b8, ['pointer', ['void']]],
    'hugetlb_usage': [0x3c0, ['__unnamed_0x1c5']],
}],
  'file_lock_context': [ size : 0x38, {
    'flc_lock': [0x0, ['spinlock']],
    'flc_flock': [0x8, ['list_head']],
    'flc_posix': [0x18, ['list_head']],
    'flc_lease': [0x28, ['list_head']],
}],
  '__unnamed_0x57c6': [ size : 0x8, {
    '__unnamed_0x57ce': [0x0, ['__unnamed_0x57a2']],
    '_count': [0x4, ['__unnamed_0x351']],
}],
  'nfs4_lock_info': [ size : 0x8, {
    'owner': [0x0, ['pointer', ['nfs4_lock_state']]],
}],
  'termiox': [ size : 0x10, {
    'x_hflag': [0x0, ['unsigned short']],
    'x_cflag': [0x2, ['unsigned short']],
    'x_rflag': [0x4, ['array', 5, ['unsigned short']]],
    'x_sflag': [0xe, ['unsigned short']],
}],
  'ethtool_cmd': [ size : 0x2c, {
    'cmd': [0x0, ['unsigned int']],
    'supported': [0x4, ['unsigned int']],
    'advertising': [0x8, ['unsigned int']],
    'speed': [0xc, ['unsigned short']],
    'duplex': [0xe, ['unsigned char']],
    'port': [0xf, ['unsigned char']],
    'phy_address': [0x10, ['unsigned char']],
    'transceiver': [0x11, ['unsigned char']],
    'autoneg': [0x12, ['unsigned char']],
    'mdio_support': [0x13, ['unsigned char']],
    'maxtxpkt': [0x14, ['unsigned int']],
    'maxrxpkt': [0x18, ['unsigned int']],
    'speed_hi': [0x1c, ['unsigned short']],
    'eth_tp_mdix': [0x1e, ['unsigned char']],
    'eth_tp_mdix_ctrl': [0x1f, ['unsigned char']],
    'lp_advertising': [0x20, ['unsigned int']],
    'reserved': [0x24, ['array', 2, ['unsigned int']]],
}],
  'math_emu_info': [ size : 0x10, {
    '___orig_eip': [0x0, ['long']],
    'regs': [0x8, ['pointer', ['pt_regs']]],
}],
  'netprio_map': [ size : 0x18, {
    'rcu': [0x0, ['callback_head']],
    'priomap_len': [0x10, ['unsigned int']],
    'priomap': [0x14, ['array', 0, ['unsigned int']]],
}],
  'kernfs_elem_attr': [ size : 0x20, {
    'ops': [0x0, ['pointer', ['kernfs_ops']]],
    'open': [0x8, ['pointer', ['kernfs_open_node']]],
    'size': [0x10, ['long long']],
    'notify_next': [0x18, ['pointer', ['kernfs_node']]],
}],
  'device_node': [ size : 0xa8, {
    'name': [0x0, ['pointer', ['char']]],
    'type': [0x8, ['pointer', ['char']]],
    'phandle': [0x10, ['unsigned int']],
    'full_name': [0x18, ['pointer', ['char']]],
    'fwnode': [0x20, ['fwnode_handle']],
    'properties': [0x30, ['pointer', ['property']]],
    'deadprops': [0x38, ['pointer', ['property']]],
    'parent': [0x40, ['pointer', ['device_node']]],
    'child': [0x48, ['pointer', ['device_node']]],
    'sibling': [0x50, ['pointer', ['device_node']]],
    'kobj': [0x58, ['kobject']],
    '_flags': [0x98, ['unsigned long']],
    'data': [0xa0, ['pointer', ['void']]],
}],
  'ip6_flowlabel': [ size : 0x68, {
    'next': [0x0, ['pointer', ['ip6_flowlabel']]],
    'label': [0x8, ['unsigned int']],
    'users': [0xc, ['__unnamed_0x351']],
    'dst': [0x10, ['in6_addr']],
    'opt': [0x20, ['pointer', ['ipv6_txoptions']]],
    'linger': [0x28, ['unsigned long']],
    'rcu': [0x30, ['callback_head']],
    'share': [0x40, ['unsigned char']],
    'owner': [0x48, ['__unnamed_0x19c8a']],
    'lastuse': [0x50, ['unsigned long']],
    'expires': [0x58, ['unsigned long']],
    'fl_net': [0x60, ['pointer', ['net']]],
}],
  '__unnamed_0xfe4e': [ size : 0x4, {
    'csum': [0x0, ['unsigned int']],
    '__unnamed_0xfe63': [0x0, ['__unnamed_0xfe2a']],
}],
  'dev_archdata': [ size : 0x10, {
    'dma_ops': [0x0, ['pointer', ['dma_map_ops']]],
    'iommu': [0x8, ['pointer', ['void']]],
}],
  'in_ifaddr': [ size : 0x70, {
    'hash': [0x0, ['hlist_node']],
    'ifa_next': [0x10, ['pointer', ['in_ifaddr']]],
    'ifa_dev': [0x18, ['pointer', ['in_device']]],
    'callback_head': [0x20, ['callback_head']],
    'ifa_local': [0x30, ['unsigned int']],
    'ifa_address': [0x34, ['unsigned int']],
    'ifa_mask': [0x38, ['unsigned int']],
    'ifa_broadcast': [0x3c, ['unsigned int']],
    'ifa_scope': [0x40, ['unsigned char']],
    'ifa_prefixlen': [0x41, ['unsigned char']],
    'ifa_flags': [0x44, ['unsigned int']],
    'ifa_label': [0x48, ['array', 16, ['char']]],
    'ifa_valid_lft': [0x58, ['unsigned int']],
    'ifa_preferred_lft': [0x5c, ['unsigned int']],
    'ifa_cstamp': [0x60, ['unsigned long']],
    'ifa_tstamp': [0x68, ['unsigned long']],
}],
  'fib_node': [ size : 0x48, {
    'fn_hash': [0x0, ['hlist_node']],
    'fn_alias': [0x10, ['list_head']],
